{"id":615,"date":"2019-02-20T08:00:00","date_gmt":"2019-02-20T16:00:00","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=our-team&#038;p=615"},"modified":"2019-10-11T08:48:40","modified_gmt":"2019-10-11T15:48:40","slug":"employee-spotlight-jordan-pedraza-support","status":"publish","type":"our-team","link":"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/","title":{"rendered":"Employee Spotlight: Jordan Pedraza, Support"},"content":{"rendered":"\n<blockquote class=\"wp-block-quote\"><p>I take dignity and pride in my work because of my ancestors and all the people who fought for the rights and access I have today. That’s what motivates me to pay it forward&nbsp;to&nbsp;our community.<\/p><cite>Jordan Pedraza, Director of Support<\/cite><\/blockquote>\n\n\n\n<p>Black History Month is an important and special time for me. It’s a space to pause and reflect on stories, achievements and leaders from the black community which serves as a powerful reminder that black history is our history. It’s not enough to look back; we must also take stock of where we are today, look forward and lift others up. Although new grads face a better labor market these days, there are different trajectories for black new grads compared to their white peers. According to the&nbsp;<a href=\"https:\/\/www.epi.org\/publication\/the-class-of-2017\/\">Economic Policy Institute<\/a>, in 2017 the unemployment rate for black new grads was 8% while for white new grads it was 4.9%. Black families also tend to have less wealth which can widen disadvantages during college and beyond.<\/p>\n\n\n\n<p>This year’s Black History Month inspired me to share my journey and advice for other black students looking to build meaningful careers and overcome obstacles we may face. As a black Latina who was the second generation in my family to go to college, I never thought I’d one day be leading a support team for a fast-growing EdTech company. Throughout my journey, I’ve learned to respect the hustle, be scrappy, and make moves with whatever I had.<\/p>\n\n\n\n<h3><strong>Lesson #1: Work experience and activities have a domino effect. One opportunity can often lead to another, if you have the right mindset and you’re looking!<\/strong><\/h3>\n\n\n\n<p>I graduated during the Great Recession from a liberal arts school (Pomona) majoring in sociology and music. My parents weren’t well versed or networked in the public policy or tech fields I wanted to pursue and most of my classmates were planning to go to graduate school. I had loans to pay and scrambled savings together from work-study jobs to move back home, secure an apartment, and start adulting. Thankfully I was proactive and vocal about my career plans, I used all the resources I had access to, and learned some people skills that ultimately led to my first job after graduation. My on-campus, part-time, and volunteer jobs not only gave me extra cash for books and personal needs, they also helped to build my resume for future roles. My Student Representative role on a Teaching and Learning Committee led to a Tech Consultant job that led to my second job out of school with Google for Education. With all of these jobs, I had a lot of new things to learn, but I made sure to prepare for my interviews, show I had the right attitude for the job, and do my best work to get strong references. My advice for your college years:<\/p>\n\n\n\n<ol><li><strong>Go after anything and everything to help pay the bills, learn a skill, or meet new people.<\/strong>&nbsp;You can add it to your resume and the more people you know the more access to opportunities you’ll have.<\/li><li>Anyone can be a resource!&nbsp;<strong>Tell roommates, professors, RAs, friends, classmates, teammates, career center, college staff, and anyone else you meet what you’re looking to do.<\/strong>&nbsp;They can share advice, introduce you to other people, and share opportunities you might not hear about otherwise.<\/li><\/ol>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/kbLBikrJoDKNkaUtDlysuL1A-Hwwhv_9DUFf8dSgyuTHi1WSrNJGpSv6egehWqYk-iAFdFz1DURM23gQsbz0qCZL71ffMBEznZ2AG_k9mLuNI2ir1vMHFVOOlwIWROllMGPrcOEk\" alt=\"null\"\/><figcaption><em>The domino effect in action. Juggling all the things got me from Mathematica to Google!<\/em><\/figcaption><\/figure>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/jx81Gth_7WLRdnw5KCuarH6D67ZOlUl4UW46bsykLJvcckJGg4nlpiRQoRndz1kNADGO8vj49VEFYmX7qBjjYKpjyhTvqmQOIhFOjR4EhkoeXtrutBMD0-8zPbEHQeRIABJ4s5w4\" alt=\"null\"\/><\/figure>\n\n\n\n<h3><strong>Lesson #2: Own and share your story &#8211; don’t be shy about your journey, get crafty and creative. Even though we may face more disadvantages, our strength and resilience in overcoming them can give us a leg up.<\/strong><\/h3>\n\n\n\n<p>My first job out of school was a Research Assistant-Programmer with Mathematica Policy Research, a public policy research organization in Oakland, CA. I didn’t have Handshake back in my day (I’m glad my alma mater has it now!), but I submitted my application for the job through the Selective Liberal Arts Consortium (SLAC) Winter Interview Days in Washington D.C. I got help with my resume and conducted mock interviews with my career center, had friends, classmates, and professors look over my resume, and made sure to explain why I wanted the role and why I wanted to join Mathematica in my cover letter. I asked fellow classmates who else was applying to the SLAC Interview Days to get advice and learned it’s helpful to signup for an early slot to set the bar and interview when everyone’s fresh. I needed to come up with money to get a suit and flight out to DC from California, so I asked a senior to drive me to the mall to buy a suit on sale, reached out to sociology alumni in the D.C. area to see if I could stay with them for my trip.When it came to the interview, I made sure to be my deadpan humor, matter-of-fact self with professional positivity while sharing how I managed a full class load on top of 3-4 jobs at the same time. I was selected for a final onsite interview in Oakland with senior leaders in the office and continued the same approach. I had an intimidating lunch interview, but I asked classmates and professors for advice &#8211; don’t order noodles, soup, finger-food, or anything messy! Talk more than you eat. Oh and signup for that dining etiquette class offered from the career center (again I know not all schools offer this but ask around for help!). The cherry on top was talking about my progress with a classmate who happened to know a Research Assistant-Programmer already at Mathematica. He introduced us and she put in a good word for me. To sum up, my advice for landing the first job:<\/p>\n\n\n\n<ol><li><strong>Collect tips from everyone and anyone!&nbsp;<\/strong>Tell classmates, professors, your career center, and anyone else what you’re applying for to get advice. Ultimately, you’ll have to sift through all their great tips to decide what works for you, but use your immediate community to learn. You have more of a network than you might think! Ask your academic departments, advisor, RA, or student affairs about financial, wardrobe, and other resources to get to interviews.<\/li><li><strong>Learn from your peers.&nbsp;<\/strong>Get to know juniors and seniors in your field when in school and keep in touch for future advice. For those of you at Handshake schools, use Q&amp;A, Reviews, and the new peer messaging tool (coming out this year) to connect with your peers for their thoughts and experiences.<\/li><li>Be your authentic self in your cover letter, interviews, and all interactions.&nbsp;<strong>The interview starts as soon as you’re in contact with the company\/hiring team.<\/strong>&nbsp;Be ready to share why this role, why this company, and why you in a personal real way.<\/li><\/ol>\n\n\n\n<h3><strong>Lesson #3: Your first job is like college again &#8211; use it to learn what you like and build your experience, skills, and network to get to your goals.<\/strong><\/h3>\n\n\n\n<p>I’ve been working\/adulting for about 10 years now. I’ve worked in 2 industries, 4 companies, 7 functions, and 8 roles. This has all culminated in my current work today with leading a 20-person Support team here at Handshake. In looking back at my journey thus far, the domino effect remains the same. Each job I’ve worked in and each person I’ve met has gotten me to where I am today. The analytical and technical skills I gained at Mathematica led to my Account Manager role with Google for Education. My account management, community management, program management, education technology work, and keeping in touch with a Pomona friend led to my Community role at Remind. My events, marketing, and training work coupled with keeping in touch with former Googlers (Xooglers) in a Slack group led to my role at Handshake. As you continue and progress in your career, every step you make should add equity for you. That can be compensation, title, scope of role, benefits, environment, function, industry, or culture but always look to level up. Treat each job like it’s the interview where you do your best, build strong relationships, and stay in touch. Run towards problems and push yourself outside your comfort zone to grow. Don’t wait for mentors, sponsors, or new projects to come to you &#8211; find and create them and go for it. My specific advice:<\/p>\n\n\n\n<ol><li><strong>Read&nbsp;<a href=\"https:\/\/www.amazon.com\/s?k=the+first+90-days&amp;hvadid=323193605458&amp;hvdev=c&amp;hvlocphy=9031963&amp;hvnetw=g&amp;hvpos=1t1&amp;hvqmt=e&amp;hvrand=1709347534116670915&amp;hvtargid=kwd-307178918293&amp;tag=googhydr-20&amp;ref=pd_sl_5tfpy0wesx_e\">The First 90 Days<\/a>&nbsp;when starting a new job.<\/strong> It’s tailored for executives but it applies to anyone.<\/li><li><strong>Track, record, and share your accomplishments.<\/strong>&nbsp;Advocate for your goals and growth.<\/li><li><strong>Find a sponsor to advocate for new opportunities for you<\/strong>, find mentors within and outside of work to help you grow, and take on projects, roles, or goals that push you outside your comfort zone.<\/li><\/ol>\n\n\n\n<h3><strong>Lesson #4: It takes a village &#8211; build your community, advocate for your needs, pay it forward, and practice self-care. Be your ancestors’ wildest dream.<\/strong><\/h3>\n\n\n\n<p>Finding a job and company can be similar to how you found which school to attend, or finding a relationship. You must put thoughtful care and attention to what roles and companies you join since it’s 80% of your waking hours and where you’ll spend most of your time! In many industries or spaces we’ll often be the only ones in the room or office and it can get lonely, so building a support system is critical to your well-being and success. If there are other black employees at your company, your building, or office connect with them. If there’s a few of you at a company start an Employee Resource Group &#8211; even if it’s just getting lunch and having a chat group together. Join email lists, Facebook\/Slack groups, Meetups, and events in your area to meet other black professionals. And ultimately give back by offering advice and mentorship for other black students starting out, and push for your company and team to be an inclusive welcoming place for you and others.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/AVqTBKW7zWii7IkDCI8uvCZAEdeAispFycU4MxzhsxVj50GsjN6195nUwlrD8u4bbIBtGVtN-sghVXku4LMDzXQnvzJfKasTzkTZ45PY5D83cBGoE9aRryl3qiE2X9PVEs12V8En\" alt=\"null\"\/><figcaption><em>Wakanda@Handshake, Our black employee resource group and community turnin&#8217; up at the holiday party!<\/em><\/figcaption><\/figure>\n\n\n\n<p><\/p>\n\n\n\n<p>It’s been an amazing journey thus far and I’m just getting started. I take dignity and pride in my work because of my ancestors and all the people who fought for the rights and access I have today. That’s what motivates me to pay it forward&nbsp;to our community. Good luck in your journey and know that as we celebrate Black History Month we’re standing on the shoulders of giants and our ancestors. Always remember that you matter and you too can become your ancestors’ wildest dream. If I can be a resource, hit me up and if you’re interested in learning more about Handshake or joining our team, check out our&nbsp;<a href=\"https:\/\/joinhandshake.com\/careers\/\">careers page<\/a>!<\/p>\n\n\n\n<p>I’d love to hear other stories and tips! For all the students, new grads, and experienced professionals out there &#8211; what other advice would you share?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>During Black History Month, Jordan Pedraza, a Handshake employee who identifies as black and Latina, shares her journey and advice for other black students looking to build meaningful careers and overcome obstacles they may face.<\/p>\n","protected":false},"author":167034976,"featured_media":667,"menu_order":0,"template":"","our_team_category":[1443],"our_team_tag":[1431,1429],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Employee Spotlight: Jordan Pedraza, Support | Handshake<\/title>\n<meta name=\"description\" content=\"During Black History Month, Jordan Pedraza, a Handshake employee who identifies as black and Latina, shares her journey and advice for other black students looking to build meaningful careers and overcome obstacles they may face.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Employee Spotlight: Jordan Pedraza, Support | Handshake\" \/>\n<meta property=\"og:description\" content=\"During Black History Month, Jordan Pedraza, a Handshake employee who identifies as black and Latina, shares her journey and advice for other black students looking to build meaningful careers and overcome obstacles they may face.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2019-10-11T15:48:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Jordan-Pedraza.png?fit=1280%2C853&#038;ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"853\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Jordan-Pedraza.png?fit=1280%2C853&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Jordan-Pedraza.png?fit=1280%2C853&ssl=1\",\"width\":1280,\"height\":853},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/\",\"name\":\"Employee Spotlight: Jordan Pedraza, Support | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#primaryimage\"},\"datePublished\":\"2019-02-20T16:00:00+00:00\",\"dateModified\":\"2019-10-11T15:48:40+00:00\",\"description\":\"During Black History Month, Jordan Pedraza, a Handshake employee who identifies as black and Latina, shares her journey and advice for other black students looking to build meaningful careers and overcome obstacles they may face.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Employee Spotlight: Jordan Pedraza, Support\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Employee Spotlight: Jordan Pedraza, Support | Handshake","description":"During Black History Month, Jordan Pedraza, a Handshake employee who identifies as black and Latina, shares her journey and advice for other black students looking to build meaningful careers and overcome obstacles they may face.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/","og_locale":"en_US","og_type":"article","og_title":"Employee Spotlight: Jordan Pedraza, Support | Handshake","og_description":"During Black History Month, Jordan Pedraza, a Handshake employee who identifies as black and Latina, shares her journey and advice for other black students looking to build meaningful careers and overcome obstacles they may face.","og_url":"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2019-10-11T15:48:40+00:00","og_image":[{"width":1280,"height":853,"url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Jordan-Pedraza.png?fit=1280%2C853&ssl=1","path":"\/srv\/htdocs\/wp-content\/uploads\/2019\/09\/Jordan-Pedraza.png","size":"full","id":667,"alt":"","pixels":1091840,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Jordan-Pedraza.png?fit=1280%2C853&ssl=1","contentUrl":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Jordan-Pedraza.png?fit=1280%2C853&ssl=1","width":1280,"height":853},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/","name":"Employee Spotlight: Jordan Pedraza, Support | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#primaryimage"},"datePublished":"2019-02-20T16:00:00+00:00","dateModified":"2019-10-11T15:48:40+00:00","description":"During Black History Month, Jordan Pedraza, a Handshake employee who identifies as black and Latina, shares her journey and advice for other black students looking to build meaningful careers and overcome obstacles they may face.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/our-team\/employee-spotlight-jordan-pedraza-support\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Employee Spotlight: Jordan Pedraza, Support"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/our-team\/615"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/our-team"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/our-team"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034976"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/667"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=615"}],"wp:term":[{"taxonomy":"our_team_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/our_team_category?post=615"},{"taxonomy":"our_team_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/our_team_tag?post=615"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}