{"id":9967,"date":"2021-07-19T13:49:46","date_gmt":"2021-07-19T20:49:46","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=our-team&#038;p=9967"},"modified":"2021-07-19T14:13:25","modified_gmt":"2021-07-19T21:13:25","slug":"mission-driven-culture","status":"publish","type":"our-team","link":"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/","title":{"rendered":"Transitioning to a Mission-First Culture"},"content":{"rendered":"\n<p>Last month, the Engineering Leadership Community (<a href=\"https:\/\/sfelc.com\/\">ELC<\/a>) published a <a href=\"https:\/\/sfelc.com\/podcasts\/non-incremental-career-transitions-asif-makhani\">podcast<\/a> to explore the lessons of my transitions from an engineer at Amazon.com to helping found A9.com to leading teams at LinkedIn and Google to eventually joining as the CTO of Handshake late last year. The podcast interview focused on an important principle that has guided me through my past roles and finally here at Handshake: “When you look back at your career, what impact do you want to leave behind?” As excited as I am about the <a href=\"https:\/\/joinhandshake.com\/blog\/our-team\/category\/handshake-engineering\/\">hard technical problems<\/a> our teams are handling and the opportunity to work alongside <a href=\"https:\/\/joinhandshake.com\/blog\/our-team\/handshake-eng-week-recap-2020\/\">brilliant and kind folks<\/a>—this transition is unique as it was ultimately a calling towards our mission to help young people succeed in their careers by breaking systemic barriers.<\/p>\n\n\n\n<h2>Helping young people reach their potential&nbsp;<\/h2>\n\n\n\n<p>Over the last couple of decades, I have been increasingly spending my time on not-for-profit, youth and community development initiatives: be it a service-learning <a href=\"https:\/\/the.ismaili\/news\/global-encounters-life-changing-experience\">summer camp<\/a> in Kenya, or teaching <a href=\"https:\/\/iis.ac.uk\/curriculum\">faith and humanities<\/a> to youth in my religious community across the US, or serving on the board for <a href=\"https:\/\/www.americascoresbayarea.org\/\">America Scores<\/a> to provide after-school enrichment programs for low-income communities across the Bay Area. Throughout my direct engagement with thousands of young people, I have developed a deep conviction in their infinite potential and a commitment to help them reach that potential. Young people represent hope, ambition, and potential that the world so desperately needs. But so often they graduate lost, confused, anxious, and alone in their journeys. I believe our job here really is to harness that potential in young people, by supporting them in their optimal trajectories through guiding, counseling, and empowering, ultimately for them to uplift society.&nbsp;<\/p>\n\n\n\n<p>I have also painfully learned and recognized, however, that not all young people, despite how bright and ambitious they are, have access to the best opportunities to grow and make an impact on society. In my encounters with youth worldwide from Salamiyah to Kabul to Karachi to Mombasa, I have realized that the potential of millions of young people across the globe is getting marginalized every day due to the economic and social conditions of the society in which they live. This realization hit harder, and at home in the USA during the pandemic, when I embarked on a sabbatical to dedicate my time exclusively to volunteering with the youth in my local religious community, focusing both on digital engagement as well as advancing issues of social justice, equity, and inclusion. My efforts during the height of the COVID-19 pandemic heightened my awareness of the various systemic inequities in the US and further strengthened my belief that every young adult has incredible potential no matter their race, socioeconomic status, or other factors. Above all, I knew that I wanted to dedicate my career to breaking down systemic barriers and helping them realize that potential.&nbsp;<\/p>\n\n\n\n<p>That’s why finding a place as Handshake’s Chief Technology Officer felt kismet. Handshake’s mission to democratize opportunity for early talent and break down barriers for young people aligned with my reinvigorated drive to do the same. The company is uniquely positioned to make a huge impact, and I’m thrilled to help drive it forward by fostering and growing an engineering organization that is truly mission-focused.&nbsp;<\/p>\n\n\n\n<p>I have been incredibly fortunate in my career to work at extremely large companies, but have also seen firsthand how easy it is to lose sight of a mission as a team scales. Since joining Team Handshake, I’ve witnessed incredible growth—our engineering org recently hit 100 engineers, and we <a href=\"https:\/\/joinhandshake.com\/blog\/our-team\/no-luck-required\/\">closed our Series E funding round<\/a> at a $1.5B valuation. I’ve also seen that we have a rare opportunity here to be the exception to the trend of a company’s greater mission getting lost behind other priorities. Because Handshake’s product and culture is built so concretely around our mission, we have the chance to do things right, always keeping students and their success in mind.&nbsp;<\/p>\n\n\n\n<h3>Coming Full Circle with Search<\/h3>\n\n\n\n<p>When you’ve spent nearly 20 years working on search, it&#8217;s hard not to see everything as a search problem! But that’s exactly how I see what we’re doing at Handshake: we are a platform that seeks to democratize access to opportunity by helping employers <strong>find<\/strong> the best talent among a vast, diverse student population and helping students <strong>find<\/strong> the right positions to launch their careers. And, while focusing on these two sets of stakeholders, we are helping ensure that the workforce of tomorrow will be diverse, inclusive, and equitable.<\/p>\n\n\n\n<p>But executing on this mission requires addressing several search challenges:<\/p>\n\n\n\n<ul><li>Determining which jobs students want through a combination of explicit and inferred intent signals. This is especially challenging, because many students aren’t sure what they want, let alone how to express it. But the rewards justify the challenges: improving search relevance and the overall search experience through better retrieval, ranking, and presentation ultimately creates quality connections between students and employers.<\/li><li>Improving not only the precision but also the recall of employer outreach campaigns, where precision is the fraction of included recipients that are relevant, while recall is the fraction of the targeted recipients that the campaign managed to include. Increasing recall without decimating precision is hard, but it’s something we can help employers do by relaxing criteria or substituting less restrictive ones. The result can be campaigns that increase not only recall, but also inclusiveness, e.g., by nudging employers away from focusing on a handful of well-known schools.&nbsp;<\/li><li>Allowing employers to combine signals from employer-independent student profiles with signals from employer-specific behavior to prioritize outreach to the students most likely to be not only qualified for but also interested in those employers’ opportunities. In order to combine these signals scalably and efficiently, we had to innovate on our fundamental search architecture. Check out this recent blog <a href=\"https:\/\/joinhandshake.com\/blog\/our-team\/efficient-search-with-different-structured-data-sets\/\">post<\/a> from our senior software engineer Savannah Worth for more details on this topic.<\/li><li>Figuring out how to measure and model searcher behavior and success. Even as we frame our mission as a search problem, it’s important for us to remember that students and employers see search as a means to an end. We need to measure how effectively and efficiently our stakeholders achieve their ends, and then work tirelessly to improve their experiences.<\/li><\/ul>\n\n\n\n<p>As we go beyond serving our current students to serving early talent (including recent alumni) globally, our investments in data, search, and machine learning will be critical. These technologies will be key to building a progressive career platform where students (and beyond) can trace optimal career trajectories, discover and develop necessary skills, and build relationships with mentors and decision makers to avail the right “next” opportunity for their career.<\/p>\n\n\n\n<p>Over the coming months and years, I look forward to strengthening our expertise in search and relevance as a key enabler in achieving our mission. This includes hiring great search engineers and also learning from the best across the industry. One such luminary who has been working very closely with our engineers in shaping our search directions is <a href=\"https:\/\/www.linkedin.com\/in\/dtunkelang\/\" target=\"_blank\" rel=\"noreferrer noopener\">Daniel Tunkelang<\/a>. If you are a search enthusiast like me, you will enjoy this <a href=\"https:\/\/www.youtube.com\/watch?v=--GnNq7Hb0k\">insightful and entertaining talk<\/a> from Daniel at Handshake’s Speaker Series titled <a href=\"https:\/\/www.youtube.com\/watch?v=--GnNq7Hb0k\">“MMM, Search!”<\/a><\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/--GnNq7Hb0k?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"><\/iframe><\/span><\/div>\n<\/div><\/figure>\n\n\n\n<h3>Diversity as the Core<\/h3>\n\n\n\n<p>One of Handshake’s company values is empowered by diversity. We believe diversity and equity are vital and we keep them core to everything we do, from the products we design to the ways our teams are built and engaged.<\/p>\n\n\n\n<p>At Handshake, we believe talent is everywhere. We design our products to enable employers to not only optimize for response rates on outreach campaigns, but also ensure a diverse selection of students are included. We are investing in thoughtful and respectful ways to enable students to express their identity as part of their profiles, be it their preferred gender identity or their racial and ethnic identities. The goal is to help employers increase diversity and create opportunities for underrepresented groups, while maintaining an inclusive and empathetic experience for all students.<\/p>\n\n\n\n<p>As we more actively include advanced machine learning techniques in our products, we are seeking to learn from experts in the field of ML Fairness on how to be mindful of ways bias might try to creep into our algorithms.<\/p>\n\n\n\n<p>To learn more about challenges in ML Fairness, we hosted <a href=\"https:\/\/www.youtube.com\/watch?v=eAQLgopNZ14\">this talk<\/a> at <a href=\"https:\/\/www.youtube.com\/watch?v=eAQLgopNZ14\">Handshake’s Speaker Series by Tulsee Doshi<\/a>, Product Lead for Google’s ML Fairness and Responsible AI efforts.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/eAQLgopNZ14?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"><\/iframe><\/span><\/div>\n<\/div><\/figure>\n\n\n\n<p>We also believe diverse teams lead to more equitable products. We have hiring OKRs that seek to ensure representation at every level of Engineering. Our squads are location-agnostic so engineers are empowered to find the best role for themselves &amp; their careers without needing to worry about where they are based. Only ~50% of our engineering team lives near one of our offices. Hiring from across the US has allowed us access to truly exceptional talent who bring with them a wide array of experiences, career journeys, identities, &amp; skill sets. And they all come together, we all come together, to make Handshake the place it is.<\/p>\n\n\n\n<h3>Re-architecting for scale<\/h3>\n\n\n\n<p>Handshake is a small company tackling big problems. We&#8217;re focused on staying nimble as we grow. In the past, a Ruby monolith served us well. At 100+ engineers &amp; growing, we are taking the time to invest in breaking the monolith into separate services with clear service ownership and seamlessly discoverable APIs. These services will have clear boundaries, allowing teams to have full ownership over their systems and long-term charter. We believe this is critical to building deep competencies and maintaining a culture of agency, autonomy and innovation. Related to this effort is transitioning from a single, centralized on-call rotation to team-based rotations. Teams are on-call for their own services and the code that they write which reinforces a culture of quality.<\/p>\n\n\n\n<p>We are also investing in our developer experience, CI\/CD, and production infrastructure automation to make releasing to production quick, clean and uneventful. We are challenging ourselves to find new ways to deliver products: efficiently, on-time, without surprises, and with quality. Our recent efforts to measure and improve execution effectiveness seek to ensure that engineers have the right level of tooling and automation, with minimal roadblocks to be productive, and ultimately have a large impact on a meaningful mission.<\/p>\n\n\n\n<h3>Join Us<\/h3>\n\n\n\n<p>If you want to look back and be proud of the impact of your work…<br>If you want to find new ways to embrace diversity and inclusion…<br>If you want to take on hard problems without big company roadblocks…<br>Come <a href=\"https:\/\/joinhandshake.com\/join-us\/\">join us<\/a> on our mission!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Handshake CTO Asif Makhani shares why a mission driven culture is the key to company and career success.<\/p>\n","protected":false},"author":167034990,"featured_media":9970,"menu_order":0,"template":"","our_team_category":[1615,1443],"our_team_tag":[1430,1706,1427,1691,1539,1428,1705,1707,1429,1648],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Transitioning to a Mission-First Culture | Handshake<\/title>\n<meta name=\"description\" content=\"Handshake CTO Asif Makhani explores why data, search, and machine learning are key to ensuring an inclusive workforce of tomorrow.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Transitioning to a Mission-First Culture | Handshake\" \/>\n<meta property=\"og:description\" content=\"Handshake CTO Asif Makhani explores why data, search, and machine learning are key to ensuring an inclusive workforce of tomorrow.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2021-07-19T21:13:25+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_Blog_Why-I-Joined-Handshake_June2021_Asif.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"800\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_Blog_Why-I-Joined-Handshake_June2021_Asif.jpg?fit=1200%2C800&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_Blog_Why-I-Joined-Handshake_June2021_Asif.jpg?fit=1200%2C800&ssl=1\",\"width\":1200,\"height\":800},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/\",\"name\":\"Transitioning to a Mission-First Culture | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#primaryimage\"},\"datePublished\":\"2021-07-19T20:49:46+00:00\",\"dateModified\":\"2021-07-19T21:13:25+00:00\",\"description\":\"Handshake CTO Asif Makhani explores why data, search, and machine learning are key to ensuring an inclusive workforce of tomorrow.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Transitioning to a Mission-First Culture\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Transitioning to a Mission-First Culture | Handshake","description":"Handshake CTO Asif Makhani explores why data, search, and machine learning are key to ensuring an inclusive workforce of tomorrow.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/","og_locale":"en_US","og_type":"article","og_title":"Transitioning to a Mission-First Culture | Handshake","og_description":"Handshake CTO Asif Makhani explores why data, search, and machine learning are key to ensuring an inclusive workforce of tomorrow.","og_url":"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2021-07-19T21:13:25+00:00","og_image":[{"width":1200,"height":800,"url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_Blog_Why-I-Joined-Handshake_June2021_Asif.jpg","path":"\/srv\/htdocs\/wp-content\/uploads\/2021\/07\/HS_Blog_Why-I-Joined-Handshake_June2021_Asif.jpg","size":"full","id":9970,"alt":"","pixels":960000,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_Blog_Why-I-Joined-Handshake_June2021_Asif.jpg?fit=1200%2C800&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_Blog_Why-I-Joined-Handshake_June2021_Asif.jpg?fit=1200%2C800&ssl=1","width":1200,"height":800},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/","name":"Transitioning to a Mission-First Culture | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#primaryimage"},"datePublished":"2021-07-19T20:49:46+00:00","dateModified":"2021-07-19T21:13:25+00:00","description":"Handshake CTO Asif Makhani explores why data, search, and machine learning are key to ensuring an inclusive workforce of tomorrow.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/our-team\/mission-driven-culture\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Transitioning to a Mission-First Culture"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/our-team\/9967"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/our-team"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/our-team"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034990"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/9970"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=9967"}],"wp:term":[{"taxonomy":"our_team_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/our_team_category?post=9967"},{"taxonomy":"our_team_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/our_team_tag?post=9967"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}