{"id":10031,"date":"2021-07-28T12:29:45","date_gmt":"2021-07-28T19:29:45","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=10031"},"modified":"2021-07-28T13:23:14","modified_gmt":"2021-07-28T20:23:14","slug":"fall-recruiting-tips-from-handshakes-early-talent-award-winners","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/","title":{"rendered":"Fall Recruiting Tips from Handshake&#8217;s Early Talent Award Winners"},"content":{"rendered":"\n<p>The pandemic may have put a stop to in-person career fairs, but that hasn’t prevented 30,000+ employers from building relationships with students at virtual career events on Handshake since March 2020. One year later, <a href=\"https:\/\/joinhandshake.com\/network-trends\/virtual-recruiting\/\" target=\"_blank\" rel=\"noreferrer noopener\">many of the lessons<\/a> learned—accessibility, convenience, and equity—prove that virtual recruiting is here to stay.<\/p>\n\n\n\n<p>This fall, set yourself up for success by adopting proven candidate engagement tips from <strong>several winners of the inaugural <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/120-employers-driving-the-next-generation-of-early-talent-recruiting\/\" target=\"_blank\" rel=\"noreferrer noopener\">Handshake Early Talent Awards (ETAs)<\/a>: Liberty Mutual, Gap Inc., Prudential, Kiewit, and UnitedHealth Group.<\/strong> These employers were recognized for their significant achievements in recruiting tomorrow’s leaders by excelling at the following criteria:&nbsp;<\/p>\n\n\n\n<ul><li><strong>Student interest:<\/strong> total # of job views compared to all jobs posted&nbsp;<\/li><li><strong>Message engagement:<\/strong> # of clicks per distinct message recipient&nbsp;<\/li><li><strong>Brand resonance:<\/strong> # of distinct applicants per job impression&nbsp;<\/li><li><strong>Virtual event participation:<\/strong> registrants per virtual fair\/event<\/li><\/ul>\n\n\n\n<p>In this blog post, we’re sharing some of the special sauce that went into these winner’s <strong>strategies to recruit virtually, including how they build meaningful relationships and elevate the candidate experience. <\/strong>Incorporating these tips into your fall plan will allow you to stand out to candidates (and increase your chances of winning an ETA next year)!<\/p>\n\n\n\n<h2>Liberty Mutual Uses Virtual Events to Showcase Variety of Roles<\/h2>\n\n\n\n<p>The pandemic unleashed the power of virtual recruiting for Liberty Mutual. To score big at the ETAs, Liberty Mutual harnessed Handshake to build relationships at scale and create thoughtful event content.&nbsp;<\/p>\n\n\n\n<p>A key takeaway from Liberty Mutual: <strong>introducing students to your brand early on in their college journeys leads to more engagement over time.&nbsp;<\/strong><\/p>\n\n\n\n<h6>Use <a href=\"https:\/\/joinhandshake.com\/employers\/solutions\/engage\/\" target=\"_blank\" rel=\"noreferrer noopener\">Handshake Event Manager<\/a> to create an infinite number of branded virtual events and experiences for underclassmen in addition to upperclassmen.&nbsp;<\/h6>\n\n\n\n<p><strong>Liberty Mutual&#8217;s tips for engaging early talent this fall:<\/strong><\/p>\n\n\n\n<ol><li>Create a cohesive candidate journey across your brand. Dress in the color scheme of your brand, use those colors in the background of your video calls, etc.&nbsp;<\/li><li>Offer a variety of event types, like:<br><ul><li>Skill-building experiences (i.e. public speaking)<\/li><li>Topics Gen Z cares about (i.e. DEI and mental health)<\/li><li>Tactical support (i.e. building out <a href=\"https:\/\/joinhandshake.com\/blog\/students\/step-up-your-profile-summer-challenge\/\" target=\"_blank\" rel=\"noreferrer noopener\">students’ Handshake profiles<\/a>)<\/li><\/ul><\/li><li><strong>Whether a student attends a virtual career event or not, a connection was made with your company. <\/strong>Event registration provides a touchpoint for you to follow-up on and build a relationship with that student.<\/li><li>Supplement all experiences with before, during, and after event outreach<em>. <\/em>Communicate at regular intervals (i.e. monthly) via multiple touchpoints (i.e. virtual event invites, 1:1 messages, newsletters) and timely content.<\/li><li>Recruiters are at the forefront of virtual recruiting innovation. Communicate impact with hiring managers and decision makers. <a href=\"https:\/\/joinhandshake.com\/employers\/solutions\/hire\/\" target=\"_blank\" rel=\"noreferrer noopener\">Handshake Premium’s Analytics and Insights modules<\/a> can help you present on which events are working well, where, and why.&nbsp;<\/li><\/ol>\n\n\n\n<h6>Recognize that students have limited time between juggling class, studying, and other demands. Putting yourself in their shoes, consider if a session that’s traditionally been 1 hour can actually be 30 minutes.<\/h6>\n\n\n\n<h2>Gap Inc. Solicits Feedback on the Candidate Experience to Improve Events<\/h2>\n\n\n\n<p>Having to adapt to virtual recruiting was a game changer for Gap Inc.’s early talent strategy. By scaling up virtual strategies, Gap found that business needs can be met with a more diverse set of schools. They rely on Handshake to tap into students with different backgrounds and new schools that hadn’t previously been on their radar.&nbsp;Now, Gap executes on a strategy to meet students where they are, and how they want to be engaged with.&nbsp;<\/p>\n\n\n\n<h6>Gap Inc. saw strong engagement with smaller format events, and by doing follow up sessions after large format events.&nbsp;<\/h6>\n\n\n\n<p><strong>Gap Inc.’s tips for engaging early talent this fall:<\/strong><\/p>\n\n\n\n<ol><li>Seek out feedback on the candidate experience to uncover blind spots. (Put bluntly, you want to know if students find a session boring!) Gap collected virtual event feedback from students and found that some of their standard events were too long and too one way.&nbsp;<\/li><li>Gap developed topical event series, such as “Several Seats at the Table”, to address the company’s commitment to inclusion and share info about employee belonging groups. After events like these, they follow up with virtual 1:1 information sessions to evaluate qualified candidates for open positions. <strong>Relationship-building requires follow up, so don’t skip that step!<\/strong><\/li><li>Career fairs are often limited to one day and time. Now, Gap Inc. creates bite-sized info sessions and posts these on YouTube, creates at-a-glance one pagers, and customizes messages with student’s names, school, and major at scale.<\/li><li>Target freshmen and sophomores with learning experiences over the course of an event series to expose them early to functional tracks, professional development, and internship opportunities.<\/li><li>Gap Inc. worked with their Handshake expert account team to specify Segments to target the talent they were looking for.&nbsp;<\/li><\/ol>\n\n\n\n<h6>With Handshake Premium you can <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/\" target=\"_blank\" rel=\"noreferrer noopener\">create a digital employer brand<\/a> that speaks to Gen Z, offer experiences that allow for additional learning about your company, and dramatically expand access to students.<\/h6>\n\n\n\n<h2>Prudential Incorporates Personalization and Employee Engagement into Every Program<\/h2>\n\n\n\n<p>Virtual recruiting acted as a catalyst for Prudential in building a more inclusive and expansive sourcing strategy. The pandemic was an ah-ha moment that led Prudential to revisit why they only recruited from certain schools, so they turned to Handshake to diversify their schools strategy and innovate how they expressed their brand to early talent digitally.<\/p>\n\n\n\n<h6>Use <a href=\"https:\/\/joinhandshake.com\/employers\/solutions\/source\/\" target=\"_blank\" rel=\"noreferrer noopener\">Handshake’s School Explorer<\/a> to plan which schools to develop close relationships with and build relationships with candidates you want through Campaigns at scale.<\/h6>\n\n\n\n<p><strong>Prudential’s tips for engaging early talent this fall:<\/strong><\/p>\n\n\n\n<ol><li><strong>To really level the playing field, <\/strong><a href=\"https:\/\/joinhandshake.com\/blog\/employers\/3-hiring-practices-that-disadvantage-black-students\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>re-examine your qualifications<\/strong><\/a><strong>.<\/strong> Look into candidates who have different majors, double down on coursework or skills, and include candidates who are pursuing their associates degree or are in bootcamps.&nbsp;<\/li><li>In the fall recruiting season, offer events that set students up for success such as resume workshops. During the spring and summer, lean into brand building and diversity-focused events.&nbsp;<\/li><li>In the past, Prudential didn’t cap event attendance and went for a quantity goal. In shifting to virtual, they used a very practical consideration to guide their event attendance goals: <strong>on a Zoom call, you can only see up to 25 faces<\/strong> <strong>at once<\/strong>!&nbsp;<\/li><li>Let students choose how they want to engage with you. Something as simple as changing the time that you host events can make a big impact on event attendance. For increased accessibility, record all of your events and add them to your <a href=\"https:\/\/joinhandshake.com\/employers\/products\/premium\/?slide=brand\" target=\"_blank\" rel=\"noreferrer noopener\">Handshake Employer Page<\/a>.&nbsp;<\/li><li>Prudential taps employees to share their personal stories about how they’re navigating their careers. Partner with business resource groups to build authentic programming and foster relationships between students and employees who look like them. <strong>Part of the relationship-building process is encouraging employees to stay in touch with the candidate<\/strong> and turning off the corporate speak!&nbsp;<\/li><\/ol>\n\n\n\n<h2>Kiewit Diversifies Their School Strategy to Attract Target Groups<\/h2>\n\n\n\n<p>Kiewit’s perspective is that 2020 was the best case scenario for forward-thinking strategies: they can now do more, more efficiently, and more cost effectively by engaging candidates virtually. This fall, the opportunity to conduct hybrid recruiting will incorporate lessons learned while formalizing the wins that resulted from the past year.&nbsp;<\/p>\n\n\n\n<p>A key takeaway: <strong>identify an executive sponsor for your early talent program to back you up on its efficacy and help disseminate impact.<\/strong>&nbsp;<\/p>\n\n\n\n<p><strong>Kiewit’s tips for engaging early talent this fall:<\/strong><\/p>\n\n\n\n<ol><li>Kiewit set out to establish accountability from the top down to develop talent within their ranks by using Handshake to build an early talent pipeline that can ultimately diversify its workforce at every level.&nbsp;<\/li><li>You may need to educate the business that when recruiting was primarily in person, your team didn’t find all talent at in-person career fairs in the first place! <strong>Sourcing digitally doesn’t diminish the value of those in-person touchpoints, but it does mean that your precious resources can be freed up from days on the road to accomplish the same work in an afternoon spent on Handshake.&nbsp;<\/strong><\/li><li>Perform a top-of-funnel assessment of what’s important to the candidates you’re trying to attract. Women comprise only 10% of the construction workforce, and Kiewit embraced that they needed to engage women differently to recruit them. Making sure a female operational leader was present at career fairs may sound like a no brainer, but Kiewit admits they overlooked this in the past.&nbsp;<\/li><li>The “Future Women with Kiewit” seminar held every semester, is an example of targeted event content that is best practice for engaging a specific audience.&nbsp;<\/li><li>Consider adopting a program like <a href=\"https:\/\/www.kiewit.com\/pages\/university-relations\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kiewit’s Faculty Scholars<\/a>, where a college professor interns at Kiewit to take that experience back to the classroom and facilitate knowledge sharing to their students.&nbsp;<\/li><\/ol>\n\n\n\n<h6>You might find that your company has maintained allegiances to certain schools, but breaking perceptions into a school-agnostic approach and vocalizing your strategy with upper management can dramatically tilt the balance of your early talent recruit strategy toward equity. Find out why with <a href=\"https:\/\/joinhandshake.com\/employers\/products\/premium\/?slide=roi\" target=\"_blank\" rel=\"noreferrer noopener\">insights from Handshake<\/a>.&nbsp;<\/h6>\n\n\n\n<h2>UnitedHealth Group Builds Relationships By Storytelling Across Channels<\/h2>\n\n\n\n<p>To make sure the candidate experience is authentic, relevant, and compelling, UnitedHealth Group surveys students throughout their program. What sets this ETA winner apart is how UnitedHealth Group incorporates their company’s values throughout materials and experiences to tell a cohesive story.&nbsp;<\/p>\n\n\n\n<p>A key takeaway: <strong>utilize video as a humanized way for current employees to share their stories with candidates and build relationships.<\/strong>&nbsp;<\/p>\n\n\n\n<p><strong>UnitedHealth Group&#8217;s tips for engaging early talent this fall:<\/strong><\/p>\n\n\n\n<ol><li>Approach candidate engagement through multi-channel marketing. Your Handshake Employer Page, careers page, and social presence are all sources of truth for Gen Z to get a sense of culture, alignment with interests, and belonging.<\/li><li>Video is a brand-building medium that candidates can access on their own time. Live or recorded video content is a great way for employees to use their authentic voices to address your company’s stance on <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/is-gen-z-ready-for-reopening\/\" target=\"_blank\" rel=\"noreferrer noopener\">issues that are important to Gen Z<\/a>–like social justice, environmental causes, and LGBTQ+ rights.&nbsp;<\/li><li>According to UnitedHealth Group, students are most likely to respond to relevant messages that:&nbsp;<ul><li>are personalized<\/li><li>contain job opportunities<\/li><li>spell out the recruiting process<\/li><li>clarify if a response is needed<\/li><\/ul><\/li><li><a href=\"http:\/\/joinhandshake.com\/network-trends\/virtual-recruiting\/\" target=\"_blank\" rel=\"noreferrer noopener\">Virtual recruiting has shifted the accessibility paradigm.<\/a> UnitedHealth Group <em>expanded<\/em> their internship hiring during the pandemic so that students impacted by COVID could still have a meaningful experience, and gain applicable skills and opportunities to network.<\/li><li>To help students <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/6-employer-strategies-for-addressing-the-digital-divide\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>bridge the digital divide and navigate the hiring&nbsp; process virtually<\/strong><\/a>, dedicate events to subjects such as making recruiter connections, communicating in online settings, and connecting with school alumni or current employees.<\/li><\/ol>\n\n\n\n<h6>Leverage Handshake thought leadership such as our quarterly <a href=\"https:\/\/joinhandshake.com\/network-trends\/\" target=\"_blank\" rel=\"noreferrer noopener\">Handshake Network Trends<\/a> and <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/handshakes-2020-campus-to-career-report\/\" target=\"_blank\" rel=\"noreferrer noopener\">annual Campus to Career reports<\/a> to keep on top of what’s important to Gen Z.<\/h6>\n\n\n\n<p>There you have it! Tips and tricks from ETA winners that can help you achieve similarly outstanding results for your early talent recruitment program–and catalyze careers. Having a virtual recruiting strategy is equity in action, and central to that strategy is relationship building.&nbsp;<\/p>\n\n\n\n<p>A key takeaway across these winning programs is that <strong>once a student engages with your company, they are likely to continue engaging with your company.<\/strong>&nbsp;<\/p>\n\n\n\n<p>Do you feel ETA FOMO? Well, fall is prime time to make sure your fall plans meet the ETA criteria–so your company can be eligible to win next year! <a href=\"https:\/\/joinhandshake.com\/employers\/resources\/fall-2021-recruiting-cheat-sheet\/\" target=\"_blank\" rel=\"noreferrer noopener\">Get more tactics in our fall 2021 recruiting cheat sheet<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This fall, set yourself up for success by adopting proven candidate engagement tips from winners of Handshake&#8217;s ETAs.<\/p>\n","protected":false},"author":167034991,"featured_media":10045,"menu_order":0,"template":"","employers_category":[1416],"employers_tag":[1441,1449,1580],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Fall Recruiting Tips from Handshake&#039;s Early Talent Award Winners<\/title>\n<meta name=\"description\" content=\"Get strategies to recruit virtually, build relationships, and elevate the candidate experience from Handshake&#039;s Early Talent Award winners.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Fall Recruiting Tips from Handshake&#039;s Early Talent Award Winners\" \/>\n<meta property=\"og:description\" content=\"Get strategies to recruit virtually, build relationships, and elevate the candidate experience from Handshake&#039;s Early Talent Award winners.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2021-07-28T20:23:14+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_NIN_ETAsTipsAndTricks_BlogImage.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2880\" \/>\n\t<meta property=\"og:image:height\" content=\"1920\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_NIN_ETAsTipsAndTricks_BlogImage.jpg?fit=2880%2C1920&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_NIN_ETAsTipsAndTricks_BlogImage.jpg?fit=2880%2C1920&ssl=1\",\"width\":2880,\"height\":1920},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/\",\"name\":\"Fall Recruiting Tips from Handshake's Early Talent Award Winners\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#primaryimage\"},\"datePublished\":\"2021-07-28T19:29:45+00:00\",\"dateModified\":\"2021-07-28T20:23:14+00:00\",\"description\":\"Get strategies to recruit virtually, build relationships, and elevate the candidate experience from Handshake's Early Talent Award winners.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Fall Recruiting Tips from Handshake&#8217;s Early Talent Award Winners\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Fall Recruiting Tips from Handshake's Early Talent Award Winners","description":"Get strategies to recruit virtually, build relationships, and elevate the candidate experience from Handshake's Early Talent Award winners.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/","og_locale":"en_US","og_type":"article","og_title":"Fall Recruiting Tips from Handshake's Early Talent Award Winners","og_description":"Get strategies to recruit virtually, build relationships, and elevate the candidate experience from Handshake's Early Talent Award winners.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2021-07-28T20:23:14+00:00","og_image":[{"width":2880,"height":1920,"url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_NIN_ETAsTipsAndTricks_BlogImage.jpg","path":"\/srv\/htdocs\/wp-content\/uploads\/2021\/07\/HS_NIN_ETAsTipsAndTricks_BlogImage.jpg","size":"full","id":10045,"alt":"","pixels":5529600,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_NIN_ETAsTipsAndTricks_BlogImage.jpg?fit=2880%2C1920&ssl=1","contentUrl":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/07\/HS_NIN_ETAsTipsAndTricks_BlogImage.jpg?fit=2880%2C1920&ssl=1","width":2880,"height":1920},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/","name":"Fall Recruiting Tips from Handshake's Early Talent Award Winners","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#primaryimage"},"datePublished":"2021-07-28T19:29:45+00:00","dateModified":"2021-07-28T20:23:14+00:00","description":"Get strategies to recruit virtually, build relationships, and elevate the candidate experience from Handshake's Early Talent Award winners.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/fall-recruiting-tips-from-handshakes-early-talent-award-winners\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Fall Recruiting Tips from Handshake&#8217;s Early Talent Award Winners"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/10031"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034991"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/10045"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=10031"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=10031"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=10031"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}