{"id":1131,"date":"2019-11-27T07:01:09","date_gmt":"2019-11-27T15:01:09","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=1131"},"modified":"2019-11-27T07:01:09","modified_gmt":"2019-11-27T15:01:09","slug":"how-to-build-an-employer-brand-early-talent-loves","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/","title":{"rendered":"How to Build an Employer Brand Early Talent Loves"},"content":{"rendered":"\n<p>Nowadays it seems every employer across every industry is recruiting from the same pool of competitive talent. For brands without a well-known consumer brand, the competition is steep. Yet the investment is worth the outcome. A meaningful employer brand has the potential to <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/blog.hubspot.com\/marketing\/employer-branding\" target=\"_blank\">increase qualified applicants by 50% and cut your cost-per-hire in half<\/a>.<br><br>Like recruiting, employer branding has changed considerably over the last few decades, especially in today’s tech-savvy landscape. With early talent recruiting driving how employers achieve both their diversity and strategic hiring goals, how you approach your employer brand in the eyes of Gen Z has never been more important.<\/p>\n\n\n\n<p>This up-and-coming generation is eager to work hard, learn, and grow, but hiring them won’t be easy. When it comes to self-directing their career paths, they are in the driver’s seat because their technical skills are exceptionally competitive.<\/p>\n\n\n\n<p>According to Handshake’s Head of Employer Marketing, Kristen Ribero, <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.talent-champions.com\/episode-12-talent-brand-kristen-ribero\" target=\"_blank\">employer brand is a perception based off of established trust<\/a>—or distrust—in a company. It is inversely related to marketing, yet intangible. It is not your logo, benefits, or founder’s clout. Nor is it only a careers page, Instagram takeover, or highway billboard.<\/p>\n\n\n\n<p>It’s a holistic approach that makes promises to inspire candidates on an authentic level. In this post, we’ll highlight four ways to reach early talent on their terms. We’ll also share how to do so by leveraging the everyday technology they already rely on.<\/p>\n\n\n\n<h3><strong>1. Identify the values that empower your people.<\/strong><\/h3>\n\n\n\n<p>To get started, ask yourself, why do people love working for your company? The answer to this question is what your employer brand needs to magnify. As the first generation of digital natives, early career talent is highly discerning about the information they receive online.<\/p>\n\n\n\n<p>The first six months of developing or revisiting your employer brand should be rooted in qualitative and quantitative research—well before activation—and closely followed by opportunities for feedback. Don’t limit research internally—tap into your network and professional groups to help you get those insights. Then consider how you tailor your employer brand to each talent segment, including women and minorities.<\/p>\n\n\n\n<p><a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/medium.com\/authority-magazine\/how-to-identify-and-retain-fantastic-talent-with-jenn-mann-of-sas-and-kage-spatz-2193c75eafb3\" target=\"_blank\">SAS CHRO, Jenn Mann<\/a>, emphasizes that your employer brand shows prospects what makes you special and why they should want to work for you. Get smart about exploring the types of content that convert different candidates. And invite marketing, hiring managers, and colleagues to the table to weigh in.<\/p>\n\n\n\n<p>When Handshake Premium partner, <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.youtube.com\/watch?v=JuDWZe33YPQ\" target=\"_blank\">Raymond James<\/a>—a Fortune 500 investment bank and financial services company—recruits for technical roles in information technology, for example, their brand is FinTech. When they tap into equity capital talent, they brand themselves as the premier alternative to Wall Street.<\/p>\n\n\n\n<p>Meanwhile, <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/mt-bank-optimizes-on-campus-visits-with-proactive-outreach-on-handshake\/\" target=\"_blank\">M&amp;T Bank Corporation<\/a>—a mid-Atlantic bank and Handshake Premium partner headquartered in Buffalo, NY—proactively taps into early talent who have demonstrated a desire or interest in working or relocating to Upstate New York.<br><br>For inspiration, explore employer brands that inspire you and learn how they approach a dynamic and holistic approach to their employer brand.<\/p>\n\n\n\n<h3><strong>2. Highlight opportunities for learning and professional growth.<\/strong><\/h3>\n\n\n\n<p>Early talent may be kick-starting their careers in droves, but they are already thinking about their futures. Gen Z wants to get ahead in the workforce, and they are all about advancing rapidly. According to Handshake’s <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/handshakes-2019-campus-to-career-report\/\">Campus to Career report<\/a>, 75% of students and young alumni believe that they should be promoted within a year.<\/p>\n\n\n\n<p>One of the best ways to speak to Gen Z’s values is to meet them on their terms. Understand that the time during and after college graduation tends to be vulnerable: new grads want to make sure that they’re taking the right next steps in life. Speak to their ambition. Show them what a career at your company looks like. And be clear about the details that they will need to make the right decision.<\/p>\n\n\n\n<p>Take a look at <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.hubspot.com\/careers\/students\/entry-level\" target=\"_blank\">HubSpot’s early talent career portal<\/a> on its website, for example. Early talent job seekers exploring their first or second job out of college have access to a wealth of information that’s relevant to them to understand what it’s like, exactly, to launch their career at HubSpot.<\/p>\n\n\n\n<p>The company pairs its careers page experience with an “about” section on Handshake that describes the employer&#8217;s commitment to valuing each employee. On Handshake, <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.youtube.com\/watch?v=EbEuUnQFyQ8\" target=\"_blank\">HubSpot shares insight<\/a> that helps early talent uncover details that are important to them. Together, these resources tell a story of how each individual contributes to the company’s core value propositions.<\/p>\n\n\n\n<p>Early talent, just like their more experienced predecessors, care about job stability, earning an income, and receiving top-notch benefits such as tuition reimbursement, commuter benefits, 401(k) plans, and stock options. They also care about mentoring opportunities. Arguably above all, they care about inclusivity.<\/p>\n\n\n\n<p>“Generation-Z is the first fully digital generation, and yet, they yearn for human interaction at work,” writes career coach Ashley Stahl for Forbes. In fact, <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.prnewswire.com\/news-releases\/failure-drives-innovation-according-to-ey-survey-on-gen-z-300714436.html\" target=\"_blank\">9 in 10 Gen Zers report wanting<\/a> an element of humanization woven into their team fabric and interactions. The most <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.npr.org\/2018\/11\/15\/668106376\/generation-z-is-the-most-racially-and-ethnically-diverse-yet\" target=\"_blank\">racially and ethnically diverse generation<\/a> yet craves a sense of inclusion and belonging from their workplace.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Human connections begin the first moment a potential hire learns about your company, making personalization a must for any employer that wants to reach Gen Z.<\/p><\/blockquote>\n\n\n\n<p>Human connections begin at the very first moment a potential hire learns about your company, making personalization a must for any company that wants to reach Gen Z. The challenge busy recruiters face, however, is that there isn’t enough time in the day to invest in tailored communication with each and every person they engage. One way to overcome this roadblock is through your employer brand. <\/p>\n\n\n\n<p>Your employer brand should reinforce the message that new grads will get a healthy jumpstart on their careers. Gen Z takes these details personally.<\/p>\n\n\n\n<h3><strong>3. Connect your unique value proposition to a big picture.<\/strong><\/h3>\n\n\n\n<p>Undeniably, today’s early career talent care about working for companies that commit to making a big impact with their contributions.<\/p>\n\n\n\n<p><a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"http:\/\/www.generations.com\/\/srv\/htdocs\/wp-content\/uploads\/2017\/01\/2017-BridgeWorks-3G-Report.pdf\" target=\"_blank\">One study from BridgeWorks<\/a>, a consulting firm that delivers generational insights to employers, confirms numerous research findings that Gen Z cares about making a difference at work, working for a company that gives back to the community, and staying with a company that isn’t afraid to take a stand on social issues.<\/p>\n\n\n\n<p>Data from Handshake validates this finding. In one survey of our network, 30% of early career talent reported that they would <em>only<\/em> work for an employer that takes a public position on social issues such as race, gender, and sexual orientation.<\/p>\n\n\n\n<p>Show that your culture is a space where employees can bring their full selves to work, so that they can focus on impact and contributing in positive ways:<\/p>\n\n\n\n<ul><li>Share photos from employee resource groups or photos from service<\/li><li>Showcase videos explaining how you improve the community around you<\/li><li>Explain how your company contributes to specific causes that Gen Z cares about in your company description and through employee reviews<\/li><\/ul>\n\n\n\n<p>Make sure that these value propositions are visible to early talent applicants—especially in the outreach you send them. A simple way to communicate your company’s commitment to social good is in your company overview.<\/p>\n\n\n\n<p>In their Handshake profile, HubSpot, for example, emphasizes their unique value proposition for empowering small-to-medium-sized businesses around the world. By emphasizing the “big picture,” your company can communicate a narrative that reaches what Gen Z cares about on a personal level.<\/p>\n\n\n\n<p>You can’t practice what you don’t preach, which means your company needs to have a culture in place that supports Gen Z’s values. If you’re unsure of what inspires Gen Z, consider researching causes that complement your business and leaning into existing research that illustrate<a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.pewsocialtrends.org\/2019\/01\/17\/generation-z-looks-a-lot-like-millennials-on-key-social-and-political-issues\/\" target=\"_blank\"> Gen Z attitudes toward diversity<\/a>.<\/p>\n\n\n\n<h3><strong>4. Humanize the people behind your employer brand.<\/strong><\/h3>\n\n\n\n<p>The most impactful way to capture your audience’s attention is to reach people on their terms and align your interests with theirs. Being transparent about your values is not only important for appeasing early talent—it’s important for your bottom line, <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.gallup.com\/workplace\/245480\/why-need-compete-employees-customers.aspx\" target=\"_blank\">according to research from Gallup<\/a>.<\/p>\n\n\n\n<p>Make people excited to want to work for your company. Don’t just walk the talk. Provide a behind-the-scenes window into your culture, and ensure that every meaningful point of interaction communicates your hiring narrative.<\/p>\n\n\n\n<p><a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/joinhandshake.com\/employers-premium\/\" target=\"_blank\">Handshake Premium<\/a> partners, for instance, can dynamicaly tailor the information they share to a viewer’s desired career path. Let’s say your team is looking to recruit engineers. One way to build a personalized, relatable employer brand is to share stories, FAQs, and reviews that prospects majoring in computer science, math, or data-focused disciplines would find insightful.<br><br>Let’s explore IBM’s approach to early talent employer branding as a shining use case. Many still perceive IBM as a maker of personal computers, when in fact they’ve <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.ibm.com\/ibm\/history\/ibm100\/us\/en\/icons\/patents\/breakthroughs\/\" target=\"_blank\">led tech breakthroughs<\/a> for more than 100 years. As part of its employer brand, IBM shares Q&amp;As that are relevant to its early talent segments who are interested in their open roles.<br><br>A current student or young alumni, for example, can see insights from IBM employees along with fellow early career professionals who have held or are seeking similar roles. This information gives potential job seekers, at all organizational levels, an inside look into how success is defined at IBM, and gives a unique lens into the experiences of someone like them.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/pvzVlSFVF-Ay-5ofXwbw6Vy3k4qyzUmFPYFa-9cHZnIWykOEk1BN2UxRnB-6humPHKb9WOAB6-6XlL7cvZpN_eLzgJyNMDJ-xGOR6jOBF5rawOynjulba871wQOA98Iaz4Hn8KZ0\" alt=\"\"\/><\/figure>\n\n\n\n<p>This form of engagement provides a level of transparency others can’t, and helps <a href=\"https:\/\/recruitingdaily.com\/can-qa-help-employers-candidates-recruiting\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">convert undecided job seekers into applicants<\/a> by giving them the information they need to make better informed decisions. IBM also shares testimonials from early career professionals in technical roles, incorporating scannable and personable videos that shed insight into what life is like at the company.<\/p>\n\n\n\n<p>Within Handshake, IBM tailors its employer brand to engage its unique talent segments with content related to their skills, interests, and future career trajectories. As a result, its employees’ stories become the foundation of the company’s recruiting presence, employer brand, and personalization efforts.<\/p>\n\n\n\n<p>Consider leaning in on new technologies, like Handshake, to host a virtual event or a live women-led panel to showcase the company values you stand for, the people you represent, and the culture you and your team work so hard to build.<\/p>\n\n\n\n<h3><strong>Final thoughts<\/strong><\/h3>\n\n\n\n<p>How do you evaluate the success of your employer brand? Industry experts believe that there’s one metric you need to look at generally, and that’s the quality of your applicants or hires. A secondary metric is around how your holistic employer brand supports key employer and recruiting initiatives.<br><br>On Handshake, are your profile and job views converting? If not, you may need to revisit how you’re pitching your jobs, people, value propositions, and culture.<br><br>Make every interaction with early career talent count. This generation of college graduates and young alumni understand tech in ways that their more experienced counterparts don’t, and are looking for guidance and human connection.<\/p>\n\n\n\n<p>It’s critical to invest in research early on to get the insights you need to accomplish the efforts that follow. Don’t feel the need to take this on your own—find a partner or executive co-sponsor to help you do this. And finally, leverage external resources to help you build and evaluate a holistic employer brand for early talent. <\/p>\n\n\n\n<p><a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.joinhandshake.com\/employers-premium\/request-more-info\/\" target=\"_blank\">Learn how Handshake can help.<\/a><br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn how to appeal to Gen Z through a holistic, intentional, and meaningful employer brand.<\/p>\n","protected":false},"author":167034975,"featured_media":1133,"menu_order":0,"template":"","employers_category":[1413],"employers_tag":[1459,1440],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Build an Employer Brand Early Talent Loves | Handshake<\/title>\n<meta name=\"description\" content=\"As recruiting remains competitive, one of the strongest investments employers are making is in their employer brand. Learn how yours can appeal to Gen Z.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Build an Employer Brand Early Talent Loves | Handshake\" \/>\n<meta property=\"og:description\" content=\"As recruiting remains competitive, one of the strongest investments employers are making is in their employer brand. Learn how yours can appeal to Gen Z.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/photograph-of-men-having-conversation-seating-on-chair-1015568-1024x683.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"683\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/photograph-of-men-having-conversation-seating-on-chair-1015568.jpg?fit=5472%2C3648&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/photograph-of-men-having-conversation-seating-on-chair-1015568.jpg?fit=5472%2C3648&ssl=1\",\"width\":5472,\"height\":3648,\"caption\":\"Your employer brand is a great place to showcase friendly office space or work culture.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/\",\"name\":\"How to Build an Employer Brand Early Talent Loves | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#primaryimage\"},\"datePublished\":\"2019-11-27T15:01:09+00:00\",\"dateModified\":\"2019-11-27T15:01:09+00:00\",\"description\":\"As recruiting remains competitive, one of the strongest investments employers are making is in their employer brand. Learn how yours can appeal to Gen Z.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to Build an Employer Brand Early Talent Loves\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Build an Employer Brand Early Talent Loves | Handshake","description":"As recruiting remains competitive, one of the strongest investments employers are making is in their employer brand. Learn how yours can appeal to Gen Z.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/","og_locale":"en_US","og_type":"article","og_title":"How to Build an Employer Brand Early Talent Loves | Handshake","og_description":"As recruiting remains competitive, one of the strongest investments employers are making is in their employer brand. Learn how yours can appeal to Gen Z.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","og_image":[{"width":1024,"height":683,"path":"2019\/11\/photograph-of-men-having-conversation-seating-on-chair-1015568-1024x683.jpg","url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/photograph-of-men-having-conversation-seating-on-chair-1015568-1024x683.jpg","size":"large","id":1133,"alt":"Your employer brand is a great place to showcase friendly office space or work culture.","pixels":699392,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/photograph-of-men-having-conversation-seating-on-chair-1015568.jpg?fit=5472%2C3648&ssl=1","contentUrl":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/photograph-of-men-having-conversation-seating-on-chair-1015568.jpg?fit=5472%2C3648&ssl=1","width":5472,"height":3648,"caption":"Your employer brand is a great place to showcase friendly office space or work culture."},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/","name":"How to Build an Employer Brand Early Talent Loves | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#primaryimage"},"datePublished":"2019-11-27T15:01:09+00:00","dateModified":"2019-11-27T15:01:09+00:00","description":"As recruiting remains competitive, one of the strongest investments employers are making is in their employer brand. Learn how yours can appeal to Gen Z.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"How to Build an Employer Brand Early Talent Loves"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/1131"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/1133"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=1131"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=1131"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=1131"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}