{"id":1252,"date":"2020-01-21T14:00:55","date_gmt":"2020-01-21T22:00:55","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=1252"},"modified":"2021-10-21T17:08:03","modified_gmt":"2021-10-22T00:08:03","slug":"how-to-write-a-recruiting-message-to-students-plus-examples","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/","title":{"rendered":"How to Write a Recruiting Message to Students (Plus 7 Templates)"},"content":{"rendered":"\n<p>Do you remember the contents of the last recruiting message you received? If it was impersonal, probably not. It’s also possible you ignored it. So perhaps it’s not shocking that our data found that students are more likely to respond to messages that feel personalized as well as relevant (i.e. to job roles and industries in which they are interested).&nbsp;<\/p>\n\n\n\n<p><strong>If you’re not personalizing your recruiting message to college students and recent graduates in a meaningful way, candidates are not likely to engage with you.<\/strong><\/p>\n\n\n\n<p>Marketing and recruiting represent two separate business functions, but they share best practices around messaging. According to our Handshake Network Trends report, <a href=\"https:\/\/joinhandshake.com\/network-trends\/gen-z-relationships\" target=\"_blank\" rel=\"noreferrer noopener\">92% of Gen Z, the “always-connected” generation, prefer connecting with employers by email<\/a>.<\/p>\n\n\n\n<p>Before sending your next recruiting message to a candidate, read through these five effective strategies for personalizing your outreach–plus get seven recruiting message templates to use throughout the candidate lifecycle.<\/p>\n\n\n\n<h6>Download our infographic for <a href=\"https:\/\/joinhandshake.com\/employers\/resources\/how-to-write-a-recruiting-message\/4\" target=\"_blank\" rel=\"noreferrer noopener\">quick tips to personalize your recruiting messages<\/a>.<\/h6>\n\n\n\n<h3>1. Learn about your audience<\/h3>\n\n\n\n<p>Today’s early talent is already doing their due diligence by researching you online, on social media, and on Handshake. It’s worth your time to research them, too. Since Handshake is the system of record for more than 1,400 higher education institutions across the country, career centers verify basic information on student profiles, like graduation date. But it’s up to students to build their digital brand.&nbsp;<\/p>\n\n\n\n<p><strong>Take this opportunity to learn more about their interests, skills, student organization affiliations, etc.<\/strong> <a href=\"https:\/\/joinhandshake.com\/employers\/solutions\/source\/\" target=\"_blank\" rel=\"noreferrer noopener\">Handshake Premium employers can use Segments to find students that meet these criteria<\/a>, from filters like coursework and major to student organizations and underrepresented groups.&nbsp;<\/p>\n\n\n\n<p>To create an even more rich profile of your ideal candidate, complement your research with data around what motivates Gen Z. Lean on industry reports and <a href=\"https:\/\/joinhandshake.com\/employers\/resources\/\" target=\"_blank\" rel=\"noreferrer noopener\">other employer resources like how-to guides<\/a> that can help you level up how you engage early talent.<\/p>\n\n\n\n<p>For example: say you’re asked to build an early talent pipeline to fill <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/creative-ways-to-make-your-virtual-internship-a-success\/\" target=\"_blank\" rel=\"noreferrer noopener\">your virtual summer internship program<\/a>. You want all-star students pursuing business degrees, and while the competition for top early talent remains competitive, you know your employer’s flexible and autonomous&nbsp;culture stands out. <\/p>\n\n\n\n<p>With this information in mind, find relevant talent that might be interested in what you have to offer by zeroing in on candidates who are looking for part-time work or have demonstrated autonomy through past work experience. Then set yourself apart by leading with those benefits in your outreach.<\/p>\n\n\n\n<h3>2. Personalize your recruiting message<\/h3>\n\n\n\n<p>Start by tailoring the subject line. Students on Handshake will see this in their email inbox, their Handshake inbox, and the push notification they receive from the Handshake App on their smartphone. <a href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/218693318-How-to-Send-a-Student-a-Message\" target=\"_blank\" rel=\"noreferrer noopener\">Be sure to mention your company in the subject line <\/a>— that’s the basis of our default subject line, which performs well! <\/p>\n\n\n\n<p><strong>If you have a less recognizable brand, try inputting the job role for which you are hiring for into the subject line.<\/strong><\/p>\n\n\n\n<p>Begin your message with context around who you are and why you’re reaching out. Include what stood out to you about this candidate, how you think they can thrive at your organization, and why your employer is the best place for them to launch their career.&nbsp;<\/p>\n\n\n\n<h6>Using Segments, Handshake Premium partners can <a href=\"https:\/\/joinhandshake.com\/employers\/solutions\/source\/\" target=\"_blank\" rel=\"noreferrer noopener\">identify a group of students with specific attributes<\/a> (who might be part of a community service organization, in a leadership position, or know how C++ for example).<\/h6>\n\n\n\n<p>Finding commonality is another great way to establish rapport. Students are receptive to employers that have hired alumni from their school, location, or major. If you have that information handy, use it in your recruitment message. <\/p>\n\n\n\n<p>If you’re reaching out to a student at one of your partner schools, imagine how much more likely they are to respond if you reference current employees who share their alma mater. In the same vein, if you went to the same school or have another common interest with the candidate, go ahead and make that connection!&nbsp;<\/p>\n\n\n\n<p>Your recruiting message should ultimately answer why your company is a great place for that candidate to work, and reference how their interests align with your key value propositions. You can even reference how it felt when you were just starting out in your career, or at your current company. <\/p>\n\n\n\n<p>A little empathy for the candidate experience goes a long way for early talent who are just starting out in their careers.<\/p>\n\n\n\n<h6>Premium partners like <a href=\"https:\/\/joinhandshake.com\/employers\/resources\/paypal-powers-their-diversity-inclusion-goals-with-handshake\/\" target=\"_blank\" rel=\"noreferrer noopener\">PayPal rely on Campaigns to build better relationships with candidates<\/a> and to personalize messages using variables that automatically populate a student&#8217;s first name, major, and institution name.<\/h6>\n\n\n\n<h3>3. Communicate authentically and honestly<\/h3>\n\n\n\n<p><a href=\"https:\/\/joinhandshake.com\/career-centers\/\" target=\"_blank\" rel=\"noreferrer noopener\">Career services centers<\/a> are coaching students to ask about an employer’s culture during their interviews. As they graduate from nearly two decades of schooling and move into their first or second job after college, graduates may have mixed emotions about all the changes ahead. In the same way you’re screening for fit, they are too.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><meta charset=\"utf-8\">&#8220;Students are invited to study your culture the moment they arrive for an interview. They dissect the language in your outreach—is the message positive and hopeful, or impersonal and terse? Students are even encouraged to look at your email signature for clues on inclusivity, and evaluate when and how calls are scheduled. Essentially every single point of communication provides input into how a student sees the relationship.&#8221;<\/p><cite><meta charset=\"utf-8\">Tiffany Taylor, Strategic Education Success &amp; Training Manager at Handshake<\/cite><\/blockquote>\n\n\n\n<p>If a student demonstrates interest in working at an employer with a fully distributed workforce and that’s something you offer, mention it! Illustrate how “flexible work” is a key tenet for your organization, and how it has helped your colleagues better accommodate their early careers. When you start to consider these components, your hiring narrative shifts quickly.<\/p>\n\n\n\n<p>If you’re using a recruiting message to <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/\" target=\"_blank\" rel=\"noreferrer noopener\">drive attendance at an upcoming virtual career event<\/a>, set students up for success by providing very clear details for how they can prepare for attending. Instructions for video calls, guidance on camera and mic being on\/off in a group session, chat\/Q&amp;A participation instructions, etc., can have lasting impressions on students who are looking for guidance<\/p>\n\n\n\n<p>And if emojis are in your personal vocabulary, go ahead and use them in your recruiting message! 😊  Whatever is unique to you can help you build relationships with students, as well as show that your employer welcomes self-expression.&nbsp;<\/p>\n\n\n\n<h3>4. Close with a call to action<\/h3>\n\n\n\n<p>Always round off your recruiting message with a clear and persuasive call to action (CTA) that directs students to take action. What’s in a CTA? It could direct candidates to RSVP for an upcoming career fair or event, apply to an open job or internship program, or simply learn more about your employer. <\/p>\n\n\n\n<p>Wherever it leads, it should be focused—don’t overwhelm your candidates with multiple CTAs—and include a hyperlink. <strong>You might also consider bolding and underlining information you want students to pay special attention to.<\/strong><\/p>\n\n\n\n<p>Your communication with a candidate also shouldn’t dissolve after one message. In fact, your first point of outreach should set the foundation for an ongoing, two-way relationship. Human connection begins the very moment a potential hire learns about your company, and it shouldn’t end there either. Including a personal note at the end of your message like, “I look forward to reviewing your application!” can increase your likelihood of a response.<\/p>\n\n\n\n<p>Finally, even with a super clear CTA, keep in mind that most candidates won’t respond to their first email. Don’t get discouraged. According to industry sources, <a href=\"https:\/\/learn.g2.com\/follow-up-email\" target=\"_blank\" rel=\"noreferrer noopener\">messaging the same contact multiple times leads to 2x more responses<\/a>.<\/p>\n\n\n\n<h6>Handshake Premium partners can <a href=\"https:\/\/joinhandshake.com\/employers\/solutions\/engage\/\" target=\"_blank\" rel=\"noreferrer noopener\">schedule follow ups or further personalize messaging based on historical engagement<\/a> so that they never miss a moment to nurture a relationship.&nbsp;<\/h6>\n\n\n\n<h3>5. Review before sending<\/h3>\n\n\n\n<p>It’s critical to review your recruiting message a few times before hitting send. If you’re messaging a large list, invite a colleague to proofread your message. <\/p>\n\n\n\n<p><a href=\"https:\/\/joinhandshake.com\/blog\/employers\/10-ways-to-include-recruit-gen-z-into-your-multi-generational-workforce\/\" target=\"_blank\" rel=\"noreferrer noopener\">Gen Z is the most diverse generation yet<\/a>, so when messaging students, it’s important to communicate in a way that celebrates their unique identities while highlighting the value your organization places on diversity, equity, inclusivity, and belonging. <\/p>\n\n\n\n<p>If you are messaging an underrepresented group, it’s a good idea to ask someone with a shared identity at your organization to review the message and ensure sensitivity. Get started by checking out our blog on the <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/\" target=\"_blank\" rel=\"noreferrer noopener\">dos and don’ts of messaging underrepresented students<\/a>.&nbsp;<\/p>\n\n\n\n<p>Actionable emails succeed because they’re hyper-relevant to the receiver. They’re curated by carefully mapping content to the reader’s persona. Does your message address a student directly? Does it sound genuine and personal? Does it have a clear CTA?<\/p>\n\n\n\n<h6><a href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/360024369273-Messaging-Best-Practices-\" target=\"_blank\" rel=\"noreferrer noopener\">Keep your recruiting message between 80 and 110 characters<\/a> to get the highest read rate. The content that gets the highest open rate is about jobs!<\/h6>\n\n\n\n<p>Students might get over your company receiving negative coverage in the press, but one surefire way to ensure you never hear from them again is to send a generic, impersonal message. Misplacing your variables, such as your name with theirs, or disclosing inaccurate information can have harmful effects on your reputation and misrepresent your brand.<\/p>\n\n\n\n<p>The more a student feels like they’re talking to a real person, the more likely they are to respond and apply to your open roles.<\/p>\n\n\n\n<h3>The bottom line<\/h3>\n\n\n\n<p>Whether you’re building your <a href=\"https:\/\/joinhandshake.com\/employers\/resources\/mcdonalds-launches-their-early-talent-recruiting-program-with-handshake\/\" target=\"_blank\" rel=\"noreferrer noopener\">early talent recruiting program from scratch<\/a> or <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/\" target=\"_blank\" rel=\"noreferrer noopener\">rethinking how you approach your current one<\/a>, continue exploring ways of customizing your messaging. <\/p>\n\n\n\n<p>Identify opportunities to collect qualitative data about your candidate’s experience, like asking questions about message relevance and engagement in your feedback surveys. Handshake Premium employer partners can review message data, such as open and engagement rates, to reveal trends around language that outperforms.&nbsp;<\/p>\n\n\n\n<p>While this article focuses on how personalization improves the quality of a recruiting message, it’s important to be thoughtful about message quantity as well. <\/p>\n\n\n\n<p>Candidates are receiving messages from many employers at once. If you notice open and engagement rates dipping, that can be a sign that you are sending too many messages, or that the message content isn’t relevant. <\/p>\n\n\n\n<p>Achieving the right balance for your audience may require some experimentation with cadence, frequency, and even seasonality. Check out our <a href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/360024369273-Messaging-Best-Practices-\" target=\"_blank\" rel=\"noreferrer noopener\">guidance on messaging limits<\/a> to encourage meaningful, intentional conversations with students.&nbsp;<\/p>\n\n\n\n<h6>See how your messages are performing and <a href=\"https:\/\/joinhandshake.com\/employers\/request-more-info\/\" target=\"_blank\" rel=\"noreferrer noopener\">unlock unlimited personalized messages on Handshake<\/a>.<\/h6>\n\n\n\n<h3>Seven early talent recruiting message templates<\/h3>\n\n\n\n<p>We’ve compiled templates based on hundreds of messages from employers with the top message engagement rates on Handshake that can help you build better relationships with the candidate throughout their journey.&nbsp;<\/p>\n\n\n\n<p>Since conducting research student-by-student and personalizing each message can be time-consuming, <a href=\"https:\/\/joinhandshake.com\/employers\/products\/premium\/?slide=campaigns\" target=\"_blank\" rel=\"noreferrer noopener\">Campaigns, a Handshake Premium feature, includes 3 variables<\/a> that allows you to save time personalizing your message based on student attributes at scale: {{first_name}}, {{institutions_name}}, and {{major_name}}.&nbsp;<\/p>\n\n\n\n<p>For other types of personalization, just fill in the blank!<\/p>\n\n\n\n<hr align=\"left\" width=\"50%\">\n\n\n\n<h5>Message content: Introduction<\/h5>\n\n\n\n<p>Hi [student’s first name],<\/p>\n\n\n\n<p>My name is [your name] and I’m a [your title] at [employer]. We’re currently hiring for a(n) [role], and based on your [interests], I think you should apply!<\/p>\n\n\n\n<p>[Employer] is a [brief description]. With tuition reimbursement, wellbeing programs like a free gym membership, and opportunities to meet employees with shared interests via resource groups and Slack, our culture is a place where people who are passionate about [extracurriculars or interests] thrive. We have amazing opportunities for students just like you.&nbsp;<\/p>\n\n\n\n<p>Learn more about who we are! [insert CTA]<\/p>\n\n\n\n<p>I look forward to connecting more with you, [student’s first name].<\/p>\n\n\n\n<p>Best,<\/p>\n\n\n\n<p>[your name]<\/p>\n\n\n\n<hr align=\"left\" width=\"50%\">\n\n\n\n<h5>Message content: Career fair introduction<\/h5>\n\n\n\n<p>Hi [student’s name],<\/p>\n\n\n\n<p>My name is [your name], [your title] with [employer]. Our company is a [brief description]. We’ll be at the [career fair name] and would love to meet with you!<\/p>\n\n\n\n<p>[Employer] is focused on creating a great place for new college graduates to thrive. We offer a virtual training program to build both leadership and technical skills. In addition, we offer mentor support and opportunities for you to build your professional network.&nbsp;<\/p>\n\n\n\n<p>I&#8217;d love to invite you to stop by our info session during [name of fair] on [date, time]. If you&#8217;re interested, sign up by clicking the button below.<\/p>\n\n\n\n<p>Thank you,<\/p>\n\n\n\n<p>[your name]<\/p>\n\n\n\n<hr align=\"left\" width=\"50%\">\n\n\n\n<h5>Message content: Relationship building<\/h5>\n\n\n\n<p>[student’s name],<\/p>\n\n\n\n<p>Can you believe that graduation is right around the corner?<\/p>\n\n\n\n<p>I remember being in your shoes and not knowing which career I wanted to pursue, and had no idea how to get my foot in the door. Now, I have the pleasure of connecting with students like you to support your career exploration. I help identify top students for our internship and full-time opportunities, and was excited to come across your profile. I believe that your interests and experiences could make you a great addition to the team at [employer]!<\/p>\n\n\n\n<p>Here is a job at you might be interested in: [link to job description]<\/p>\n\n\n\n<p>Please reach out to me directly or click the link below to apply online. Once you complete the application, let me know! I’d love to stay in touch.&nbsp;<\/p>\n\n\n\n<p>Very warm regards,<\/p>\n\n\n\n<p>[your name]<\/p>\n\n\n\n<hr align=\"left\" width=\"50%\">\n\n\n\n<h5>Message content: Invitation to apply<\/h5>\n\n\n\n<p>Hi [student first name],<\/p>\n\n\n\n<p>We saw that you are interested in the [industry] and wanted to reach out to invite you to apply to our [program]. This is a unique program where students join us from all backgrounds and areas of study to work alongside cross-functional leaders.&nbsp;<\/p>\n\n\n\n<p>Here are a few things to keep in mind:<\/p>\n\n\n\n<ul><li>[application limits]<\/li><li>[internship duration]<\/li><li>[compensation]<\/li><li>[in person location\/remote\/hybrid]<\/li><li>[interview process]<\/li><li>[timeline]<\/li><\/ul>\n\n\n\n<p>For further details, feel free to click through to the job posting below. If you are interested, please be sure to apply by [deadline] so that you may be considered.<\/p>\n\n\n\n<p>We look forward to reviewing your application!<\/p>\n\n\n\n<p>Best,<\/p>\n\n\n\n<p>[your name]<\/p>\n\n\n\n<hr align=\"left\" width=\"50%\">\n\n\n\n<h5>Message content: Ambassador\/alumni connection<\/h5>\n\n\n\n<p>Hi [student’s first name]!<\/p>\n\n\n\n<p>Here at [employer name], we always want potential candidates to learn more about the meaningful projects we work on, and hear about our culture from our current employees.&nbsp;<\/p>\n\n\n\n<p>I noticed that you’re a [institution name] alum studying [major name], which is why I wanted to offer you the opportunity to have an informal 15-minute virtual info chat with [ambassador name] to learn more about roles here. If you’re interested, click “Find a time” below to schedule a time to speak.<\/p>\n\n\n\n<p>[your name]<\/p>\n\n\n\n<hr align=\"left\" width=\"50%\">\n\n\n\n<h5>Message content: Reminder\/follow up<\/h5>\n\n\n\n<p>Hi [student name],<\/p>\n\n\n\n<p>I’m following up on my previous message because I think you would be a great fit for [role] at [employer], and thought you might be interested in learning more.<\/p>\n\n\n\n<p>It’s not too late to sign up for our upcoming virtual information session on [event details]! RSVP here: [insert link]. <\/p>\n\n\n\n<p>Thank you for your time and consideration–hope to see you there!<\/p>\n\n\n\n<p>[your name, your role, company name]<\/p>\n\n\n\n<hr align=\"left\" width=\"50%\">\n\n\n\n<h5>Message content: Thank you<\/h5>\n\n\n\n<p>Hi [student name],<\/p>\n\n\n\n<p>Thank you for [action]. We appreciate your interest in [employer] and are excited to get to know you better!&nbsp;<\/p>\n\n\n\n<p>[Next steps]<\/p>\n\n\n\n<p>Thank you again! Looking forward to staying in touch.<\/p>\n\n\n\n<p>Sincerely,&nbsp;<\/p>\n\n\n\n<p>[your name]<\/p>\n\n\n\n<hr align=\"left\" width=\"50%\">\n","protected":false},"excerpt":{"rendered":"<p>Personalized messages are more likely to get Gen Z’s attention.<\/p>\n","protected":false},"author":167034975,"featured_media":10797,"menu_order":0,"template":"","employers_category":[1416],"employers_tag":[1459,1450],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Write a Recruiting Message to Students (Plus 7 Templates)<\/title>\n<meta name=\"description\" content=\"Gen Z is more likely to respond to employers that send a personalized recruiting message. Here are five ways to make your outreach stand out.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Write a Recruiting Message to Students (Plus 7 Templates)\" \/>\n<meta property=\"og:description\" content=\"Gen Z is more likely to respond to employers that send a personalized recruiting message. Here are five ways to make your outreach stand out.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2021-10-22T00:08:03+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2021\/10\/HS_HowToWriteRecruitingMessages_BlogImage.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1440\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/10\/HS_HowToWriteRecruitingMessages_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/10\/HS_HowToWriteRecruitingMessages_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"width\":1440,\"height\":960},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/\",\"name\":\"How to Write a Recruiting Message to Students (Plus 7 Templates)\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#primaryimage\"},\"datePublished\":\"2020-01-21T22:00:55+00:00\",\"dateModified\":\"2021-10-22T00:08:03+00:00\",\"description\":\"Gen Z is more likely to respond to employers that send a personalized recruiting message. Here are five ways to make your outreach stand out.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to Write a Recruiting Message to Students (Plus 7 Templates)\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Write a Recruiting Message to Students (Plus 7 Templates)","description":"Gen Z is more likely to respond to employers that send a personalized recruiting message. Here are five ways to make your outreach stand out.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/","og_locale":"en_US","og_type":"article","og_title":"How to Write a Recruiting Message to Students (Plus 7 Templates)","og_description":"Gen Z is more likely to respond to employers that send a personalized recruiting message. Here are five ways to make your outreach stand out.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2021-10-22T00:08:03+00:00","og_image":[{"width":1440,"height":960,"url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2021\/10\/HS_HowToWriteRecruitingMessages_BlogImage.jpg","path":"\/srv\/htdocs\/wp-content\/uploads\/2021\/10\/HS_HowToWriteRecruitingMessages_BlogImage.jpg","size":"full","id":10797,"alt":"","pixels":1382400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/10\/HS_HowToWriteRecruitingMessages_BlogImage.jpg?fit=1440%2C960&ssl=1","contentUrl":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/10\/HS_HowToWriteRecruitingMessages_BlogImage.jpg?fit=1440%2C960&ssl=1","width":1440,"height":960},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/","name":"How to Write a Recruiting Message to Students (Plus 7 Templates)","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#primaryimage"},"datePublished":"2020-01-21T22:00:55+00:00","dateModified":"2021-10-22T00:08:03+00:00","description":"Gen Z is more likely to respond to employers that send a personalized recruiting message. Here are five ways to make your outreach stand out.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"How to Write a Recruiting Message to Students (Plus 7 Templates)"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/1252"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/10797"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=1252"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=1252"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=1252"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}