{"id":2271,"date":"2020-04-23T15:01:57","date_gmt":"2020-04-23T22:01:57","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=2271"},"modified":"2020-07-10T13:33:37","modified_gmt":"2020-07-10T20:33:37","slug":"how-to-conduct-a-virtual-onboarding-for-new-hires","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/","title":{"rendered":"4 Steps to Conducting a Virtual Onboarding for New Hires"},"content":{"rendered":"\n<h6>Want just the highlights? <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/HS_2020_OnboardNewEmployeesVirtually.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Download a snapshot<\/a> of these virtual onboarding takeaways for easy reference.<\/h6>\n\n\n\n<p>With spring in full bloom, recruiters are gearing up for one of their busiest seasons of the year. While career fairs, on-campus events, and in-person interviews are typically common practices, COVID-19 is reshaping how employers go about recruiting.<\/p>\n\n\n\n<p>Instead of in-person events and interviews, more and more companies are taking a new approach to recruiting—they’re going entirely digital. This includes <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/\">sending messages on recruiting platforms<\/a> like Handshake, hosting videoconference interviews, and onboarding new hires remotely. If you’re new to virtual recruiting or just trying to navigate this new landscape, we’re here to help.<br><br>We’ve curated a list of best practices for virtual onboarding to make the process engaging, straightforward, and stress-free. Be sure to check out our <a rel=\"noreferrer noopener\" href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/HS_HolisticGuideToRecruitingFromHome_Core.pdf\" target=\"_blank\">holistic guide to recruiting from home<\/a>, too!<\/p>\n\n\n\n<h2>1. Give recruits what they need to be successful<\/h2>\n\n\n\n<p>As with in-person onboarding, your new hire will still need to fill out their paperwork, acquire necessary equipment, and meet the team. We’ll show you how to achieve a thoughtful virtual onboarding.<\/p>\n\n\n\n<p><strong>Gather the basics<\/strong><\/p>\n\n\n\n<p>Remote employees will require equipment such as a laptop, monitor, and headset. You can also send them welcome swag such as a branded mug or tee. To do so, however, you’ll need to get all the new hire’s information, including their email address, phone number, and home address. Once you have their confirmed start date, make sure to mail everything they’ll need to get started a few days in advance so they can set up their workspace (and you don’t have to delay their start date).<\/p>\n\n\n\n<p><strong>Complete their documentation<\/strong><\/p>\n\n\n\n<p>For businesses working with consumers, employees, or organizations outside of their headquarters, virtual document signing is nothing new. These companies have utilized software like <a href=\"https:\/\/www.docusign.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">DocuSign<\/a> to send paperwork for years. You can do the same with your new hire. Upload all your new hire paperwork into a signing software and use your new hire’s email address to send them everything they need to sign before their start date.<\/p>\n\n\n\n<p><strong>Be sure to check in<\/strong><\/p>\n\n\n\n<p>Remote work is new to many students and recent grads, so be sure to check in throughout the onboarding process to make sure things run smoothly. A few days before their start date, send an email to the new hire’s <em>personal<\/em> email with instructions on how to log on to their laptop and company email. You can also include instructions on how to log in to your secured network or VPN, if needed.<\/p>\n\n\n\n<p>We also suggest scheduling a video check-in or sending a separate email detailing their first day. Who will they meet? What tasks are they expected to complete prior to day one? What time are they expected to log on everyday? This is a great way to make sure you’re both on the same page and ease their mind about this new way of working.<br><br>Make them feel like part of the team and answer any questions your new hire may have to help reassure them as they get acquainted with their new remote role.<\/p>\n\n\n\n<h6>Tip: Have their hiring manager send them a handwritten note with their equipment to welcome your new hire and make them feel like a valued member of the team.<\/h6>\n\n\n\n<h2>2. Get to know your new hire during their virtual onboarding<\/h2>\n\n\n\n<p>Building a relationship can be a challenging feat when it’s done virtually, but these tips will help you <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/4-things-gen-z-wants-from-their-job\/\">build that rapport and trust<\/a> with your new hire.<\/p>\n\n\n\n<p><strong>Set clear expectations<\/strong><\/p>\n\n\n\n<p>One of the most concerning aspects about working remotely is the uncertainty that can come with it. Eliminate this fear by laying out everything your new hire needs to know to be successful in their new role. Set expectations around meetings they need to attend weekly or monthly, what collaboration tools they’ll need to communicate with the team, the hours they are expected to work, how to participate in daily standups, and anything else that’s expected of them.<\/p>\n\n\n\n<p>Checklists are a great way to set expectations! Make a list of tasks to complete their first week, month, and so on. Make sure that your checklist is thorough and complete. We also suggest sending tips for setting up their home office, informing them of any kind of stipend they will receive to set up their workspace, and even the best places to get great deals on office supplies nearby. Remember, you want to make this as seamless as possible for your new hire.<\/p>\n\n\n\n<p><strong>Meet the team<\/strong><\/p>\n\n\n\n<p>Your new hire may not have met their teammates in person, but that doesn’t mean they can’t interact with them online. Inform your new employee on how to set up meetings with their teammates, so they can get to know everyone and understand how they’ll interact. It’s always nice to put a face to a name, so we suggest using videoconferencing software for virtual face-to-face meetings. If your new employee is unfamiliar with the software, be prepared to walk them through how to set it up.<\/p>\n\n\n\n<p><strong>Schedule important meetings<\/strong><\/p>\n\n\n\n<p>In addition to setting up a new hire’s first week, it’ll be helpful to send them invites to recurring meetings. For example, if there’s a monthly all-hands or a weekly standup, make sure to include them on the invite so they don’t miss out on important cross-functional meetings. Work with their manager and team to get these sent out and include any HR meetings, trainings, and other standard onboarding meetings they’ll need to participate in.<\/p>\n\n\n\n<h6>Tip: Make sure the employee knows how long they’ll be working remotely or that they will be expected to go into the office once it opens back up.<\/h6>\n\n\n\n<h2>3. Train new hires on how to use collaboration software<\/h2>\n\n\n\n<p>Collaboration tools are vital to the success of remote workers. These tools enable teams to communicate, share files and project plans, schedule meetings, and more.<\/p>\n\n\n\n<p><strong>Put your ‘teacher hat’<\/strong> <strong>on<\/strong><\/p>\n\n\n\n<p>When checking in with the newest member of your team, make sure you get an idea of their familiarity with the collaboration tools you use. Provide documentation on how to sign in, get started, and actually use the tool prior to their first day. This will allow them to play around with the tool beforehand, so come day one, they’re ready to go!<\/p>\n\n\n\n<p><strong>Grant them access<\/strong><\/p>\n\n\n\n<p>Collaboration tools are great, but only if you have access to them. If your company has strict permissions or requires licenses for the software you use, make sure you grant access as needed. They shouldn’t get denied when they try to log in. In case there are problems, however, we suggest giving your new hire the steps to take to contact IT.<\/p>\n\n\n\n<p><strong>Allow them to drive their virtual onboarding<\/strong><\/p>\n\n\n\n<p>Lighten your load by encouraging new hires to drive their own onboarding process. The easiest way to do this is by creating a “getting started” checklist for them to work off. What tools do they need to download by the end of the first week? What Slack channels do they need to join? When do documents need to be signed? Who do they need to schedule meetings with? By creating tasks that they can do on their own, you not only give them control of their onboarding, but you free up your time as well.<\/p>\n\n\n\n<h6>Tip: Offer to conduct tests with the new hire to ensure software is working. For example, have them send you a message on Slack to ensure they understand how it works and that it is indeed working.<\/h6>\n\n\n\n<h2>4. Make culture a priority<\/h2>\n\n\n\n<p>Culture can include anything from end-of-day happy hours to lunch n’ learns to living out a mission statement throughout the workday. However, when working remotely, it can be difficult to portray the culture that makes your office culture unique. Whether you&#8217;re conducting a virtual onboarding for a full-time employee or for your <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/creative-ways-to-make-your-virtual-internship-a-success\/\">upcoming virtual internship class<\/a>, incorporate some of the tips below to assure team members that culture is still important, both in and out of the office.<\/p>\n\n\n\n<p><strong>Start from the beginning<\/strong><\/p>\n\n\n\n<p>Make your new remote employees feel like they really are part of the team from day one. Easy ways to do this include hosting a first-day lunch. Let them know that they will be able to expense lunch and encourage them to buy something delicious to enjoy while on a video call with their team. Once they join the meeting, they can get to know their teammates and your team can get to know the new hires. You can also set up a meeting between all your new hires so they can talk about how they’re feeling, get to know fellow new hires, and feel like they’re part of a group.<\/p>\n\n\n\n<p><strong>Build unity through software<\/strong><\/p>\n\n\n\n<p>With so many collaboration tools available, it’s easy to keep people connected. Use these to build relationships among team members. Messaging apps allow team members to easily communicate with each other, <a href=\"http:\/\/giphy.com\" target=\"_blank\" rel=\"noreferrer noopener\">send funny GIFs<\/a>, and get stuff done. Videoconferencing software allows for more team bonding and is a great way to host virtual culture events. Is it an employee’s birthday? Host a virtual birthday party! We really like themed days where everyone dresses up as a superhero. The options are truly endless.<\/p>\n\n\n\n<p>At Handshake, we recently hosted a company-wide talent show to give employees a chance to show off their non-work-related talents and offered employees an opportunity to bond ‘outside of the workplace’. With 85% of our company attending, the virtual show was truly a success!&nbsp;<\/p>\n\n\n\n<p><strong>Have them introduce themselves<\/strong><\/p>\n\n\n\n<p>What better way to get to know a new hire than by having them personally introduce themselves? At Handshake, we encourage new employees to say hello during our all-hands meeting. We also ask them contribute their favorite book to our learning library, as well as sending a photo and short biography to our #new-hires channel on Slack.&nbsp;<\/p>\n\n\n\n<p><strong>Provide resources&nbsp;<\/strong><\/p>\n\n\n\n<p>Starting a new job is scary enough, but doing it remotely can also be overwhelming. Make your new hire feels comfortable and put their mind at ease by providing them with the resources they’ll need to be successful.<\/p>\n\n\n\n<p>Show new hires where they can find your mission statement, what it means to work at your company, and anything else that embodies your values. Employee resource groups (ERG) are also a great resource to connect employees with like-minded employees outside of their immediate team. If you have an internal messaging app with different channels based on interests, be sure to share this with new hires, too.&nbsp;<\/p>\n\n\n\n<p><strong>Set up a buddy system<\/strong><\/p>\n\n\n\n<p>With so many new tools to learn, people to meet, and roles and responsibilities to execute, new hires can start to feel swamped pretty quickly. By <a rel=\"noreferrer noopener\" href=\"https:\/\/hbr.org\/2019\/06\/every-new-employee-needs-an-onboarding-buddy\" target=\"_blank\">assigning them an onboarding buddy<\/a> (or buddies) who can answer questions and make them feel welcome, you can contribute to a positive new hire experience. Their onboarding buddy is there to really help a new employee settle in and get comfortable. Make sure all new hires know who their buddies are before day one so they can reach out with questions.<\/p>\n\n\n\n<h2><strong>Time to execute<\/strong><\/h2>\n\n\n\n<p>Virtual onboarding doesn’t have to be a pain. Onboarding is a lengthy process, but virtual onboarding can be simple if you keep these considerations in mind. First, make sure you have a plan for how you’ll address virtual onboarding. You’ll also want to show new hires your genuine excitement in them joining your company—this creates a positive first impression for the new hire. After this, it’s really all about executing the plan you put together. And with these tips, you should be squared away. So, are you ready to start onboarding virtually?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are you prepared to onboard new hires virtually?<\/p>\n","protected":false},"author":167034975,"featured_media":2276,"menu_order":0,"template":"","employers_category":[1416],"employers_tag":[1459],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>4 Steps to Conducting a Virtual Onboarding for New Hires | Handshake<\/title>\n<meta name=\"description\" content=\"Are your new hires prepared to go through a virtual onboarding during this time? Learn how to make the process engaging, straightforward, and stress-free.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"4 Steps to Conducting a Virtual Onboarding for New Hires | Handshake\" \/>\n<meta property=\"og:description\" content=\"Are your new hires prepared to go through a virtual onboarding during this time? Learn how to make the process engaging, straightforward, and stress-free.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2020-07-10T20:33:37+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/04\/HS_VirtualOnboarding-1024x819.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"819\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/04\/HS_VirtualOnboarding.jpg?fit=3456%2C2765&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/04\/HS_VirtualOnboarding.jpg?fit=3456%2C2765&ssl=1\",\"width\":3456,\"height\":2765,\"caption\":\"New hire preparing to go through a virtual onboarding.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/\",\"name\":\"4 Steps to Conducting a Virtual Onboarding for New Hires | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#primaryimage\"},\"datePublished\":\"2020-04-23T22:01:57+00:00\",\"dateModified\":\"2020-07-10T20:33:37+00:00\",\"description\":\"Are your new hires prepared to go through a virtual onboarding during this time? Learn how to make the process engaging, straightforward, and stress-free.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"4 Steps to Conducting a Virtual Onboarding for New Hires\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"4 Steps to Conducting a Virtual Onboarding for New Hires | Handshake","description":"Are your new hires prepared to go through a virtual onboarding during this time? Learn how to make the process engaging, straightforward, and stress-free.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/","og_locale":"en_US","og_type":"article","og_title":"4 Steps to Conducting a Virtual Onboarding for New Hires | Handshake","og_description":"Are your new hires prepared to go through a virtual onboarding during this time? Learn how to make the process engaging, straightforward, and stress-free.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2020-07-10T20:33:37+00:00","og_image":[{"width":1024,"height":819,"path":"2020\/04\/HS_VirtualOnboarding-1024x819.jpg","url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/04\/HS_VirtualOnboarding-1024x819.jpg","size":"large","id":2276,"alt":"New hire preparing to go through a virtual onboarding.","pixels":838656,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/04\/HS_VirtualOnboarding.jpg?fit=3456%2C2765&ssl=1","contentUrl":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/04\/HS_VirtualOnboarding.jpg?fit=3456%2C2765&ssl=1","width":3456,"height":2765,"caption":"New hire preparing to go through a virtual onboarding."},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/","name":"4 Steps to Conducting a Virtual Onboarding for New Hires | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#primaryimage"},"datePublished":"2020-04-23T22:01:57+00:00","dateModified":"2020-07-10T20:33:37+00:00","description":"Are your new hires prepared to go through a virtual onboarding during this time? Learn how to make the process engaging, straightforward, and stress-free.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-conduct-a-virtual-onboarding-for-new-hires\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"4 Steps to Conducting a Virtual Onboarding for New Hires"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/2271"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/2276"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=2271"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=2271"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=2271"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}