{"id":2498,"date":"2020-05-14T11:18:27","date_gmt":"2020-05-14T18:18:27","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=2498"},"modified":"2020-05-19T17:42:18","modified_gmt":"2020-05-20T00:42:18","slug":"clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/","title":{"rendered":"Clever Ideas from SAS &#038; Handshake&#8217;s Virtual Internship Engagement Plan"},"content":{"rendered":"\n<p><em>Editor&#8217;s note: This blog is part of a developing series on virtual internships. If you&#8217;re setting up the components of your virtual internship, check out our preparation checklist <a rel=\"noreferrer noopener\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/creative-ways-to-make-your-virtual-internship-a-success\/\" target=\"_blank\">here<\/a>.<\/em> <em>If you&#8217;re a student looking for a virtual internship, read tips for getting hired remotely <a href=\"https:\/\/joinhandshake.com\/blog\/students\/category\/get-hired-remotely\/\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>.<\/em><\/p>\n\n\n\n<p>In the last few months, businesses have enacted a significant shift in the way they work. Executives are holding meetings with investors or customers over the phone or on video, account management teams are swapping client lunches for virtual updates, and the majority of the modern workforce has gone remote.<br><br>Students, too, are going virtual, with all of their classes now being hosted online. But what about internships? While a few innovative companies have been offering remote opportunities for years, the majority of businesses are still finding their footing when it comes to virtual internships.<\/p>\n\n\n\n<p>Transitioning an in-person internship to a virtual internship isn’t limited to moving communication to messaging apps and videoconferencing. To create a successful program, you will need to change the way you think about your internship and how you can still provide value and professional development opportunities for your interns.<br><br>Here are a few considerations when making the shift to virtual to ensure that both you and your interns get the most out of your program.<\/p>\n\n\n\n<figure class=\"wp-block-embed-youtube aligncenter wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/4gSD18MhqRA?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"><\/iframe><\/span><\/div>\n<\/div><figcaption><em>Watch our webinar with SAS on demand to learn how we&#8217;ll engage our virtual interns.<\/em><\/figcaption><\/figure>\n\n\n\n<h2>To cancel or to adjust to a virtual internship?<\/h2>\n\n\n\n<p>As summer approaches, many students who were offered internships were concerned that their internship may be altogether canceled. Many companies—nearly 40%, <a rel=\"noreferrer noopener\" href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake%20Rethinking%20the%20Job%20Search%20in%20the%20Era%20of%20COVID-19.pdf?aliId=eyJpIjoiZEh2a0lKWTFmOXNIQldDdCIsInQiOiJEbWFKK1kwcjh0SExzQmQ2dFUrdVNnPT0ifQ%253D%253D\" target=\"_blank\">according to our study<\/a>—are reinventing their internship programs to adjust to the current environment, and students are following suit: 84% of students would consider a virtual internship.<br><br>Whether you’re continuing with your internship program, redefining it, or outright canceling, it’s important to remain transparent and communicate with your would-be interns as soon as possible. You’ll also need to prepare your hiring managers in remote work enablement, and ensure they feel comfortable with the new setup.<\/p>\n\n\n\n<p><a href=\"https:\/\/joinhandshake.com\/blog\/employers\/sas-on-campus-hiring-top-university-talent-with-handshake\/\" target=\"_blank\" rel=\"noreferrer noopener\">SAS, the leader in data analytics<\/a>, took a proactive approach to intern communications to help put interns’ minds at ease. They sent weekly emails, the first one letting interns know that SAS was thinking about them and would keep them in the loop as they worked through what the new program would look like.<br><br>Google also does a great job of <a href=\"https:\/\/www.hbs.edu\/recruiting\/blog\/post\/best-practices-for-creating-a-successful-virtual-internship\" target=\"_blank\" rel=\"noreferrer noopener\">making a decision and clearly communicating it<\/a> with students quickly. This preemptive approach to communication helped ease any nervousness or uncertainty interns were feeling.<\/p>\n\n\n\n<h2>The onboarding opportunity<\/h2>\n\n\n\n<p>With typical onboarding, you’d walk your interns through the office, show them their workspaces, introduce them to the team, and maybe even have a team lunch. With a virtual internship, you can do all of this and more, minus the physical novelties. Onboarding is your opportunity to show interns you value their experience, are dedicated to developing them as professionals, and that they can trust you to support them.&nbsp;<\/p>\n\n\n\n<p>Many students likely have never interned in a remote environment, so it’s important to provide extra resources to limit any uneasiness they have about this new experience. You’ll also want to consider which events or activities can be replicated in a digital environment and which cannot. Business 101 sessions with executives can be done on a video call, but an intern capstone project expo might be more difficult to switch to virtual. It’s up to you to get creative with how you provide those valuable experiences virtually.<\/p>\n\n\n\n<p>Another way to keep interns engaged is to provide them with task checklists (meet with your team, set four or five goals for your internship, and schedule a one-on-one with your manager), set them up with an onboarding buddy, and let them know you’re here to help. We also suggest pairing interns with a mentor who has similar interests or is part of an employee resource group (ERG) to build meaningful connections from the get-go.<br><br>Managers and people teams can support interns, too, by setting up office hours or creating a Slack channel for questions for when an intern needs guidance. By showing interns that they are supported and giving them all the resources they need, you can get them excited about this new type of internship.&nbsp;<\/p>\n\n\n\n<h2>Setting realistic expectations<\/h2>\n\n\n\n<p>Setting expectations is a normal part of the process, in-person <em>and<\/em> remotely. While most expectation setting can typically be done in-person during the onboarding process, a bit more planning needs to go into setting expectations for virtual interns.&nbsp;<\/p>\n\n\n\n<p>There are a few things to consider when setting expectations for virtual interns, which include working hours, meeting participation, project submissions, and communication. Setting expectations isn’t a one-time occurrence. Whenever there’s a new project, you should be setting expectations, too.<\/p>\n\n\n\n<ul><li><strong>Working hours<\/strong>. Let your interns know when they’re expected to check in every morning, but be sure to keep timezones in mind.<br><\/li><li><strong>Meeting participation<\/strong>. Are your interns expected to participate in all-hands meetings? Are they responsible for scheduling meetings with their managers or anyone else that could assist them on a project? Let them know!<br><\/li><li><strong>How we communicate<\/strong>. Some organizations communicate through emails while others almost exclusively use messaging apps. Here at Handshake, we communicate mostly via Slack and host our meetings on Zoom. However you communicate, let your interns know so they don’t miss vital information or are confused about how to reach out to their team.<br><\/li><li><strong>Projects<\/strong>. Whether your interns will be working on multiple projects or one big capstone project, let them know how to submit it, how you format documents or presentations, and how they will be evaluated.<\/li><\/ul>\n\n\n\n<p>By setting expectations with your interns early on, you’re letting them know that you genuinely care about their success with your organization. This also gives them the chance to ask questions to fully understand what their internship will look like.&nbsp;&nbsp;<\/p>\n\n\n\n<h2>Technology is a necessity&nbsp;<\/h2>\n\n\n\n<p>As the name implies, a virtual internship requires technology to make it work. Examining what technology your interns will need to communicate effectively should be done well in advance. Why? Because you need to understand what aspects of your in-person internship actually <em>can <\/em>be made virtual.<\/p>\n\n\n\n<p>SAS did a great job with this. They looked at their summer intern event calendar and chose which events could be done virtually. For example, a seminar on LinkedIn could easily be transitioned to digital by utilizing a videoconferencing platform.<br><br>SAS has an intern expo where over 5,000 employees and executives watch interns present projects, which is difficult to make virtual. With the right software, however, it is possible to make this event virtual. If you host events with over 1,000 attendees, you’ll need to identify software that allows for this. Solidifying the technology you need prior to onboarding your remote interns will be immensely helpful.&nbsp;<\/p>\n\n\n\n<p>If you use Slack for messaging, give your interns access to all channels they need, and make sure they know how to use it. Let them know where to go for communication about specific projects, how to message team members, and what kind of conversations are better sent in an email. If your interns are expected to attend meetings, show them how to join meetings and make sure they’re invited to any meeting they’re expected to attend.<\/p>\n\n\n\n<p>Collaboration is so important when it comes to virtual internships, so it’s important to engage with your interns on these platforms. Whether it’s a friendly good morning message, a space for groups to collaborate, or a way for the interns to converse with team members, technology is a must for interns to be successful.&nbsp;&nbsp;<\/p>\n\n\n\n<h2>Consistency is key&nbsp;<\/h2>\n\n\n\n<p>Communication is an essential part of any successful internship. Whether you’re engaging interns with status updates before your program begins, doing weekly check-ins throughout the program, or following up post-internship, communication is what keeps everything moving. Communicate consistently with your interns.<\/p>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/www.goldmansachs.com\/media-relations\/in-the-news\/current\/07-apr-2020-gs-internship-memo.html\" target=\"_blank\">Goldman Sachs<\/a>, for example, just hired 98 remote interns and is dedicated to growing its interns “by experiencing our firm’s culture, people, businesses, and impact,” according to a company email. They’re achieving those goals through effective and timely communication, including everything from recurring one-on-ones with managers, weekly team check-ins, inviting interns to company all-hands, and more.<br><br>Alejandra Alvarez, one of our customer success interns, explains <a rel=\"noreferrer noopener\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/creative-ways-to-make-your-virtual-internship-a-success\/\" target=\"_blank\">how we keep interns engaged<\/a>:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“My team has made my transition to a virtual internship a smooth one. Even though I miss seeing everyone in the office, the fact that my team syncs every morning to talk about our daily priorities, participates in weekly meetings, and attends our company-wide ‘All Hands’, makes me feel more connected with everyone during this time than ever.”<\/p><cite>—Alejandra Alvarez, Customer Success Intern at Handshake<\/cite><\/blockquote>\n\n\n\n<p>The Harvard Business School offers <a rel=\"noreferrer noopener\" href=\"https:\/\/www.hbs.edu\/recruiting\/blog\/post\/best-practices-for-creating-a-successful-virtual-internship\" target=\"_blank\">a few additional tips on virtual communication with interns<\/a>:<\/p>\n\n\n\n<ol><li>Explore what other innovative companies—such as Google or Microsoft—are doing with their virtual programs and how they’re keeping interns engaged before, during, and after the internship. <br><\/li><li>Schedule regular check-ins. This could be an introductory call, a mid-internship project update, or even a project presentation at the end of the program. These check-ins give interns something to look forward to and set clear project deadlines. By having interns introduce themselves during our all-hands and sharing their selfie and bio in Slack, we give them access to our leadership team here at Handshake.&nbsp;<br><\/li><li><a rel=\"noreferrer noopener\" href=\"https:\/\/www.up.edu\/career\/files\/virtual-internships-guidelines-for-employers.pdf\" target=\"_blank\">The University of Portland<\/a> suggests providing your intern class with timely feedback to ensure they’re getting the most out of your program. Much like in-person programs, interns will have project deliverables. Teach them something new, build their confidence, and give them what they really want from an internship: career and professional development.<br><\/li><li>Let your interns know what to expect each week. Whether it&#8217;s a project update, feedback on their previous work, company announcements, or any other important information, clear and consistent communication keeps your interns on track.<\/li><\/ol>\n\n\n\n<p>When interns aren’t two feet away from you in the office, it’s important to communicate with them as if they were. Is there a new project they need to work on? Do you have valuable feedback to give them? Maybe you want to praise their recent work? Send emails, use messaging apps, or schedule a video call to communicate—everyone will benefit!<\/p>\n\n\n\n<h2>Your culture is more than in-office only<\/h2>\n\n\n\n<p>Perhaps one of the most important aspects of any internship, in-office or remote, is sharing your culture with your interns. This can be a big motivator in working for your company post-graduation or being an advocate for your organization.<br><br>When we think of culture, it’s most often in terms of in-office perks, our values, and our mission. Virtual interns, however, don’t get to experience culture in the office, so it’s crucial that your virtual intern program makes culture front and center.<\/p>\n\n\n\n<p>With so many collaboration platforms out there, creating a sense of culture has never been easier. Paired with a little creativity, you have the opportunity to show interns what it would be like to work with your company full time. Here are a few ways we can show off our culture:<\/p>\n\n\n\n<ol><li>Include interns in company-wide meetings or virtual social gatherings such as a costume party or milestone celebrations. Handshake hosted a talent show with nearly two dozen participants. Our host even dressed to the nines and set up an Oscars backdrop to take everything over the top. This event drew in 85% of our workforce.<br><\/li><li>Host lunch and learns, team breakfasts, or coffee sessions where interns can interact with the team and experience the “water cooler” conversations that occur in the office. We suggest clear communication around reimbursement if interns are purchasing their own food or coffee for these sessions.<br><\/li><li>Set up time every week or so for the team to get together in an open space to ask questions and get to know each other. What better way for an intern to understand what it’s like to work for your business than to ask questions of company employees?<br><\/li><li>Show interns that you value their contributions by introducing them in a company blog post and showing off their final projects on your LinkedIn page or in another blog. This is a fun way for interns to share facts about themselves and for team members to get to know each other.<br><br>You might also consider encouraging interns to participate in social media takeovers to introduce themselves or share what a day in the life of an intern is like.<br><\/li><li>When your internship program ends, ask your interns to <a href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/360000280968-What-are-reviews-and-how-do-I-see-them-\" target=\"_blank\" rel=\"noreferrer noopener\">write a testimonial on your Employer Page on Handshake<\/a>. This informs other early talent applicants of what to expect and can be an opportunity to show off how awesome your company is. Your interns can even answer questions from candidates on your Employer Page.<br><\/li><li>SAS hosts an energy management training for interns during their week-long virtual onboarding, which is chock-full of tips on how to remain productive while working from home and positive during this time. How can you enable interns to remain mentally and physically healthy?<br><br>Here at Handshake, we have a “mental health support &amp; allies” employee resource group, where colleagues can connect on best practices to remain healthy and sane.<\/li><\/ol>\n\n\n\n<p>Not only does putting your culture on display allow your interns to really understand how your organization works, but it also makes for a positive experience. Aside from professional development and the opportunity to learn, interns want to see what life would be like if they worked for you. Showing them your culture is the easiest way to do this.<\/p>\n\n\n\n<h2>Communication never ends<\/h2>\n\n\n\n<p>Once you’ve mastered virtual internship engagement, remember that communication doesn’t end when the internship does, especially if you want to hire some of your interns after they graduate. Here at Handshake, we’re big fans of planning out communication, which is exactly what we do with our interns.&nbsp;<\/p>\n\n\n\n<p>As part of our engagement plan, we make sure that we give interns the opportunity to present their final project and provide feedback before their internship ends. We then work with our HR managers to help interns update their resumes with the experience gained during the internship and highlight their projects.<br><br>We truly want our interns to gain valuable skills and knowledge while they’re with us, so we do everything we can to make them marketable to <em>any <\/em>employer.<\/p>\n\n\n\n<p>We also set up an intern alumni channel in Slack for interns to check in with each other and with us after the internship. Sometimes we’ll post a question of the month, offer a resume workshop, or make our recruiters available for interviewing tips as an added benefit of interning with us.<\/p>\n\n\n\n<p>While you’re there to offer resources and support for your post-internship students, make sure you also highlight some of the benefits of staying in touch with your company. These could span everything from resume help to interviewing tips to staying top of mind when your company is hiring.<\/p>\n\n\n\n<h2>Ready to go virtual?<\/h2>\n\n\n\n<p>Transitioning your traditional internship to a virtual opportunity can be overwhelming, but with a little bit of creativity and a plan, you can create an experience your interns will never forget.&nbsp;<\/p>\n\n\n\n<p>Design a blueprint of what your virtual internship will look like and make sure to engage with interns before, during, and after the internship to ensure they get the most out of working with you. Your interns will thank you and you might just be thanking them, too!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn how SAS &#038; Handshake are planning to engage early talent this summer &#038; beyond.<\/p>\n","protected":false},"author":167034975,"featured_media":2621,"menu_order":0,"template":"","employers_category":[1416],"employers_tag":[1459,1511],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Clever Ideas from SAS &amp; Handshake&#039;s Virtual Internship Engagement Plan<\/title>\n<meta name=\"description\" content=\"As you prepare to onboard students to your virtual internship, get inspired by ideas from SAS &amp; Handshake&#039;s virtual events calendar to keep interns engaged.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Clever Ideas from SAS &amp; Handshake&#039;s Virtual Internship Engagement Plan\" \/>\n<meta property=\"og:description\" content=\"As you prepare to onboard students to your virtual internship, get inspired by ideas from SAS &amp; Handshake&#039;s virtual events calendar to keep interns engaged.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-20T00:42:18+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/Clever-Ideas-from-SAS-Handshakes-Virtual-Internship-Engagement-Plan_1.jpg?fit=6100%2C4067&#038;ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"6100\" \/>\n\t<meta property=\"og:image:height\" content=\"4067\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/Clever-Ideas-from-SAS-Handshakes-Virtual-Internship-Engagement-Plan_1.jpg?fit=6100%2C4067&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/Clever-Ideas-from-SAS-Handshakes-Virtual-Internship-Engagement-Plan_1.jpg?fit=6100%2C4067&ssl=1\",\"width\":6100,\"height\":4067,\"caption\":\"A recent college grad prepares for an engaging virtual internship.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/\",\"name\":\"Clever Ideas from SAS & Handshake's Virtual Internship Engagement Plan\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#primaryimage\"},\"datePublished\":\"2020-05-14T18:18:27+00:00\",\"dateModified\":\"2020-05-20T00:42:18+00:00\",\"description\":\"As you prepare to onboard students to your virtual internship, get inspired by ideas from SAS & Handshake's virtual events calendar to keep interns engaged.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Clever Ideas from SAS &#038; Handshake&#8217;s Virtual Internship Engagement Plan\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Clever Ideas from SAS & Handshake's Virtual Internship Engagement Plan","description":"As you prepare to onboard students to your virtual internship, get inspired by ideas from SAS & Handshake's virtual events calendar to keep interns engaged.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/","og_locale":"en_US","og_type":"article","og_title":"Clever Ideas from SAS & Handshake's Virtual Internship Engagement Plan","og_description":"As you prepare to onboard students to your virtual internship, get inspired by ideas from SAS & Handshake's virtual events calendar to keep interns engaged.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2020-05-20T00:42:18+00:00","og_image":[{"width":6100,"height":4067,"url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/Clever-Ideas-from-SAS-Handshakes-Virtual-Internship-Engagement-Plan_1.jpg?fit=6100%2C4067&ssl=1","path":"\/srv\/htdocs\/wp-content\/uploads\/2020\/05\/Clever-Ideas-from-SAS-Handshakes-Virtual-Internship-Engagement-Plan_1.jpg","size":"full","id":2621,"alt":"A recent college grad prepares for an engaging virtual internship.","pixels":24808700,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/Clever-Ideas-from-SAS-Handshakes-Virtual-Internship-Engagement-Plan_1.jpg?fit=6100%2C4067&ssl=1","contentUrl":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/Clever-Ideas-from-SAS-Handshakes-Virtual-Internship-Engagement-Plan_1.jpg?fit=6100%2C4067&ssl=1","width":6100,"height":4067,"caption":"A recent college grad prepares for an engaging virtual internship."},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/","name":"Clever Ideas from SAS & Handshake's Virtual Internship Engagement Plan","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#primaryimage"},"datePublished":"2020-05-14T18:18:27+00:00","dateModified":"2020-05-20T00:42:18+00:00","description":"As you prepare to onboard students to your virtual internship, get inspired by ideas from SAS & Handshake's virtual events calendar to keep interns engaged.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/clever-ideas-from-sas-handshakes-virtual-internship-engagement-plan\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Clever Ideas from SAS &#038; Handshake&#8217;s Virtual Internship Engagement Plan"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/2498"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/2621"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=2498"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=2498"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=2498"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}