{"id":2620,"date":"2020-05-20T10:20:52","date_gmt":"2020-05-20T17:20:52","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=2620"},"modified":"2020-06-09T16:38:57","modified_gmt":"2020-06-09T23:38:57","slug":"will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/","title":{"rendered":"When Will Campuses Reopen? Your COVID-19-Proof Fall Recruiting Plan"},"content":{"rendered":"\n<h6>Want just the highlights? <a rel=\"noreferrer noopener\" href=\"https:\/\/go.joinhandshake.com\/Fall-Recruiting-Contigency-Guide_Landing-Page.html\" target=\"_blank\">Download a snapshot of the takeaways<\/a> from this post for easy reference.<\/h6>\n\n\n\n<p>Thanks to the novel coronavirus, the recruiting landscape is rapidly evolving.<strong> <\/strong>With travel at a near halt, it’s looking doubtful that any of us will be traveling on a plane any time soon—let alone during the fall recruiting season. This leaves employers with an on-campus recruitment team they’ve typically relied on to visit their core schools and connect with candidates face to face.<br><br>Employers are uncertain about what’ll happen this fall recruiting season. <br><br>Will schools return to normal, welcoming hordes of students back into the classroom? Or is this all-virtual landscape something we should get used to? If so, what’ll our on-campus representatives do now? During this time of uncertainty, questions run deep (<a rel=\"noreferrer noopener\" href=\"https:\/\/medium.com\/@k8eemooney\/dear-vp-of-talent-at-fortune-500-company-40da172710a3\" target=\"_blank\">Handshake’s Katie Mooney offers a few answers<\/a>).<br><br>If things don’t quite go back to normal—which is looking increasingly likely—evolving in the new landscape will require employers, students, and schools to go through an exploration phase to preempt any downfalls. Higher education institutions are proposing a myriad of solutions for how they’ll open up campuses come fall, with some school systems such as <a rel=\"noreferrer noopener\" href=\"https:\/\/www.reuters.com\/article\/us-health-coronavirus-usa-university\/fearing-covid-19-biggest-u-s-university-system-makes-fall-term-virtual-idUSKBN22S01B\" target=\"_blank\">California State University<\/a> adopting entirely virtual classrooms.<br><br>Meanwhile, 6 in 10 employers report that they plan on visiting fewer schools this fall, with some choosing not to go back at all, according to a recent Handshake employer survey. What this means for recruiting teams is the need for a contingency plan that incorporates an entirely different fall recruiting approach from the one they’ve relied on.<br><br>With traditional solutions simply not cutting it anymore, employers are looking for an approach to recruiting that incorporates interest from their qualified talent pools without sacrificing the engagement they typically receive on campus.<br><br>One thing is certain: this fall recruiting season is going to be the most atypical these early talent teams have experienced yet, and ultimately, employers will need to adopt a strategy that responds to the plans of students and higher ed institutions. As early talent recruiting teams work through their questions around fall recruiting, we encourage you to adopt this six step COVID-19-proof contingency plan as part of your recruiting playbook.<\/p>\n\n\n\n<h2>1. Move beyond your core schools approach this fall recruiting season<\/h2>\n\n\n\n<p>If you’ve traditionally relied on recruiting from schools in your backyard, or hopping on a flight to meet students in-person, you might want to reconsider. Employers who do&nbsp; travel might not be familiar with the new experience—<a rel=\"noreferrer noopener\" href=\"https:\/\/www.theatlantic.com\/politics\/archive\/2020\/04\/will-colleges-be-open-coronavirus\/610657\/\" target=\"_blank\">auditoriums and arenas turned into lecture halls, athletics teams playing in empty stadiums<\/a>, and a completely different career fair with limited capacity and physical contact. Plus, fewer passenger flights and a pandemic that’s <a rel=\"noreferrer noopener\" href=\"https:\/\/www.cnn.com\/2020\/03\/05\/business\/airlines-coronavirus-iata-travel\/index.html\" target=\"_blank\">cost the airline industry billions<\/a> is sure to send travel costs upward.<br><br>Higher education institutions are considering <a rel=\"noreferrer noopener\" href=\"https:\/\/www.insidehighered.com\/digital-learning\/blogs\/learning-innovation\/15-fall-scenarios\" target=\"_blank\">15 possible scenarios for returning students this fall<\/a>—from delaying start dates to remaining fully virtual and just about everything in between, such as a HyFlex model which supplements virtual coursework with in-person classes to limit the number of students physically on campus.<br><br>Employers, too, should consider that this fall recruiting season will not be the same. And the golden age of on-campus events may be over, at least for now. Instead of reusing travel and entertainment budgets to fly your team and company representatives out to your partner schools, take this opportunity to recognize that qualified talent exists everywhere online.<br><br>There are more than 2,400 four-year colleges in the US. Surely, there must be qualified candidates in the schools beyond your core list. Handshake Premium partner, <a rel=\"noreferrer noopener\" href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake_UnderArmour_CaseStudy.pdf\" target=\"_blank\">Under Armour<\/a>, for example, approached this strategy by expanding their small team’s recruiting presence from a few schools close to their Baltimore, MD headquarters to more than 850 schools nationwide—a 35x increase from their original approach.<\/p>\n\n\n\n<p>College students and recent grads represent your future leaders with the right backgrounds and skills to match the talent profiles you’re looking for. As a result, they are more diverse than the students you typically engage with in your backyard or at your core schools.<\/p>\n\n\n\n<h2>2. Proactively find candidates that match your talent profiles<\/h2>\n\n\n\n<p>To proactively find candidates regardless of geography, tap into qualified talent from Handshake’s network of more than six million active students across over 900 partner schools. Identify your talent profiles first. If you’re hiring a product manager, for example, you’ll want to look for talent with a business major and skills such as project management and interpersonal communication.<br><br>By moving away from your core schools approach, you can reach students you otherwise wouldn’t have met in person. A public university in Virginia, like George Mason University (this content marketer&#8217;s alma mater), might have a pretty good writer, but be located in a state you typically don’t recruit from. A student from Georgia Tech with a 3.6 GPA and a major in computer science might be your next head of engineering.<br><br>The coronavirus pandemic has forced us all to consider new ways of working. Thanks to the technology students rely on to find their first or second jobs, you don’t have to sacrifice fit for location. Why not then consider the core recruiting model broken, and leverage this opportunity to be even more connected with talent—regardless of where they go to school or who they know?<\/p>\n\n\n\n<p>On Handshake, you can filter from our network of active students to tap into talent this fall by location, major, minor, skills, background, demographic or minority groups, and more. Try the filter out yourself by <a rel=\"noreferrer noopener\" href=\"http:\/\/app.joinhandshake.com\" target=\"_blank\">signing up or logging into your account on Handshake<\/a>. From there, you can activate your list of talent attributes to yield the number of qualified students you’re now able to reach from schools all over the country, without stepping foot on campus.<br><br>Financial institutions, like M&amp;T Bank, are already using Handshake to meaningfully and scalably connect with talent from over 655 partner schools and counting. The students they now reach are more qualified and have demonstrated an interest in living or relocating to their headquarters in Buffalo, NY. <a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake%20Case%20Study%20M&amp;T%20Bank.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Learn how M&amp;T Bank engages untapped pools<\/a>, regardless of where they live.<\/p>\n\n\n\n<h2>3. Restructure your on-campus teams to engage early talent online<\/h2>\n\n\n\n<p>Once you’ve found the right students, the next step is to connect with them personally and proactively by repurposing your on-campus talent team. Students are understandably anxious during this time, so make sure your team effectively communicates how you’re handling the situation and supporting your employees through and through. These on-campus representatives have the right skills to be successful here.<\/p>\n\n\n\n<p>As mentioned in the last section, your team can seamlessly <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/\" target=\"_blank\" rel=\"noreferrer noopener\">personalize their outreach to students<\/a> based on personal attributes, such as school name and skills. Remember, this team thrives on building connections, which is why you spend budget to fly them out to campuses to build quality connections with students in the first place.<br><br>If they typically give out swag at a table or booth, have them send qualified talent they’ve built meaningful relationships with a box of swag and a handwritten note in the mail. Keep in mind that your swag choices should represent the current climate—candidates might value a journal, hand sanitizer, t-shirt, or tool to help them be more productive remotely over a tote bag, sunglasses, or umbrella. Students will no doubt enjoy receiving a token of appreciation from you during this time.<br><br>Don’t risk the health of your team by sending them to career fairs. Instead, send the career fairs to them. Your on-campus representatives can help host, facilitate, or moderate your virtual events this fall, which we’ll cover next.<\/p>\n\n\n\n<h2>4. Shift your on-campus events to virtual events, info sessions, and panels<\/h2>\n\n\n\n<p>Your on-campus presence is typically your bread and butter. These events are offered over two seasons twice a year, and you savor the experience of giving students unique insight into your company. It’s not only an opportunity where students get to learn about your offerings and the values you stand for, but to see and feel these values in person.<br><br>During this disruptive period, creativity is needed. Consider the time it takes to equip your on-campus representatives to secure travel and logistics for their events. They then travel to these campuses, and spend hours on end connecting with students from all backgrounds —many of whom aren’t necessarily the right fit. They board another plane and do it all again.<br><br>While there’s no surefire way to replicate visual cues exchanged in-person, you can cut costs this fall by replicating many components of in-person engagement to a digital experience and still generate meaningful interest from early talent.<br><br>Virtual events aren’t new—they’ve influenced employers like <a rel=\"noreferrer noopener\" href=\"https:\/\/joinhandshake.com\/employers-premium\/customers\/case-studies\/ibm.pdf?version=1588865057\" target=\"_blank\">IBM to tap into candidates from underrepresented backgrounds<\/a>, and remain obvious choices in engaging the emerging college talent generation, which grew up on technology, social media, and mobile phones.<br><br>Now that the coronavirus pandemic is forcing employers to go digital, virtual events are a critical component of your virtual recruiting toolkit. If you haven’t hosted one already, <a rel=\"noreferrer noopener\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-host-a-virtual-event\/\" target=\"_blank\">we strongly advise you host one soon<\/a>. Why? Because by now, we know that the novel coronavirus isn’t going to stop disrupting life as we knew it anytime soon.<br><br>If students do return to campus, it won’t be the same. There will likely be a mix of those who do come back, and those who don’t. During the current spring recruiting season, employers have explored what it’s like to engage candidates virtually. <a rel=\"noreferrer noopener\" href=\"https:\/\/drive.google.com\/file\/d\/1kaaQzoLIA9omuW4Ie59_-soziGvlBjAC\/view\" target=\"_blank\">And results from a recent Handshake survey<\/a> show that 59% of employers plan on increasing digital engagement, including virtual events, during this time.<br><br>Over the last couple of months, these employers have tried and tested what it’s like to host virtual info sessions, diversity in leadership panels, office tours, or AMAs (aka ask-me-anything sessions).<br><br>They’ve taken this opportunity to explore a different landscape with a unique lens, and have incorporated data-driven feedback from the candidates who’ve attended their events, creating a better framework for how they plan to engage early talent this fall.<\/p>\n\n\n\n<p>Starting in August, you&#8217;ll be able to <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/an-end-to-end-solution-for-your-all-virtual-fall-2020-recruiting-season\/\" target=\"_blank\" rel=\"noreferrer noopener\">host and drive attendance to your virtual events<\/a> entirely on Handshake, eliminating the need for multiple solutions and allowing you to optimize your candidate lifecycle from end to end.<\/p>\n\n\n\n<h2>5. Keep in touch with your partners in career services<\/h2>\n\n\n\n<p>Your relationship with your colleagues and family has likely shifted online. So, too, should your relationships with your career service center partners.<strong> <br><br><\/strong>Keep in mind that your on-campus representatives are the face of your company and employer brand. They thrive on creating meaningful connections and relationships, so they’re more likely to relish the opportunity in fostering better engagement from your career services partners, too.<br><br>Invite these on-campus representatives to nurture your relationships with universities by creating online office hours, where career services professionals can come into a virtual call and ask questions. Curate a weekly or monthly newsletter to keep them in the loop on your evolving program, company culture events, and open jobs for early talent applicants.<br><br>You can also use this opportunity to survey them and incorporate data-driven feedback into both your program and communications. Our customer success teams at Handshake hold recurring calls with our <a rel=\"noreferrer noopener\" href=\"https:\/\/joinhandshake.com\/employers-premium\/\" target=\"_blank\">Premium partners<\/a> to ensure they’re making headway in their programs. Encourage your representatives to maintain regular virtual face-to-face meetings where they can better get to know each other’s unique challenges and solutions.<br><br>Another recurring virtual series we’re hosting here at Handshake brings together early talent leaders and professionals through virtual roundtables where they can sip coffee or taste wine from Napa, CA while getting to know one another better. Think outside the box to create a memorable experience that nurtures all of your connections during this time.<\/p>\n\n\n\n<h2>6. Allow your employer brand to work for you<\/h2>\n\n\n\n<p>Employer branding has come a long way in the last few decades. It used to be that potential candidates would only know your brand through its word-of-mouth reputation. Talent would then have to connect the dots to figure out what it might be like to work for you—looking up your leadership team or examining your latest advertising campaign.<\/p>\n\n\n\n<p>But nowadays, there are multiple digital tools at employers’ fingertips to tell their company’s story. To do this well, companies need to build out their brand presence in multiple places—first, on their own websites, where some job seekers may look, but also on verticalized job platforms, such as Handshake, where their target audience can be found.<\/p>\n\n\n\n<p>At its core, <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-build-an-employer-brand-early-talent-loves\/\" target=\"_blank\" rel=\"noreferrer noopener\">your employer brand is a reflection of your values<\/a>. Whether you’re hiring early talent, pausing hiring, or engaging them through project-based work, showcase how you’re responding to hiring during COVID-19 through your employer brand. Students are looking to employers for support during this time, so the more clarity you can provide them with the better positioned you’ll be when the economy rebounds.<br><br>For many candidates, your employer brand is their first impression of you. By being transparent about your program, you can foster a greater sense of goodwill and create lasting positive associations from early talent with your employer brand—despite economic or environmental uncertainties.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.hubspot.com\/careers\/students\" target=\"_blank\" rel=\"noreferrer noopener\">Hubspot’s early talent career portal<\/a> on its website is a good example of how to tell your story. Recent college graduates exploring their first or second job can access a wealth of information that can help them understand what a career at HubSpot might look like.<\/p>\n\n\n\n<p>The company pairs its careers page with an “About” section on Handshake that describes the employer’s commitment to its employees. With Handshake Premium, HubSpot shares insights that help early talent get to know them, and are able to <a href=\"https:\/\/www.youtube.com\/watch?v=EbEuUnQFyQ8\" target=\"_blank\" rel=\"noreferrer noopener\">personalize their Employer Page<\/a> to dynamically appeal to different talent segments.<\/p>\n\n\n\n<p>If a marketing major visits their Handshake profile, for example, they’ll see testimonials and an up-to-date Q&amp;A forum from marketers who’ve interviewed or worked at HubSpot. These resources tell a powerful story of how each individual contributes to the company’s core value propositions.<\/p>\n\n\n\n<h2>Next steps &amp; takeaways<\/h2>\n\n\n\n<p>As you work through your fall recruiting contingency plan, we invite you to take this opportunity to collaborate with leaders in early talent recruiting to learn how the rapidly changing landscape is evolving, and how your peers are adapting.<br><br>Whether you are hiring for the fall recruiting season or not, employers all have a responsibility to meaningfully influence the next generation of rising innovators, and to <a rel=\"noreferrer noopener\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/rescinding-offers-3-reasons-to-support-early-talent-through-meaningful-project-based-work\/\" target=\"_blank\">explore engagement even in the smallest of ways<\/a>. The silver lining here is that perhaps early talent recruiting, for the first time, will have no bounds or physical limitations.<\/p>\n\n\n\n<p>Learn more about the virtual career fair and events product we’re building or <a rel=\"noreferrer noopener\" href=\"https:\/\/joinhandshake.com\/employers-premium\/request-more-info\/\" target=\"_blank\">get in touch<\/a> with one of our experts to learn more about trends we’re seeing from employers, colleges, and students, and how you can better prepare for a fall recruiting season that addresses the contingency plans of all of your stakeholders.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Meet the needs of schools &#038; students this fall by adopting these strategies.<\/p>\n","protected":false},"author":167034975,"featured_media":2623,"menu_order":0,"template":"","employers_category":[1414],"employers_tag":[1449,1442],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>When Will Campuses Reopen? Your COVID-19-Proof Fall Recruiting Plan<\/title>\n<meta name=\"description\" content=\"With schools exploring options for reopening, learn how to respond to those plans and stand out with early talent this unprecedented fall recruiting season.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"When Will Campuses Reopen? Your COVID-19-Proof Fall Recruiting Plan\" \/>\n<meta property=\"og:description\" content=\"With schools exploring options for reopening, learn how to respond to those plans and stand out with early talent this unprecedented fall recruiting season.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-09T23:38:57+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/HS_Fall20RecruitingPlaybook-1024x683.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"683\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/HS_Fall20RecruitingPlaybook.jpg?fit=7822%2C5217&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/HS_Fall20RecruitingPlaybook.jpg?fit=7822%2C5217&ssl=1\",\"width\":7822,\"height\":5217,\"caption\":\"Recruiter maps out her all-virtual fall recruiting contingency plan.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/\",\"name\":\"When Will Campuses Reopen? Your COVID-19-Proof Fall Recruiting Plan\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#primaryimage\"},\"datePublished\":\"2020-05-20T17:20:52+00:00\",\"dateModified\":\"2020-06-09T23:38:57+00:00\",\"description\":\"With schools exploring options for reopening, learn how to respond to those plans and stand out with early talent this unprecedented fall recruiting season.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"When Will Campuses Reopen? Your COVID-19-Proof Fall Recruiting Plan\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"When Will Campuses Reopen? Your COVID-19-Proof Fall Recruiting Plan","description":"With schools exploring options for reopening, learn how to respond to those plans and stand out with early talent this unprecedented fall recruiting season.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/","og_locale":"en_US","og_type":"article","og_title":"When Will Campuses Reopen? Your COVID-19-Proof Fall Recruiting Plan","og_description":"With schools exploring options for reopening, learn how to respond to those plans and stand out with early talent this unprecedented fall recruiting season.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2020-06-09T23:38:57+00:00","og_image":[{"width":1024,"height":683,"path":"2020\/05\/HS_Fall20RecruitingPlaybook-1024x683.jpg","url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/HS_Fall20RecruitingPlaybook-1024x683.jpg","size":"large","id":2623,"alt":"Recruiter maps out her all-virtual fall recruiting contingency plan.","pixels":699392,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/HS_Fall20RecruitingPlaybook.jpg?fit=7822%2C5217&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/HS_Fall20RecruitingPlaybook.jpg?fit=7822%2C5217&ssl=1","width":7822,"height":5217,"caption":"Recruiter maps out her all-virtual fall recruiting contingency plan."},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/","name":"When Will Campuses Reopen? Your COVID-19-Proof Fall Recruiting Plan","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#primaryimage"},"datePublished":"2020-05-20T17:20:52+00:00","dateModified":"2020-06-09T23:38:57+00:00","description":"With schools exploring options for reopening, learn how to respond to those plans and stand out with early talent this unprecedented fall recruiting season.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"When Will Campuses Reopen? Your COVID-19-Proof Fall Recruiting Plan"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/2620"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/2623"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=2620"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=2620"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=2620"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}