{"id":3428,"date":"2020-07-24T12:26:59","date_gmt":"2020-07-24T19:26:59","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=3428"},"modified":"2020-08-07T10:58:29","modified_gmt":"2020-08-07T17:58:29","slug":"virtual-career-fairs-7-ways-employers-can-stand-out","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/","title":{"rendered":"Virtual Career Fairs: 7 Ways Employers Can Stand Out"},"content":{"rendered":"\n<h6>Want just the highlights? <a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake_VirtualCareerFairChecklist.pdf\" target=\"_blank\" aria-label=\"undefined (opens in a new tab)\" rel=\"noreferrer noopener\">Download a snapshot of these takeaways<\/a> for easy reference.<\/h6>\n\n\n\n<p>The recent <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/\" target=\"_blank\" rel=\"noreferrer noopener\">shift from in-person to virtual recruiting<\/a> has everyone looking for new strategies. With traditional recruiting tactics like events and campus career fairs operating differently this year, virtual career fairs and virtual events have become the new norm.<\/p>\n\n\n\n<p>Whether your campus recruiting program is shifting entirely to digital, or you’re considering adopting a hybrid approach, know that more than 80% of Handshake’s university partners plan to sponsor all or most of their recruiting events online this fall.<\/p>\n\n\n\n<p>In a virtual career fair setting, employers with a recognizable consumer brand will be afforded the opportunity of instant brand recognition. Companies with hiring needs and limited employer brand awareness will need to do more than just show up at virtual career fairs to stand out.<\/p>\n\n\n\n<h2>What is a Virtual Career Fair?<\/h2>\n\n\n\n<p>Virtual career fairs are similar to traditional in-person career fairs in that they provide employers the opportunity to share employment opportunities and meet with students at their partner schools. The key difference between the two is that virtual career fairs are held exclusively online.<br><br>Virtual career fairs vary in complexity depending on the hosting platform—from simple video calls and chat to fully interactive virtual “booths” like the ones hosted on Handshake. Each company’s virtual experience is different. Standing out in this setting really all comes down to how you personalize, prepare, and customize the experience for early talent.<\/p>\n\n\n\n<h2>Benefits of Virtual Career Fairs<\/h2>\n\n\n\n<p>Rather than spending money on travel and entertainment to cram into a packed gymnasium for a few times out of the year, virtual career fairs allow employers to get from one side of the country to the other in a matter of seconds. <\/p>\n\n\n\n<p>Virtual career fairs are an opportunity for hiring professionals to engage with students on their own terms and from the comfort of their homes. By making use of digital tools like Handshake, employers can reach targeted audiences that align with their criteria and values ahead of these events.<br><br>In this virtual experience, recruiters can determine fit early on and enable a more personalized candidate experience from beginning to end. <\/p>\n\n\n\n<p>Before launching your virtual career fair booth to an audience of eager faces, there are a few ways in which you can prepare to log on with confidence. In this post, we’ll dive into how you can use digital recruiting tools like student search, proactive messaging, and interactive video to help you meet with the right candidates and stand out at your virtual career fairs.<\/p>\n\n\n\n<h6>Tip: This fall, you can <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/360048634953-Handshake-s-Virtual-Career-Fair-FAQs#h_3caca8fb-20b5-4298-a30c-49b0754499d6\" target=\"_blank\" rel=\"noreferrer noopener\">join virtual career fairs on Handshake for free<\/a>. Universities may still opt to charge a registration fee for attending.<\/h6>\n\n\n\n<h2>Before a Virtual Career Fair<\/h2>\n\n\n\n<h3>1. Engage with your ideal candidates early on<\/h3>\n\n\n\n<p>Day-long, 10-hour career fairs aren’t going to be efficient in the virtual realm. <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/report-how-covid-19-is-impacting-college-recruiting\/\" target=\"_blank\" rel=\"noreferrer noopener\">Coursework, virtual meetups, and family and health priorities<\/a> are all competing for the attention of students these days. An hour and a half is about the maximum amount of time someone can participate in a virtual session without a break, <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/www.press.org\/live-virtual-or-hybrid-events-which-approach-best\" target=\"_blank\" rel=\"noreferrer noopener\">according to The National Press Club<\/a>.<br><br>To maintain a competitive position and capture the attention of Gen Z quickly, you need to reach out to your ideal talent candidates early and often (especially before your competitors do).<\/p>\n\n\n\n<p>On Handshake, you can connect with 1K+ partner universities and <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/219133157-Using-Search-Students-Feature-\" target=\"_blank\" rel=\"noreferrer noopener\">filter from 6M+ active students<\/a> to find your qualified talent matches. When you do, you’ll have the ability to message those students one-on-one (up to 100 messages per semester using Handshake Core) and proactively invite those students to your virtual events and virtual career fairs.<\/p>\n\n\n\n<h6>Tip: <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/360023878153-Handshake-s-Premium-Employer-Offering\" target=\"_blank\" rel=\"noreferrer noopener\">Handshake Premium partners<\/a> can save their talent searches using Segments and send unlimited invitation and follow up messages using Campaigns.<\/h6>\n\n\n\n<h3>2. Perfect your employer brand before sending your outreach<\/h3>\n\n\n\n<p>Today’s college students and recent grads want to know that their first or second job out of school is going to be impactful.&nbsp;To ensure they’ve done their due diligence, <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/go.joinhandshake.com\/Virtual-Employer-Branding-Guide.html\" target=\"_blank\" rel=\"noreferrer noopener\">more than 9 in 10 candidates seek out at least one online or offline resource<\/a> to evaluate an employer&#8217;s brand before applying for a job.<br><br>Explicitly outlining how early talent can make changes throughout the organization, speaking to your mission and goals, and honing in on what key takeaways you want students to get from your virtual activations are essential preparation practices.&nbsp;<\/p>\n\n\n\n<p><em>If you only had two minutes to talk about your company, what would you want students to know and what action do you want them to take from there?<\/em><\/p>\n\n\n\n<p>If you&#8217;re attaching your virtual session to your message, provide students with a preview of what’s to be expected. This not only holds your team accountable, but prioritize student interest based on the most qualified.<\/p>\n\n\n\n<h3>3. Identify what answers your target audience wants to know<\/h3>\n\n\n\n<p>Utilizing your Employer Page to its full capacity and reaching out to those who RSVP early through a short message makes these early interactions less robotic and more personable. <\/p>\n\n\n\n<p>Proactive, personalized, and scalable messaging is not only an easy way to share important information with your target audience, but also provides for a transparent avenue to help you capture content ideas. Invite engaged students to send in one question they would like answered by the end of the virtual career fair, for example.<\/p>\n\n\n\n<h6>Tip: Premium partners can not only host their own virtual events natively on Handshake, they can also prompt qualifying questions to students when they join the event to prioritize ideal talent.<\/h6>\n\n\n\n<p>Determining what your audience wants to learn is the secret to making the most out of your day. This way, you know exactly how to structure your time and guarantee a more interactive session. And when students have a great experience, they’re more likely to promote your company with their peers by default “word of mouth”.&nbsp;<\/p>\n\n\n\n<p>With the lack of eloquently prepared booths at your disposal to draw in foot traffic this year, employers will need to do more prep work to get creative before any virtual career fairs. Collecting FAQ’s beforehand is one idea we&#8217;ve already covered.<br><br>Others include “day in the life” snippets from current employees or thoughtful short videos that feature cross-functional senior leaders.<\/p>\n\n\n\n<h2>During a Virtual Career Fair<\/h2>\n\n\n\n<h3>4. Empower early talent to put their best foot forward<\/h3>\n\n\n\n<p>Pivoting virtually allows employers with more space and time to get creative. Unlike traditional career fairs, companies are limited on the organic brand exposure they get from students stumbling across their swag or decorative banners in person.&nbsp;<\/p>\n\n\n\n<p>It’s important to carve out time to map how you can influence the conversation. Showcase the best your business offers and highlight exactly why new hires should want to grow with your company. Establish transparency, open up the dialogue, and lay out position expectations as early as possible in your session as these are important touch points for early talent.<\/p>\n\n\n\n<p>The planning you do before the event to discover the interest of your talent pool allows you to speak on <em>exactly<\/em> what students have identified to be important to their career journey. You can even expand on ways your company intends to empower students to make changes in the organization long-term.&nbsp;<\/p>\n\n\n\n<p>Gamifying the virtual career fair experience is one way you can keep your audience engaged. Brainstorm ideas that will make the student experience at your virtual booth both memorable and useful. Consider facilitating <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/joinhandshake.com\/employers\/customers\/case-studies\/ibm.pdf?version=1595521190\" target=\"_blank\" rel=\"noreferrer noopener\">a virtual scavenger hunt<\/a> where the first 50 people to identify in-session cues correctly win exclusive company swag, mini exercises where ambassadors share their virtual work spaces, or trivia boards where students can answer questions to get to know your senior level employees better.<br><br>Your time is valuable, so every conversation is an opportunity to slip in key details about your employer.<a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/www.naceweb.org\/talent-acquisition\/student-attitudes\/job-security-tops-students-wish-list\/\" target=\"_blank\" rel=\"noreferrer noopener\"> The National Association of Colleges and Employers <\/a>highlights a good brand reputation, service to the community, diversity consciousness, and details on upward mobility options within the company as the most important considerations and&nbsp;topics to highlight with students.&nbsp;<\/p>\n\n\n\n<h3>5. Save time &amp; break down in-person barriers<\/h3>\n\n\n\n<p>With limited time for extracurricular travel and work bandwidth, connecting candidates with executives would be nearly impossible in an in-person setting. Finding time in the demanding schedule of a VP to travel alongside your on-campus representatives every recruiting season isn’t efficient.<br><br>This year, ensure everyone&#8217;s time is valuable by redesigning your future strategy to include more virtual activities. Travel is not a concern in the virtual world, regardless of where you are located—your entire team, interns, and senior management can be in on the conversation with students. So virtual career fairs ensure that you make the most of your leaders’ time and get them in front of the right people.<br><br>If your company is looking to build brand awareness and speak to how you actualize your mission, you might consider inviting your VP of engineering who happens to be a woman, for example, to provide personalized insight into how your company supports other women computer science majors throughout their careers.<\/p>\n\n\n\n<h6>Tip: Employers on Handshake can add up to 15 team members to their virtual career fair schedule to help diversify the conversation.<\/h6>\n\n\n\n<h3>6. Creating a meaningful and lasting impression<\/h3>\n\n\n\n<p>Your audience members look to like-minded individuals to gain insight on your company culture, career guidance, and personal development.&nbsp;<a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/hbr.org\/2019\/05\/7-ways-to-set-up-a-new-hire-for-success\" target=\"_blank\" rel=\"noreferrer noopener\">The Harvard Business Review<\/a> notes connections with key stakeholders, and a strong sense of belonging as essential components for successful new hires. <\/p>\n\n\n\n<p>Handshake Premium partners can utilize tools like virtual ambassadors as a means to break down the barriers of communication between senior employees and new hires. Allow your audience the opportunity to familiarize themselves with more than just your recruiting team by connecting them with your ambassadors. This makes interactions more human and helps students visualize what life looks like at your company.&nbsp;<br><br>If your senior leaders aren&#8217;t available at the time of your session, short, one-minute videos that answer what drew <em>them<\/em> to the company or their favorite thing about their are excellent resources to come prepared with. You can lean on your current or former interns to complement the experience as well.<\/p>\n\n\n\n<p>Since they were previously in their position, your early career hires can empathize with students and speak about how your company fosters careers for early talent. These introductions make room for qualified candidates to hear directly from the people whose footsteps they want to follow.<\/p>\n\n\n\n<p>This puts <em>more<\/em> relevant employees in front of great talent than ever before. In turn, students get to see first-hand the inner workings of the business a Google search can’t provide, and uncover who the best people are to network with in the future.&nbsp;<\/p>\n\n\n\n<h2>After a Virtual Career Fair<\/h2>\n\n\n\n<h3>7. Continue building and nurturing your qualified connections<\/h3>\n\n\n\n<p>After your virtual career fair, you can refer back to your attendee’s student profiles to continue building on the conversation with individuals who fit your ideal criteria. Keep in mind that these students have likely met with other employers they may be interested in, so time is of the essence here.<br><br>Keep the conversation with qualified students going by reaching out a day after the virtual career fair and inviting them to connect one-on-one.<\/p>\n\n\n\n<h6>Tip: With Handshake Premium, <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/360034459273-Campaigns-Create-and-Manage-a-Campaign\" target=\"_blank\" rel=\"noreferrer noopener\">employers can queue up automated follow up and send unlimited messages<\/a> to any candidate they’ve interacted with in the past.<\/h6>\n\n\n\n<p>As some of the first to adopt this virtual recruiting method, you have control over the entire experience, so keep in mind that your event is setting the standard that students will come to expect from employers in the future.<\/p>\n\n\n\n<p>Identifying what worked well and following up to build on that is critical to your success this fall and beyond. Remember, interactive activities like trivia, scavenger hunts, and live panels make your company more memorable while also providing you the opportunity to replicate components of in-person career fairs to the virtual experience.<\/p>\n\n\n\n<h2>Final Thoughts<\/h2>\n\n\n\n<p>As we enter a new, evolving reality in talent acquisition, one thing remains consistent: students want to work for employers that <em>care<\/em> about them and their careers<em>. <br><br><\/em>Set your employer apart from others by showcasing your very best and be one of the first to master the virtual experience.<em> <\/em><\/p>\n\n\n\n<p>This fall, employers can’t afford to fall behind on new strategies or enter this territory unprepared. The need to digitally adapt has been a top consideration for employers for many years. It&#8217;s time to make the change. But you don&#8217;t have to go at it alone.<br><br>The team at Handshake built a new end-to-end solution to help you make the shift from in person to virtual sourcing, engagement, and hires much easier. <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/an-end-to-end-solution-for-your-all-virtual-fall-2020-recruiting-season\/\" target=\"_blank\" rel=\"noreferrer noopener\">Learn how to partner with us<\/a> and get an expert advisor to help extend your team this fall. about how we can partner and be an extension of your team this virtual fall.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Best practices for engaging with students before, during, and after your virtual career fairs.<\/p>\n","protected":false},"author":167034975,"featured_media":3437,"menu_order":0,"template":"","employers_category":[1414],"employers_tag":[1459,1449],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Virtual Career Fairs: 7 Ways Employers Can Stand Out<\/title>\n<meta name=\"description\" content=\"Employers, how do you raise awareness with students in an all-virtual environment? Start by adopting these ideas before your virtual career fairs this fall.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Virtual Career Fairs: 7 Ways Employers Can Stand Out\" \/>\n<meta property=\"og:description\" content=\"Employers, how do you raise awareness with students in an all-virtual environment? Start by adopting these ideas before your virtual career fairs this fall.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2020-08-07T17:58:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/07\/Virtual-Career-Fairs-7-Ways-Employers-Can-Stand-Out.jpg?fit=1440%2C960&#038;ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1440\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/07\/Virtual-Career-Fairs-7-Ways-Employers-Can-Stand-Out.jpg?fit=1440%2C960&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/07\/Virtual-Career-Fairs-7-Ways-Employers-Can-Stand-Out.jpg?fit=1440%2C960&ssl=1\",\"width\":1440,\"height\":960,\"caption\":\"Virtual Career Fairs: 7 Ways Employers Can Stand Out\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/\",\"name\":\"Virtual Career Fairs: 7 Ways Employers Can Stand Out\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#primaryimage\"},\"datePublished\":\"2020-07-24T19:26:59+00:00\",\"dateModified\":\"2020-08-07T17:58:29+00:00\",\"description\":\"Employers, how do you raise awareness with students in an all-virtual environment? Start by adopting these ideas before your virtual career fairs this fall.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Virtual Career Fairs: 7 Ways Employers Can Stand Out\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Virtual Career Fairs: 7 Ways Employers Can Stand Out","description":"Employers, how do you raise awareness with students in an all-virtual environment? Start by adopting these ideas before your virtual career fairs this fall.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/","og_locale":"en_US","og_type":"article","og_title":"Virtual Career Fairs: 7 Ways Employers Can Stand Out","og_description":"Employers, how do you raise awareness with students in an all-virtual environment? Start by adopting these ideas before your virtual career fairs this fall.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2020-08-07T17:58:29+00:00","og_image":[{"width":1440,"height":960,"url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/07\/Virtual-Career-Fairs-7-Ways-Employers-Can-Stand-Out.jpg?fit=1440%2C960&ssl=1","path":"\/srv\/htdocs\/wp-content\/uploads\/2020\/07\/Virtual-Career-Fairs-7-Ways-Employers-Can-Stand-Out.jpg","size":"full","id":3437,"alt":"Virtual Career Fairs: 7 Ways Employers Can Stand Out","pixels":1382400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/07\/Virtual-Career-Fairs-7-Ways-Employers-Can-Stand-Out.jpg?fit=1440%2C960&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/07\/Virtual-Career-Fairs-7-Ways-Employers-Can-Stand-Out.jpg?fit=1440%2C960&ssl=1","width":1440,"height":960,"caption":"Virtual Career Fairs: 7 Ways Employers Can Stand Out"},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/","name":"Virtual Career Fairs: 7 Ways Employers Can Stand Out","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#primaryimage"},"datePublished":"2020-07-24T19:26:59+00:00","dateModified":"2020-08-07T17:58:29+00:00","description":"Employers, how do you raise awareness with students in an all-virtual environment? Start by adopting these ideas before your virtual career fairs this fall.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/virtual-career-fairs-7-ways-employers-can-stand-out\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Virtual Career Fairs: 7 Ways Employers Can Stand Out"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/3428"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/3437"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=3428"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=3428"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=3428"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}