{"id":4395,"date":"2020-09-14T13:46:12","date_gmt":"2020-09-14T20:46:12","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=4395"},"modified":"2020-10-14T10:48:29","modified_gmt":"2020-10-14T17:48:29","slug":"want-more-latinx-candidates-try-these-3-hiring-strategies","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/","title":{"rendered":"Want More Latinx Candidates? Try these 3 Hiring Strategies"},"content":{"rendered":"\n<p>People of Latin American cultural or ethnic identity, Latinx, accounted for <a href=\"https:\/\/www.brookings.edu\/research\/new-census-data-shows-the-nation-is-diversifying-even-faster-than-predicted\/\" target=\"_blank\" rel=\"noreferrer noopener\">over half of all US population growth<\/a> between 2010 and 2019. Despite being the nation’s second largest racial and ethnic group, Latinxs are generally underrepresented in postsecondary education.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.communitycollegereview.com\/blog\/more-latinos-are-heading-to-community-college-but-facing-challenges-along-the-way\" target=\"_blank\" rel=\"noreferrer noopener\">Underfunded college systems are partly responsible<\/a>, but recruiting structures aren’t surfacing more inclusive hiring practices that facilitate Latinx students’ transition from campus to career. Employers have traditionally relied on three common sourcing practices, among others, to vet qualified students: GPA, major, and supplemental application material like cover letters and letters of recommendation.<\/p>\n\n\n\n<p>While these practices are perceived to add a layer of security for employers, not all qualified candidates have equal opportunity to fulfill these added requirements. Why? Because not all students have the same college journeys. If you want to diversify your workforce, start by adjusting your sourcing criteria and simplifying your application processes.<br><br>These components can be modified to accommodate all students—regardless of where they&#8217;re from, who they know, or which school they attend. In honor of <a href=\"https:\/\/www.census.gov\/newsroom\/facts-for-features\/2020\/hispanic-heritage-month.html\" target=\"_blank\" rel=\"noreferrer noopener\">National Hispanic Heritage Month<\/a>, which begins on September 15, we’re uncovering three common hiring practices that disadvantage Latinx talent, and what employers can do instead.<\/p>\n\n\n\n<h2>1. Broaden GPA requirements to source more qualified Latinx students<\/h2>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" width=\"752\" height=\"1024\" src=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_Infographic_1.jpg?resize=752%2C1024&#038;ssl=1\" alt=\"\" class=\"wp-image-4437\" srcset=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_Infographic_1.jpg?resize=752%2C1024&amp;ssl=1 752w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_Infographic_1.jpg?resize=220%2C300&amp;ssl=1 220w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_Infographic_1.jpg?resize=768%2C1045&amp;ssl=1 768w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_Infographic_1.jpg?resize=640%2C871&amp;ssl=1 640w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_Infographic_1.jpg?resize=1024%2C1394&amp;ssl=1 1024w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_Infographic_1.jpg?w=1080&amp;ssl=1 1080w\" sizes=\"(max-width: 752px) 100vw, 752px\" data-recalc-dims=\"1\" \/><\/figure><\/div>\n\n\n\n<p>When employers filter for GPA criteria, they end up overlooking and <strong>unintentionally excluding nearly 1.25x Latinx candidates from their ideal talent list<\/strong>. Handshake’s network data found that, while more than half of non-Latinx student applications submitted have a GPA above a 3.5, the same is true for only 4 in 10 of Latinx student applications submitted.<br><br>Equity isn’t exclusive to GPA. Similar to what we found in <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/3-hiring-practices-that-disadvantage-black-students\/\" target=\"_blank\" rel=\"noreferrer noopener\">hiring practices that disadvantage Black students<\/a>, inaccess to equity permeates all facets of life. Latinxs may be headed to college in historic numbers, but consistent with other immigrant and underrepresented groups, <a href=\"https:\/\/journals.sagepub.com\/doi\/pdf\/10.1177\/1536504216648148\" target=\"_blank\" rel=\"noreferrer noopener\">second, third, fourth generations fare better<\/a> than the first when it comes to educational attainment.<\/p>\n\n\n\n<h6>University spotlight: <a href=\"https:\/\/edsource.org\/2020\/latino-students-make-up-largest-ethnic-group-of-students-admitted-to-uc\/636230\" target=\"_blank\" rel=\"noreferrer noopener\">The University of California offered a record number of Latinx students admission<\/a> to its nine undergraduate campuses this fall. Latinx students now comprise UC&#8217;s largest ethnic group of admitted freshmen.<\/h6>\n\n\n\n<p>The significant increase in Latinxs attending US schools—<a href=\"https:\/\/www.usatoday.com\/in-depth\/news\/nation\/2020\/01\/06\/more-hispanic-students-than-ever-go-college-but-cost-high\/2520646001\/\" target=\"_blank\" rel=\"noreferrer noopener\">nearly half of whom are the first in their family to go to college<\/a>—may explain the trends correlated with the rising number of Latinxs attending college. But what about the college achievement gap?<\/p>\n\n\n\n<p>When it comes to school, the main challenge for Latinx students comes with balancing providing financial assistance for their families with the importance those families place on attaining a postsecondary college degree, <a href=\"https:\/\/www.pewresearch.org\/fact-tank\/2016\/07\/28\/5-facts-about-latinos-and-education\/\" target=\"_blank\" rel=\"noreferrer noopener\">according to Pew Research Center<\/a>. In a National Journal poll, 66% of Latinxs who got a job directly after high school cited the need to help support their family as a reason for not enrolling in college, compared to only 39% of white students.&nbsp;<\/p>\n\n\n\n<p>Other factors that contribute to the achievement gap include accountability and tracking measures, English language proficiency standards, and lower expectations from educators, <a href=\"https:\/\/search.proquest.com\/openview\/41533c2005d65b5076f7913dbf97731e\/1?pq-origsite=gscholar&amp;cbl=18750&amp;diss=y\" target=\"_blank\" rel=\"noreferrer noopener\">according to a report from The University of Texas at San Antonio<\/a>.<\/p>\n\n\n\n<p>This narrative trickles down to each student’s ability to complete required coursework and attain a competitive GPA while fulfilling pressing needs from their family. Latinxs are also more likely to attend school part-time, fueling the notion that college isn’t an exclusively on-campus experience.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;As a first-generation Latinx student, my struggles didn’t stop after applying to college. I was never in a position where I could ask my parents nor a direct source about how to navigate the college process nor the job process.&nbsp;<br><br>I am learning as I go and often feel behind compared to others. As someone who is going to school full-time while working part-time, it’s hard to juggle everything especially this being my senior year.&nbsp;<br><br>What I ask employers to do is take a chance on someone, people are way more than supplemental materials that they fill out during an application process—I can’t fit everything I do into a one-page resume but I do assure you if you talk to me, I will leave you more than impressed.&#8221;<\/p><cite>—Alejandra Alvarez, senior at Wake Forest University<\/cite><\/blockquote>\n\n\n\n<h2>2. Map your partner schools, roles, and requirements to meet Latinx student&#8217;s aspirations<\/h2>\n\n\n\n<p>Community colleges in America serve as <a href=\"https:\/\/opensiuc.lib.siu.edu\/cgi\/viewcontent.cgi?article=1036&amp;context=ojwed\" target=\"_blank\" rel=\"noreferrer noopener\">a primary entry point for aspiring Latinx graduates<\/a>, partially because they’re more affordable, more representative, and allow for the flexibility often required of part-time work and family life. Understanding where Latinx candidates go to school can help employers expand their core school network to incorporate more of the community colleges and minority-serving institutions these students attend.&nbsp;<br><br>Online early talent networks like Handshake make it easy for employers to connect with new schools where they haven’t recruited before. Handshake partners with over 100 hispanic- serving institutions—<a href=\"https:\/\/www.ednc.org\/latinx-student-success-at-north-carolinas-community-colleges\/\" target=\"_blank\" rel=\"noreferrer noopener\">the fastest growing minority-serving institution designation in the country<\/a>—and 70 community colleges across the country and growing.<\/p>\n\n\n\n<h6>Employers that are taking advantage of these digital platforms, like Handshake Premium partner <a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake_KraftHeinz_CaseStudy.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Kraft Heinz<\/a>, for example, noticed a <strong>1.8x increase in qualified Latinx applicants <\/strong>after expanding their school network from a handful near their HQ to over 50 nationwide.<\/h6>\n\n\n\n<p>Beyond broadening their school network, employers may fuel candidate mismatch by misattributing the required qualifications in an open role (i.e. computer science major) with underrepresented majors. Simply put, you can’t go fishing in the desert—you have to go where the fish are.<\/p>\n\n\n\n<p>To put that simplified analogy into context, check out these over and underrepresented Latinx majors on Handshake over the past year (as compared to non-Latinx students):<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" width=\"649\" height=\"1024\" src=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_2-1.jpg?resize=649%2C1024&#038;ssl=1\" alt=\"\" class=\"wp-image-4433\" srcset=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_2-1.jpg?resize=649%2C1024&amp;ssl=1 649w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_2-1.jpg?resize=190%2C300&amp;ssl=1 190w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_2-1.jpg?resize=768%2C1212&amp;ssl=1 768w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_2-1.jpg?resize=974%2C1536&amp;ssl=1 974w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_2-1.jpg?resize=640%2C1010&amp;ssl=1 640w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_2-1.jpg?resize=1024%2C1616&amp;ssl=1 1024w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_2-1.jpg?w=1080&amp;ssl=1 1080w\" sizes=\"(max-width: 649px) 100vw, 649px\" data-recalc-dims=\"1\" \/><\/figure><\/div>\n\n\n\n<p>As a result, Latinx candidates applied to admin support, receptionist, secretary, assistant, and tutor roles proportionally <em>more<\/em> than any other group, while software developer, data scientist, and investment analyst roles received proportionally <em>less<\/em> Latinx applicants than any other group. If you’re having trouble finding a Latinx engineer, now you know why.<\/p>\n\n\n\n<p>What’s troubling here is that despite many Latinx students being the first in their family to attend college and have a fair shake at upward mobility, Latinx candidates are still disproportionately applying to jobs that don’t require a college degree to perform.<br><br>Employers can upend this cycle by providing qualified students from underrepresented backgrounds with a weeks-long bootcamp to convert them into technical roles.<\/p>\n\n\n\n<h6><a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake_UnderArmour_CaseStudy.pdf?utm_medium=email&amp;utm_source=emp_demandgen&amp;utm_campaign=7011Q000001BCNN&amp;utm_content=under_armour_case_study&amp;mkt_tok=eyJpIjoiTnpJME1qUm1aRGc1WlRBMiIsInQiOiJqWk1QSW9sanhHUldsZGJWNEIrV1hCTUNIVVJLaTlhZlk4ODFmXC80d2ZyQlwvRm1pVlZDeG81THlcL1wvTkE4djhcLzJpK3JYXC84aHVvS1NzVnVcL3lFSERIR2c9PSJ9\" target=\"_blank\" rel=\"noreferrer noopener\">Under Armour&#8217;s Rookie Program<\/a> provides rising graduates with mentorship opportunities, inspiring guest speakers, and volunteer programs. <br><br>By expanding their school network from a dozen in the mid-Atlantic to nearly 500 nationwide, the athletic apparel-maker diversified their apprenticeship class to include more students from more underrepresented groups.<\/h6>\n\n\n\n<p>Understanding the barriers to equal educational attainment can inspire employers to look for qualified Latinx students at the schools they actually attend, and create programs that support them in their progression from non-technical backgrounds to technical roles.<\/p>\n\n\n\n<h2>3. Be more transparent about compensation and unblock added documentation<\/h2>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" width=\"1024\" height=\"816\" src=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_3.jpg?resize=1024%2C816&#038;ssl=1\" alt=\"\" class=\"wp-image-4712\" srcset=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_3.jpg?resize=1024%2C816&amp;ssl=1 1024w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_3.jpg?resize=300%2C239&amp;ssl=1 300w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_3.jpg?resize=768%2C612&amp;ssl=1 768w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_3.jpg?resize=640%2C510&amp;ssl=1 640w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_3.jpg?w=1080&amp;ssl=1 1080w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" data-recalc-dims=\"1\" \/><\/figure><\/div>\n\n\n\n<p>Similar to our findings around GPA criteria, Latinx students, especially first-generation Latinx students, are likely going into the application process with less foundational knowledge about the college journey from their parents and their parent’s networks.<\/p>\n\n\n\n<p>Generation status or length of time in the US has been linked to low educational attainment. And families with higher socioeconomic status and education levels <a href=\"https:\/\/opensiuc.lib.siu.edu\/cgi\/viewcontent.cgi?article=1036&amp;context=ojwed\" target=\"_blank\" rel=\"noreferrer noopener\">are more likely to help their children make the right choices<\/a> when navigating the tertiary education system.<\/p>\n\n\n\n<p>Latinxs are more likely to have immigrated to the US than any other underrepresented group, and currently, about 70% of Latinx undergraduates in higher education come from families in the bottom half of earners, according to the <a href=\"https:\/\/1xfsu31b52d33idlp13twtos-wpengine.netdna-ssl.com\/\/srv\/htdocs\/wp-content\/uploads\/2019\/02\/Race-and-Ethnicity-in-Higher-Education.pdf?_ga=2.102322625.1993222641.1599152504-447351854.1597008923\" target=\"_blank\" rel=\"noreferrer noopener\">American Council on Education<\/a>.<\/p>\n\n\n\n<p>Navigating the application for your first job is already a challenge for many, so not having solid emotional or financial support from the people you hold dear can contribute to the never-ending systemic cycles of educational inequality Latinx students tend to face.<\/p>\n\n\n\n<p>Due to part-time work, Latinx students are also more likely to get stuck or not have enough time to perfect the application process. This can lead to an inability to submit supplemental application material like cover letters, transcripts, work samples, and recommendation letters because they have more going on in their lives than just coursework.<\/p>\n\n\n\n<p>Additional documentation may be considered worthwhile for cutting down resume volume and weeding out unqualified candidates when comparing apples to apples, but that’s simply not the case here. We have an antiquated recruiting system designed to create stumbling blocks for underrepresented groups that have already had to overcome the hurdles associated with getting to college.<\/p>\n\n\n\n<p>Bottom line is, the more information employers can disclose in their job criteria, the more applications they’re likely to receive from Latinx students and other underrepresented groups.<\/p>\n\n\n\n<h6>When one of the world’s leading pharmaceutical companies, Amgen, expanded their qualified search criteria beyond GPA, broadened their school network, and personalized their recruitment model, they were able to <strong>increase applicants from Latinx candidates by 4.5x<\/strong> from 2017 to 2019. Learn how they did it <a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake_Amgen_CaseStudy.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>.<\/h6>\n\n\n\n<h2>Closing thoughts<\/h2>\n\n\n\n<p>How does America’s diversity mirror the makeup of your workforce? How about the diversity of your customers? Does your workforce reflect your advocates—the people who make your business so successful? And if not, what could you do to attract more underrepresented candidates that align with your mission, fuel innovation, and fulfill job requirements?<\/p>\n\n\n\n<p>These Handshake insights offer a good start, but it’s up to employers to ensure they’re creating programs that recognize and address the unique discrepancies associated with elevating underrepresented groups throughout their careers—not just at the entry level, but with pathways for progression all the way up to the C-suite. After all, your future leaders are counting on you to make the right decision to hire the best talent today.<\/p>\n\n\n\n<h2>Methodology<\/h2>\n\n\n\n<p>We reviewed network activity data from Handshake’s 6M+ active students across 1K+ partner schools including 180+ minority-serving institutions and Hispanic-Serving Institutions (HSIs) and 150+ student groups like the Society of Hispanic Professional Engineers (SHPE).<\/p>\n\n\n\n<p>Learn how to tap into qualified Latinx students on the largest early talent network.<\/p>\n\n\n\n<h2 class=\"has-text-align-center\"><span style=\"color:#ff1100\" class=\"has-inline-color\"><a href=\"https:\/\/joinhandshake.com\/employers\/request-more-info\/\" target=\"_blank\" rel=\"noreferrer noopener\">Request More Info ><\/a><\/span><\/h2>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>GPA filters and cover letters won&#8217;t cut it. Here&#8217;s what to look for instead.<\/p>\n","protected":false},"author":167034975,"featured_media":4436,"menu_order":0,"template":"","employers_category":[1412],"employers_tag":[1438,1439],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Want More Latinx Candidates? Try these 3 Hiring Strategies<\/title>\n<meta name=\"description\" content=\"GPA criteria, mismatched majors, and cover letters disqualify more Latinx students. Here&#039;s what employers should look for instead.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Want More Latinx Candidates? Try these 3 Hiring Strategies\" \/>\n<meta property=\"og:description\" content=\"GPA criteria, mismatched majors, and cover letters disqualify more Latinx students. Here&#039;s what employers should look for instead.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2020-10-14T17:48:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_BlogImage.jpg?fit=1440%2C960&#038;ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1440\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"width\":1440,\"height\":960,\"caption\":\"3 Hiring Practices that Disadvantage Latinx Talent\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/\",\"name\":\"Want More Latinx Candidates? Try these 3 Hiring Strategies\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#primaryimage\"},\"datePublished\":\"2020-09-14T20:46:12+00:00\",\"dateModified\":\"2020-10-14T17:48:29+00:00\",\"description\":\"GPA criteria, mismatched majors, and cover letters disqualify more Latinx students. Here's what employers should look for instead.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Want More Latinx Candidates? Try these 3 Hiring Strategies\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Want More Latinx Candidates? Try these 3 Hiring Strategies","description":"GPA criteria, mismatched majors, and cover letters disqualify more Latinx students. Here's what employers should look for instead.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/","og_locale":"en_US","og_type":"article","og_title":"Want More Latinx Candidates? Try these 3 Hiring Strategies","og_description":"GPA criteria, mismatched majors, and cover letters disqualify more Latinx students. Here's what employers should look for instead.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2020-10-14T17:48:29+00:00","og_image":[{"width":1440,"height":960,"url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_BlogImage.jpg?fit=1440%2C960&ssl=1","path":"\/srv\/htdocs\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_BlogImage.jpg","size":"full","id":4436,"alt":"3 Hiring Practices that Disadvantage Latinx Talent","pixels":1382400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_BlogImage.jpg?fit=1440%2C960&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_3HiringPracticesThatDisadvantageLatinxTalent_BlogImage.jpg?fit=1440%2C960&ssl=1","width":1440,"height":960,"caption":"3 Hiring Practices that Disadvantage Latinx Talent"},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/","name":"Want More Latinx Candidates? Try these 3 Hiring Strategies","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#primaryimage"},"datePublished":"2020-09-14T20:46:12+00:00","dateModified":"2020-10-14T17:48:29+00:00","description":"GPA criteria, mismatched majors, and cover letters disqualify more Latinx students. Here's what employers should look for instead.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Want More Latinx Candidates? Try these 3 Hiring Strategies"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/4395"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/4436"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=4395"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=4395"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=4395"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}