{"id":4626,"date":"2020-10-05T10:36:52","date_gmt":"2020-10-05T17:36:52","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=4626"},"modified":"2020-10-05T10:36:53","modified_gmt":"2020-10-05T17:36:53","slug":"keeping-your-employer-brand-relevant-in-times-of-transition","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/","title":{"rendered":"Keeping your Employer Brand Relevant in Times of Transition"},"content":{"rendered":"\n<p>At-home mandates, limited social interactions, and a completely new way of living have made it difficult to imagine what life will be like post-pandemic. But with an end in sight, organizations need to start preparing now for what the world of work will look like after COVID-19. Are you prepared?<\/p>\n\n\n\n<p>Imagine that it’s 2021 and the economy is slowly recovering from the previous year’s pandemic. People are gradually returning to the office and things are starting to feel a bit more normal. You’re ready to start hiring again but discover that your qualified talent pipeline is almost empty. Why? You neglected your employer brand—and potential candidates took notice.<\/p>\n\n\n\n<p>Much like in good times, during a downturn, candidates still want to know what it’s like to work at your company. “[They] are going to remember which employers rose to the occasion and how companies managed and led through this crisis,” explains Director of Employer Brand at Recruitics, Jillian Einck. “Doing things that are not seen as people-centric during this time will have a detrimental impact to both consumers and [your] <a href=\"https:\/\/www.shrm.org\/resourcesandtools\/hr-topics\/talent-acquisition\/pages\/managing-employer-brand-during-covid19-outbreak.aspx#:~:text=The%20COVID%2D19%20pandemic%20has,playbook%20for%20this%20unprecedented%20time.&amp;text=%22Doing%20things%20that%20are%20not,both%20consumer%20and%20employer%20brand.%22\" target=\"_blank\" rel=\"noreferrer noopener\">employer brand<\/a>.&#8221;<\/p>\n\n\n\n<p>Did you lay off employees? Did you help employees find part-time jobs if they were laid off? Top talent want to know that you took care of your employees’ mental health and well-being during tough times. Did you come up with <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/creative-ways-to-make-your-virtual-internship-a-success\/\" target=\"_blank\" rel=\"noreferrer noopener\">creative solutions like virtual internships<\/a> or was your ultimate solution to cancel internships and freeze hiring? These are things candidates look at when evaluating your employer brand.<\/p>\n\n\n\n<p>If you take care of your employer brand throughout the pandemic, you may have a full pipeline of excited, eager, and qualified candidates knocking on your door—ones who value what your organization stands for. Let’s explore how you can come out of the pandemic with a strong employer brand.<\/p>\n\n\n\n<h2>What is an employer brand?<\/h2>\n\n\n\n<p>Simply put, your employer brand is <a href=\"https:\/\/www.accountingtoday.com\/opinion\/the-importance-of-employer-branding-during-a-crisis\" target=\"_blank\" rel=\"noreferrer noopener\">a reflection of your brand in the workplace<\/a>. While your corporate brand is how customers view your organization, <a href=\"https:\/\/go.joinhandshake.com\/Virtual-Employer-Branding-Guide.html?_ga%3D2.240646723.1150136018.1600699863-83293930.1598563285&amp;sa=D&amp;ust=1601407213123000&amp;usg=AFQjCNE-JQ1ylAE-d6uDYA9E_oSbMgESwg\" target=\"_blank\" rel=\"noreferrer noopener\">your employer brand is how <em>prospective talent<\/em> views you<\/a>. Your organization likely strives to be a great place to work in good times, but it’s even more crucial you execute employer branding strategies in tough times. Here’s why:<br><br>Digital platforms like Handshake make it easy for employees to share their thoughts about working for your organization, but even easier for job seekers to check you out before applying to work for your company. Gen Z—who are currently entering the workforce—are <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/handshakes-2019-campus-to-career-report\/\" target=\"_blank\" rel=\"noreferrer noopener\">much more mission-focused than previous generations<\/a> and can easily access these review sites. If you’ve neglected your employer brand or are struggling with COVID-19, it may be reflected in online reviews.<\/p>\n\n\n\n<h6>Tip: With Handshake Premium, display dynamic testimonials on your Employer Page that highlight how much your interns enjoyed working with you, why your employees stick around, and positive experiences ambassadors have had with your company.<\/h6>\n\n\n\n<h2>How to create or maintain a positive employer brand<\/h2>\n\n\n\n<p>We all try to do our best in both good and bad times, but COVID-19 threw a curveball at everyone. With companies still discovering new ways to virtually engage with candidates and employees, it can be easy to set your employer brand aside. However, by doing this, you risk your reputation with employees and future hires. Instead, try some of these strategies to create an employer brand that draws talent in and retains current employees.<\/p>\n\n\n\n<h4>1. Protect your employees’ emotional well-being<\/h4>\n\n\n\n<p>Along with <a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/2020-09%20student%20shift%20to%20virtual%20infographic.pdf?_ga=2.30887801.75400340.1600538755-83293930.1598563285\" target=\"_blank\" rel=\"noreferrer noopener\">the stress that comes with a pandemic<\/a> comes a fear of losing your job and income, anxiety about not being able to leave the house, isolation, adjusting to kids being home, and so much more. Show your employees you understand and that you genuinely care by putting them first.<\/p>\n\n\n\n<p>Many organizations are suspending raises and bonuses, cutting leadership salaries, and reducing benefits across the organization to prevent layoffs. When you take this approach, it “sends a message to employees that right now everyone at every level in the organization is sacrificing for the greater good,” explains <a href=\"https:\/\/www.gartner.com\/smarterwithgartner\/hrs-covid-19-response-defines-employer-brand\/\" target=\"_blank\" rel=\"noreferrer noopener\">Gartner<\/a>. You’re showing your individual contributors and managers that they matter just as much as the C-suite.<\/p>\n\n\n\n<p>You should also acknowledge your frontline workers—doctors, nurses, delivery drivers, fast food workers, and more—for everything they’re doing. These essential workers are putting their health on the line to keep your business running. Show your appreciation and dedication to employees by offering hazard pay or a cash bonus. Verbal acknowledgment (on top of these offerings) is also a good place to start.<br><br>Maybe your employees are working from home while balancing online school for their kids. In addition to recognizing that this is a unique but exhausting situation, Gartner suggests giving employees flexibility with working hours, creating employee resource groups (ERGs) to support each other, and offering stipends to help with unforeseen expenses.<\/p>\n\n\n\n<p>Here at Handshake, our Parent Community shipped every parent a summertime box chock-full of family-friendly toys and games to help them keep their kids engaged throughout the warm months.<\/p>\n\n\n\n<h6>Tip: Did you know you can share photos, documents, and videos on your Handshake Employer page? Share a personalized video of the CEO thanking employees for their work, create a guide for working from home, or even have a doctor record a video with tips to stay mentally and physically healthy during the pandemic. These are all great ways to show employees you care and boost your employer brand.<\/h6>\n\n\n\n<h4>2. Protect your employees’ financial well-being<\/h4>\n\n\n\n<p>Imagine not knowing whether you’re going to be able to pay your bills next month and constantly stressing over your financial situation. While this may be a reality for many employees who have been laid off, it doesn’t have to be. As an organization, you can help employees through tough financial times, even if you had to lay them off.<br><br>A few giants in the retail, fast food, and tech industries have set the bar when it comes to their employees (who have been essential workers throughout the pandemic). Instead of cutting pay or letting employees go, they kept their employees and added on temporary subcontractors to help those who lost their jobs or needed to supplement income because of COVID-related financial hardships. It shows that they not only cared about their employees but that they were also going to do everything to ensure financial security in these trying times.<br><br>Other companies partnered with organizations that suddenly had a higher demand for workers, like grocery stores and hospitals, to connect people with short-term work. Gartner explained the process: short-term contractors were hired quickly and allowed to return to their original jobs when business picked up again.<br><br>If your business isn’t considered to be essential, you can still build your employer brand and show you care by offering short-term internships. According to <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/report-how-covid-19-is-impacting-college-recruiting\/\" target=\"_blank\" rel=\"noreferrer noopener\">Handshake&#8217;s COVID-19 report<\/a>, students are very open to part-time contracts, freelance, or gig work. In fact, <strong>70% of students surveyed would consider a job in the gig economy<\/strong>. This is your opportunity to support new talent and create a memorable employer brand for your interns or contractors.<\/p>\n\n\n\n<h4>3. Support your remote and frontline workers <\/h4>\n\n\n\n<p>With social distancing practices in place and growing concern over health, companies have decided to take their teams remote. While this sounds like a great idea in theory, it can be a stressful transition for your employees. Ease their minds by providing proper support.<\/p>\n\n\n\n<p>Do you have an IT team ready to help workers set up their home offices? Are you using a collaboration tool like Slack to keep team members connected and projects moving? Ensure you have everything your employees need to be successful remotely.<\/p>\n\n\n\n<p>With remote work comes a lot of video meetings, which means potential “<a href=\"https:\/\/hbr.org\/2020\/04\/how-to-combat-zoom-fatigue#:~:text=Finally%2C%20%E2%80%9CZoom%20fatigue%E2%80%9D%20stems,to%20look%20at%20the%20camera.&amp;text=This%20is%20because%20having%20to,makes%20us%20uncomfortable%20%E2%80%94%20and%20tired.\" target=\"_blank\" rel=\"noreferrer noopener\">Zoom fatigue<\/a>.” This phenomenon causes us to become quickly drained after countless video meetings. Harvard Business Review explains it as such: <\/p>\n\n\n\n<p>Zoom meetings force us to focus more intently on conversations in order to absorb information. When you’re sitting in a conference room, you can rely on whispered side exchanges to catch you up if you get distracted. During a video call, however, it’s impossible to do this unless you use the private chat feature or awkwardly try to find a moment to unmute and ask a colleague to repeat themselves.<\/p>\n\n\n\n<p>Another problem is that videoconferencing causes us to multitask. Yes, we can check email, talk with team members on chat, and listen to the call all at once&#8230;in theory. In actuality, we rarely listen when we do this. Be patient with employees who are trying to balance meetings with kids being home or struggling with distractions. Encourage them to take a walk, cook a meal, or participate in a team activity to break up the day and ensure mental well-being.<\/p>\n\n\n\n<h4>4. Overcommunicate<\/h4>\n\n\n\n<p>Nothing makes an uncertain situation worse than a lack of communication, so make sure you are being fully communicative with your employees. With more and more employees posting reviews, it’s important that your communication reflects positively on your employer brand.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;There&#8217;s been an over 70 percent increase in Glassdoor reviews mentioning layoffs. We know that this is a given right now, and candidates and employees understand that. They know that business has changed, and revenue is down for a lot of industries—it&#8217;s really more about how employers are reacting to those challenges, how they handled the layoffs, as opposed to the decision to conduct the layoffs.”<\/p><cite>—Jillian Einck, Director of Employer Brand at Recruitics<\/cite><\/blockquote>\n\n\n\n<p>You can partner with your communications and marketing team to build a solid relationship with your employees during the pandemic. Lori Sylvia, founder of Rally Recruitment Marketing, suggests communicating how you’re handling the pandemic both internally and externally, from one voice. <br><br>This includes updating job listings, pointing people to careers pages, making them aware of your hiring process, and working with HR to create a back to work plan and announcement. Be sure to include what safety precautions you’ll have in place and how employees will transition back to the office.<\/p>\n\n\n\n<p>Set the right tone. Rian Finnegan, senior manager of employer brand and recruitment marketing at Instacart, wanted to be conscientious when communicating that they’re hiring. Instead of celebrating hiring, they chose to build on the pride their employees felt being essential workers.<\/p>\n\n\n\n<h4>5. Show talent what your employer brand is all about<\/h4>\n\n\n\n<p>What better way to show candidates what it’s like to work with your company than to give them an inside look? Alumni, ambassadors, department leads, and other employees are all great ways to put your culture—and employer brand—on display.<br><br>Handshake Premium partners can highlight dynamic testimonials from these groups on their Employer Page, and take their efforts a step further by using Campaigns to send personalized outreach. Their outreach can even include an <a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake_Ambassadors_Datasheet.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">introduction to ambassadors on Handshake<\/a>.<\/p>\n\n\n\n<p>Our COVID-19 student report confirms the need for this kind of communication. Students and alumni are looking to employers to reach out with open roles and updates on hiring. Students want to engage with employers, whether it’s through a Campaign message or during a virtual event.<\/p>\n\n\n\n<p>Remember, your employer brand isn’t limited to your profile or reviews. It includes how you interact with people to create meaningful experiences. Are you ambassadors warm and friendly? Are they excited about working with you? Then they’re the perfect people to connect with candidates!<br><br>Beyond your ambassadors and employees, you too can <em>show <\/em>your employer brand in action. For example,<a href=\"https:\/\/techcrunch.com\/2020\/04\/17\/gm-delivers-first-ventilators-under-30000-unit-government-contract\/\" target=\"_blank\" rel=\"noreferrer noopener\"> GM partnered with Ventec Life Systems at the beginning of the pandemic to create ventilators<\/a>. These were in high-demand and, instead of focusing solely on themselves, GM shifted focus to support the fight against the novel coronavirus. GM <em>showed <\/em>that they were a mission-focused company, which will likely positively impact their employer brand and make them more desirable to mission-driven Gen Z.<\/p>\n\n\n\n<h2>Your employer brand after the pandemic<\/h2>\n\n\n\n<p>Your organization’s employer brand has always been important, but now more than ever, it’s crucial that you take care of it. Words on paper are one thing, but how your company is treating its employees, customers, and community during this critical time <a href=\"https:\/\/www.shrm.org\/resourcesandtools\/hr-topics\/talent-acquisition\/pages\/managing-employer-brand-during-covid19-outbreak.aspx#:~:text=The%20COVID%2D19%20pandemic%20has,playbook%20for%20this%20unprecedented%20time.&amp;text=%22Doing%20things%20that%20are%20not,both%20consumer%20and%20employer%20brand.%22\" target=\"_blank\" rel=\"noreferrer noopener\">defines your employer brand<\/a>. <\/p>\n\n\n\n<p>Sylvia highlights the importance of investing in your employer brand and the lasting effects it will have on “your company&#8217;s culture, your reputation and your ability to attract, recruit, and retain talent today and in the future.” Want top talent? Invest in your employer brand.<\/p>\n\n\n\n<p>You’ll undoubtedly <a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake_CampusRecruitingTeamOfTheFuture.pdf?utm_medium=email&amp;utm_source=emp_demandgen&amp;utm_campaign=FY20Q3-EMP-AMER-EM-BLAST-September-Core-Decision-Maker-Newsletter&amp;utm_content=campus_recruiting_team_of_the_future&amp;mkt_tok=eyJpIjoiT1RFd01UUmhOek5rT0RBeSIsInQiOiJ6cFFOaDNOcWVzQ1JPdEgyaHhZQ09yY0NNY0lwZWRJNGFYR3UxTHkyNnFvc1F6bTVObHNLS29vU212eGVURWIxS1ZSRFZEMnpOV2pFVG5JZnJoeWo4Zz09In0%3D\" target=\"_blank\" rel=\"noreferrer noopener\">work with your marketing and communications team<\/a> to create an employer brand strategy, but you can also utilize Handshake to build a great reputation with future candidates. Use your Employer Page to display testimonials from ambassadors, employees, and interns and write out your mission statement—including a COVID-19 response statement—that highlights your purpose and why someone would want to work with you today and in the future.&nbsp;<\/p>\n\n\n\n<p>But how will you know if your efforts are paying off? You can continually gauge your performance through Handshake page views, job applications, and engagement with your campaigns.<\/p>\n\n\n\n<p>These are all great indicators, but what better way to know how employees and candidates view your organization than to ask them directly? You could send a survey with questions that help express sentiment, like “What attracts you to working with our company?” or “Do you enjoy engaging with our business?” You can also ask specific questions, like “After viewing our Employer Page, did you take any action?” or “How familiar are you with our company?” You’ll want to send before and after surveys to see if your employer brand strategies are working.&nbsp;<\/p>\n\n\n\n<p>The only question left is: want to build an incredible employer brand?<\/p>\n\n\n\n<h2 class=\"has-text-align-center\"><a href=\"https:\/\/joinhandshake.com\/employers\/request-more-info\/?utm_medium=email_nurture&amp;utm_source=emp_demandgen&amp;utm_campaign=FY20Q3-EMP-AMER-EM-NURT-Office-Hours-Nurture&amp;utm_content=candidate%20_evaluation&amp;mkt_tok=eyJpIjoiTXpSbE9Ea3hPREJtT1ROayIsInQiOiJoa3dWalk0eVBpdWN1c0N4UjAwMXhlZmRaenp4NWFpNktITXNNcXY2NWY2VDNOOHQ4YTg0VE5OVEVDc2hYaWYrOW9HR25jMjNoM0xGcnZBaUhaYXVIZz09In0%3D&amp;restored=1599851959305\" target=\"_blank\" rel=\"noreferrer noopener\">Let&#8217;s help you get started<\/a><\/h2>\n","protected":false},"excerpt":{"rendered":"<p>Learn how to create an employer brand that resonates with students during trying times.<\/p>\n","protected":false},"author":167034975,"featured_media":4640,"menu_order":0,"template":"","employers_category":[1413],"employers_tag":[1459,1440],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Keeping your Employer Brand Relevant in Times of Transition<\/title>\n<meta name=\"description\" content=\"Want to maintain a qualified talent pipeline? Stay relevant and engaged with students by building a strong employer brand.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Keeping your Employer Brand Relevant in Times of Transition\" \/>\n<meta property=\"og:description\" content=\"Want to maintain a qualified talent pipeline? Stay relevant and engaged with students by building a strong employer brand.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2020-10-05T17:36:53+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_KeepingYourEmployerBrandRelevant_BlogImage.jpg?fit=1440%2C960&#038;ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1440\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_KeepingYourEmployerBrandRelevant_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_KeepingYourEmployerBrandRelevant_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"width\":1440,\"height\":960},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/\",\"name\":\"Keeping your Employer Brand Relevant in Times of Transition\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#primaryimage\"},\"datePublished\":\"2020-10-05T17:36:52+00:00\",\"dateModified\":\"2020-10-05T17:36:53+00:00\",\"description\":\"Want to maintain a qualified talent pipeline? Stay relevant and engaged with students by building a strong employer brand.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Keeping your Employer Brand Relevant in Times of Transition\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Keeping your Employer Brand Relevant in Times of Transition","description":"Want to maintain a qualified talent pipeline? Stay relevant and engaged with students by building a strong employer brand.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/","og_locale":"en_US","og_type":"article","og_title":"Keeping your Employer Brand Relevant in Times of Transition","og_description":"Want to maintain a qualified talent pipeline? Stay relevant and engaged with students by building a strong employer brand.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2020-10-05T17:36:53+00:00","og_image":[{"width":1440,"height":960,"url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_KeepingYourEmployerBrandRelevant_BlogImage.jpg?fit=1440%2C960&ssl=1","path":"\/srv\/htdocs\/wp-content\/uploads\/2020\/09\/HS_KeepingYourEmployerBrandRelevant_BlogImage.jpg","size":"full","id":4640,"alt":"","pixels":1382400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_KeepingYourEmployerBrandRelevant_BlogImage.jpg?fit=1440%2C960&ssl=1","contentUrl":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/09\/HS_KeepingYourEmployerBrandRelevant_BlogImage.jpg?fit=1440%2C960&ssl=1","width":1440,"height":960},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/","name":"Keeping your Employer Brand Relevant in Times of Transition","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#primaryimage"},"datePublished":"2020-10-05T17:36:52+00:00","dateModified":"2020-10-05T17:36:53+00:00","description":"Want to maintain a qualified talent pipeline? Stay relevant and engaged with students by building a strong employer brand.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/keeping-your-employer-brand-relevant-in-times-of-transition\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Keeping your Employer Brand Relevant in Times of Transition"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/4626"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/4640"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=4626"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=4626"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=4626"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}