{"id":4721,"date":"2020-10-14T12:27:05","date_gmt":"2020-10-14T19:27:05","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=4721"},"modified":"2020-10-14T12:48:58","modified_gmt":"2020-10-14T19:48:58","slug":"3-trends-impacting-women-in-stem-in-2020","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/","title":{"rendered":"3 Trends Impacting Women in STEM in 2020"},"content":{"rendered":"\n<p>The ongoing pandemic has disrupted how college students, including women in STEM (science, technology, engineering, and mathematics), have traditionally found and engaged with leading employers—mainly on campus. Not all students have been affected equally, with groups like women in STEM being impacted more significantly.<\/p>\n\n\n\n<p>When we published our <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/3-takeaways-from-handshakes-women-in-tech-report\/#:~:text=Handshake%20data%20shows%20that%2072,to%20the%20recruiting%20season%20before.\" target=\"_blank\" rel=\"noreferrer noopener\">Women in Tech report<\/a> last fall, we found that women in tech were applying beyond the biggest brands, were looking for support like mentorship from their future employers, and weren’t necessarily majoring in computer science. While these sentiments largely remain the same, a lot has changed in the face of COVID-19.<br><br>As a result, an impending threat to true workplace equity for women in STEM looms.<\/p>\n\n\n\n<p>Despite more women rising to the top of companies over the past five years, employers are at risk of losing women in leadership roles due to COVID-19. Since the start of the pandemic, women have been <a href=\"https:\/\/www.usatoday.com\/story\/news\/politics\/2020\/10\/11\/865-000-women-were-laid-off-last-month\/3609016001\/\" target=\"_blank\" rel=\"noreferrer noopener\">more likely to voluntarily leave the workforce or get laid off<\/a>—either due to child care responsibilities or as a result of working in the hardest-hit industries.<\/p>\n\n\n\n<p>Not all is lost, however. While COVID-19 led to job loss, remote work has reduced the need for location-based hiring. And because employers can now increasingly find and employ talent anywhere, the unprecedented scale of remote work has the potential to level the gender equality gap.<\/p>\n\n\n\n<p>Activity on Handshake revealed that <strong><em>1.4x more women in tech<\/em><\/strong> attended virtual events this year than in-person events last year. The barrier to entry and time commitment is obviously much lower than an in-person event. But so is the intimidation factor. Students can now more easily meet with choice employers one-on-one from the comfort of their own homes. The future remains promising with technology leading the change.<br><br>Employers will be able to hire anyone from anywhere, as opposed to limiting their recruiting to specific regions. According to <a href=\"https:\/\/womenintheworkplace.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Lean In’s 2020 Women in the Workplace report<\/a>, companies are already anticipating these benefits, with <strong>70% saying that they think remote work will allow them to increase diversity in their hiring<\/strong>.<\/p>\n\n\n\n<p>To understand how technology is impacting opportunities for women in STEM, particularly in the aftermath of the pandemic, let’s examine three recent findings based on activity from Handshake’s network of 7M+ students, 1.1K+ partner schools, and 500K employers.<\/p>\n\n\n\n<h2>1. Women in STEM are more represented in life sciences majors than engineering<\/h2>\n\n\n\n<p>When it comes to STEM degrees, women are proportionally <strong>more represented in life sciences majors like psychology and biology<\/strong> and <strong>proportionally less represented in majors like computer science and mechanical and electrical engineering<\/strong>.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" width=\"668\" height=\"1024\" src=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic1.jpg?resize=668%2C1024&#038;ssl=1\" alt=\"\" class=\"wp-image-4727\" srcset=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic1.jpg?resize=668%2C1024&amp;ssl=1 668w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic1.jpg?resize=196%2C300&amp;ssl=1 196w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic1.jpg?resize=768%2C1178&amp;ssl=1 768w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic1.jpg?resize=1002%2C1536&amp;ssl=1 1002w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic1.jpg?resize=640%2C981&amp;ssl=1 640w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic1.jpg?resize=1024%2C1570&amp;ssl=1 1024w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic1.jpg?w=1080&amp;ssl=1 1080w\" sizes=\"(max-width: 668px) 100vw, 668px\" data-recalc-dims=\"1\" \/><\/figure><\/div>\n\n\n\n<p>Consequently, women in STEM disproportionately apply more to administrative and customer service roles, and less to software developer and engineer roles. So why is it that women with STEM degrees are pursuing more clerical work and less technical roles despite their credentials?<br><br><a href=\"https:\/\/www.globalpolicyjournal.com\/blog\/10\/01\/2019\/women-stem-critical-innovation\" target=\"_blank\" rel=\"noreferrer noopener\">Study after study shows<\/a> that one cause for the disparity is the continued lack of pathways for entry or progression or mentors young women can aspire to. While employers have made gains in recent years, if you don’t have women in leadership positions at your organization, how can you expect to support your next generation of influential women?<br><br><a href=\"https:\/\/leanin.org\/mentor-her\" target=\"_blank\" rel=\"noreferrer noopener\">According to Lean In and SurveyMonkey<\/a>, <strong>62% of women of color say they believe a lack of mentorship holds them back in their career<\/strong> and women in corporate America are <strong>24% less likely than men to get advice from senior leaders<\/strong>.<br><br>With this information on hand, how can employers create programs that give qualified women a footing to pursue more technical roles at the entry level and nurture their progression all the way up to the C-suite?<br><br>Handshake Premium partners are elevating their teams to mentor future leaders by equipping department leads and individual contributors into <a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake_Ambassadors_Datasheet.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Virtual Ambassador roles<\/a>, where your colleagues, hiring managers, and department heads provide an inside look into your company to students who are aspiring to be in their roles.<\/p>\n\n\n\n<p>That&#8217;s exactly what <a href=\"https:\/\/go.joinhandshake.com\/Find-your-next-launch-summit-july-2020.html\" target=\"_blank\" rel=\"noreferrer noopener\">Goldman Sachs (GS)<\/a> did when they recruited analysts and leaders—both men and women—from a variety of teams to fulfill these roles. Thanks to the virtual landscape, the time commitment required of these colleagues is much lower than traveling on campus. These ambassadors could attend virtual career fairs and connect with students on Handshake to share their experience.<br><br>Following virtual events, students were able to reach out to GS’ ambassadors to learn more about their careers. As a result of the program, more women are being introduced to more careers in areas where they’re underrepresented.<\/p>\n\n\n\n<h2>2. Women in STEM apply to jobs earlier in college and earn higher GPAs than men<\/h2>\n\n\n\n<p>Activity on Handshake’s network found that women in STEM apply slightly earlier in their college journeys, with <strong>5% fewer women in STEM applying their senior year<\/strong> as compared to men in STEM. Meanwhile, they’re applying 3% more than men in STEM during their sophomore year, and 1% more in their freshmen and senior years.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" width=\"965\" height=\"1024\" src=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic2.jpg?resize=965%2C1024&#038;ssl=1\" alt=\"\" class=\"wp-image-4728\" srcset=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic2.jpg?resize=965%2C1024&amp;ssl=1 965w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic2.jpg?resize=283%2C300&amp;ssl=1 283w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic2.jpg?resize=768%2C815&amp;ssl=1 768w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic2.jpg?resize=640%2C679&amp;ssl=1 640w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic2.jpg?resize=1024%2C1087&amp;ssl=1 1024w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic2.jpg?w=1080&amp;ssl=1 1080w\" sizes=\"(max-width: 965px) 100vw, 965px\" data-recalc-dims=\"1\" \/><\/figure><\/div>\n\n\n\n<p>Employers that proactively engage qualified women during their freshmen, sophomore, and junior years are more likely to stand out with this cohort when they’re ready to apply for an internship or job post-college. This finding also gives way to our next takeaway: <strong>57% of student applications submitted from women on Handshake have above a 3.5 GPA<\/strong>; for men, that number falls to 51%.<br><br>We found the opposite to be true of other underrepresented groups like <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/3-hiring-practices-that-disadvantage-black-students\/\" target=\"_blank\" rel=\"noreferrer noopener\">Black<\/a> and <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/\" target=\"_blank\" rel=\"noreferrer noopener\">Latinx students<\/a>, likely because they’re the first in their family to go to college or have other commitments like part-time jobs. So why exactly do women have higher GPAs than their male counterparts? One reason is that women often need to work harder (and earlier) than men to prove themselves as qualified candidates.<br><br><a href=\"https:\/\/www.weforum.org\/agenda\/2018\/10\/women-are-more-productive-than-men-at-work-these-days\" target=\"_blank\" rel=\"noreferrer noopener\">According to Hive<\/a>, a productivity platform, women work 10 percent harder than men in today&#8217;s offices. Not only do women work more on average, the same study found that women are also assigned 55% of all work. Understanding this fact is critical to creating programs that reward women in STEM for being hard-working, not just in their respective roles but also by lighting the way for other women in the field.<br><br>Handshake Premium partner <a href=\"https:\/\/www.rtx.com\/en\/News\/2020\/07\/28\/women-in-engineering\" target=\"_blank\" rel=\"noreferrer noopener\">Raytheon Technologies<\/a>, one of the largest aerospace and defense manufacturers, recognizes the contribution of women meaningfully. The company rewards early talent with what they need to kick start their careers: tuition reimbursement and a 14-week on-the-job program dubbed <strong>Re-Empower,<\/strong> where candidates learn new skills to prepare for a career at Raytheon.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“Raytheon Technologies has paid for my MBA from UConn as well as my master’s from MIT&#8230;this company has definitely invested in me and I appreciate that.”<\/p><cite>—Tina Oyeniya, Associate Director of Technology Capabilities Integration—Pratt &amp; Whitney<\/cite><\/blockquote>\n\n\n\n<p>Today, Oyeniya helps inspire the next generation of women innovators through her volunteer work with Girls Who Code. Raytheon Technologies also pairs prospective women employees with ambassadors at their company to show them what a career in aerospace and defense could look like:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“The Re-Empower Program was perfect because they paired us with ambassadors who helped acquaint us with Raytheon Technologies’ culture and how the company does business&#8230;it was really helpful with getting us up to speed with the culture and the day-to-day functions and responsibilities of our jobs.”<\/p><cite>—Subcontract Manager of Global Supply for Raytheon Missiles and Defense, Tani Foster<\/cite><\/blockquote>\n\n\n\n<h2>3. Women in STEM apply to more jobs with inclusive words in the job description<\/h2>\n\n\n\n<p>For this next finding, we looked at whether the language used in over 400K job descriptions impacted the willingness of women to apply. What we found might be unsurprising but serves as a timely reminder for employers that are looking to boost applications from women in STEM: the language you use in your job descriptions has the power to persuade or dissuade women candidates from applying to your roles.<\/p>\n\n\n\n<p>In fact, after dissecting 34 different phrases and terminology, we found that the usage of <strong>specific keywords can increase applications from women by up to 15%<\/strong>, while <strong>others can detract women by up to 5%<\/strong>.<\/p>\n\n\n\n<p>Words that suggest <strong>inclusivity and collaboration increase the number of applications<\/strong> an employer receives from women in STEM; meanwhile, <strong>words with more intense connotations typically decrease<\/strong> the number of applications.<\/p>\n\n\n\n<p>Here’s a full debrief of the findings:<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" width=\"1024\" height=\"973\" src=\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic3.jpg?resize=1024%2C973&#038;ssl=1\" alt=\"\" class=\"wp-image-4729\" srcset=\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic3.jpg?resize=1024%2C973&amp;ssl=1 1024w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic3.jpg?resize=300%2C285&amp;ssl=1 300w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic3.jpg?resize=768%2C730&amp;ssl=1 768w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic3.jpg?resize=640%2C608&amp;ssl=1 640w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_3HiringPracticesThatDisadvantageWomenInSTEM_Infographic3.jpg?w=1080&amp;ssl=1 1080w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" data-recalc-dims=\"1\" \/><\/figure><\/div>\n\n\n\n<p>The main takeaway here is that employers need to leverage <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/70-inclusive-language-principles-that-will-make-you-a-more-successful-recruiter\/\" target=\"_blank\" rel=\"noreferrer noopener\">intentional and preferably gender-neutral<\/a> language in their job posts and messages. If you’re looking to increase applications from women in STEM, review your recruiting language. There are <a href=\"http:\/\/gender-decoder.katmatfield.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">free tools on the web<\/a> that can provide a good start, but ultimately, you’ll want to review the language on your own and ensure you’ve incorporated the right keywords.<br><strong><br><\/strong>We also found that <strong>by shortening job descriptions to under 2,000 words, employers can expect to receive 3% more applications from women<\/strong> on average. Women are more likely to feel that they <a href=\"https:\/\/business.linkedin.com\/talent-solutions\/blog\/diversity\/2019\/how-women-find-jobs-gender-report#:~:text=Research%20shows%20that%20in%20order,apply%20after%20meeting%20about%2060%25\" target=\"_blank\" rel=\"noreferrer noopener\">need to meet 100% of a role’s criteria before applying<\/a>, while men usually apply after meeting about 60%. If a job description is more concise, women may have less of an opportunity to think they’re unqualified.<\/p>\n\n\n\n<h2>Closing thoughts<\/h2>\n\n\n\n<p>Your efforts shouldn’t stop at the bottom of the recruiting funnel. <a href=\"https:\/\/leanin.org\/sexual-harassment-backlash-survey-results\" target=\"_blank\" rel=\"noreferrer noopener\">According to Lean In<\/a>, 60% of managers who are men are uncomfortable participating in a common work activity with a woman, such as mentoring, working alone, or socializing together, with <strong>1 in 6 men saying they are reluctant to mentor a woman<\/strong>.<br><br>The bottom line is it’s becoming harder for women to find male mentors and sponsors who can help them climb the career ladder. Employers should encourage both men and women to become ambassadors by communicating the <a href=\"https:\/\/leanin.org\/mentor-her\" target=\"_blank\" rel=\"noreferrer noopener\">benefits of mentorship<\/a> and providing women with opportunities for growth.<\/p>\n\n\n\n<p>Similar to what Handshake Premium partners like Goldman Sachs did on Handshake, you can pair your leaders with students who aspire to be in similar roles. By leveraging digital tools to enable authentic connections, you’ll be better equipped to provide meaningful mentorship opportunities for women in STEM as they progress from campus to career.<\/p>\n\n\n\n<p>Whether you’re looking to adopt better sourcing practices or are considering hiring more women in STEM for the first time, ensure you’re addressing every step of the rung—from the entry level up to the C-suite. Your future leaders are counting on you to do so.&nbsp;<\/p>\n\n\n\n<p>There’s no reason to do it alone. Get in touch to learn how Handshake’s team of experts can help you attract and retain more women in STEM. And together, we’ll ensure the playing field is leveled for all—regardless of ethnicity or gender, who you know, or where you go to school.<\/p>\n\n\n\n<h2 class=\"has-text-align-center\"><a href=\"https:\/\/joinhandshake.com\/employers\/request-more-info\/\" target=\"_blank\" rel=\"noreferrer noopener\">Request More Info &gt;<\/a><\/h2>\n","protected":false},"excerpt":{"rendered":"<p>Looking to hire women in STEM? Get a debrief on how to reach this cohort more effectively.<\/p>\n","protected":false},"author":167034975,"featured_media":4730,"menu_order":0,"template":"","employers_category":[1412],"employers_tag":[1438,1439],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>3 Trends Impacting Women in STEM in 2020 | Handshake<\/title>\n<meta name=\"description\" content=\"Where are women in STEM most underrepresented, what language in your job posts encourages them to apply, and when are they likelier to apply?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"3 Trends Impacting Women in STEM in 2020 | Handshake\" \/>\n<meta property=\"og:description\" content=\"Where are women in STEM most underrepresented, what language in your job posts encourages them to apply, and when are they likelier to apply?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2020-10-14T19:48:58+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_WomenInSTEM_BlogImage.jpg?fit=1440%2C960&#038;ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1440\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_WomenInSTEM_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_WomenInSTEM_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"width\":1440,\"height\":960,\"caption\":\"3 Trends Impacting Women in STEM in 2020\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/\",\"name\":\"3 Trends Impacting Women in STEM in 2020 | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#primaryimage\"},\"datePublished\":\"2020-10-14T19:27:05+00:00\",\"dateModified\":\"2020-10-14T19:48:58+00:00\",\"description\":\"Where are women in STEM most underrepresented, what language in your job posts encourages them to apply, and when are they likelier to apply?\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"3 Trends Impacting Women in STEM in 2020\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"3 Trends Impacting Women in STEM in 2020 | Handshake","description":"Where are women in STEM most underrepresented, what language in your job posts encourages them to apply, and when are they likelier to apply?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/","og_locale":"en_US","og_type":"article","og_title":"3 Trends Impacting Women in STEM in 2020 | Handshake","og_description":"Where are women in STEM most underrepresented, what language in your job posts encourages them to apply, and when are they likelier to apply?","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2020-10-14T19:48:58+00:00","og_image":[{"width":1440,"height":960,"url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_WomenInSTEM_BlogImage.jpg?fit=1440%2C960&ssl=1","path":"\/srv\/htdocs\/wp-content\/uploads\/2020\/10\/HS_WomenInSTEM_BlogImage.jpg","size":"full","id":4730,"alt":"3 Trends Impacting Women in STEM in 2020","pixels":1382400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_WomenInSTEM_BlogImage.jpg?fit=1440%2C960&ssl=1","contentUrl":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_WomenInSTEM_BlogImage.jpg?fit=1440%2C960&ssl=1","width":1440,"height":960,"caption":"3 Trends Impacting Women in STEM in 2020"},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/","name":"3 Trends Impacting Women in STEM in 2020 | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#primaryimage"},"datePublished":"2020-10-14T19:27:05+00:00","dateModified":"2020-10-14T19:48:58+00:00","description":"Where are women in STEM most underrepresented, what language in your job posts encourages them to apply, and when are they likelier to apply?","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"3 Trends Impacting Women in STEM in 2020"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/4721"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/4730"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=4721"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=4721"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=4721"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}