{"id":4815,"date":"2020-10-22T11:57:27","date_gmt":"2020-10-22T18:57:27","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=4815"},"modified":"2020-10-22T11:57:28","modified_gmt":"2020-10-22T18:57:28","slug":"8-dos-and-donts-of-messaging-underrepresented-students","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/","title":{"rendered":"8 Dos and Don’ts of Messaging Underrepresented Students"},"content":{"rendered":"\n<p><a href=\"https:\/\/joinhandshake.com\/blog\/employers\/diversity-and-inclusion-7-essential-early-talent-recruiting-strategies\/\" target=\"_blank\" rel=\"noreferrer noopener\">Diversity and inclusion<\/a> has been a popular topic in recruiting for a while now, and for good reason. Diverse and inclusive workplaces are typically characterized by innovation, positive employee morale, and an improved bottom line. <a href=\"https:\/\/www.cultureamp.com\/blog\/benefits-of-diversity-in-the-workplace\/\" target=\"_blank\" rel=\"noreferrer noopener\">Diverse teams add significant value to any organization<\/a>, but creating a representative workforce is a consistent challenge for many employers. To be more effective at engaging students from underrepresented backgrounds, let’s first explore who these unique candidates are.<\/p>\n\n\n\n<h2>Who is a diverse candidate?<\/h2>\n\n\n\n<p>While those included in underrepresented minorities (URMs) and underrepresented groups (URGs) have come to include more and more people, the definition generally remains the same. An underrepresented minority is someone who is disproportionately less represented in a specific industry or field—like science, technology, engineering, and mathematics (STEM)— compared to the general population. URMs typically include people from minority race and ethnic backgrounds, like Black or Latinx, and sexual orientation and gender, like LGBTQ+ or women in STEM.<\/p>\n\n\n\n<p>Because URMs are uniquely diverse people, employers need to communicate to them in a way that celebrates their uniqueness and their backgrounds while highlighting the value your organization places on inclusivity. Not sure where to start? We’ll show you how to reach out to underrepresented minorities (and what not to do) to build a more talented and representative team.<\/p>\n\n\n\n<h2>How do I message students from underrepresented backgrounds?<\/h2>\n\n\n\n<p>You have internship opportunities and jobs to fill and you’d like to build a more representative organization, so you’ve decided to engage with candidates from varying backgrounds and experiences, including URMs. But where do you start?&nbsp;<\/p>\n\n\n\n<p>Instead of sending the same canned message to every student, take the time to personalize your outreach—your recipients will appreciate it. Handshake’s Campus to Career report revealed that <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/handshakes-2019-campus-to-career-report\/\" target=\"_blank\" rel=\"noreferrer noopener\">95% of students surveyed <em>prefer <\/em>to engage with employers that send personalized, proactive messages<\/a>. This is your chance to show candidates that you value them enough as individuals to not send them the same standard message everyone else gets. <\/p>\n\n\n\n<p>Here are a few best practices to follow when messaging diverse talent.<\/p>\n\n\n\n<h4>1. Don’t make assumptions <\/h4>\n\n\n\n<p>Students from URGs aren’t all the same. <a href=\"https:\/\/www.usatoday.com\/in-depth\/news\/nation\/2020\/01\/06\/more-hispanic-students-than-ever-go-college-but-cost-high\/2520646001\/\" target=\"_blank\" rel=\"noreferrer noopener\">Nearly half of Latinx students are the first in their families to go to college<\/a>, but that doesn’t mean that <em>every <\/em>Latinx student is a first-generation college student. Identifying with a certain underrepresented group doesn’t take away a student’s individuality. Treat students as individuals by avoiding generalizations or stereotyping them.<\/p>\n\n\n\n<h4>2. Avoid tokenizing candidates<\/h4>\n\n\n\n<p>It’s easy to get caught up in diversity recruitment, but <a href=\"https:\/\/medium.com\/diversity-together\/6-principles-for-messaging-underrepresented-candidates-on-handshake-7c70b224f39\" target=\"_blank\" rel=\"noreferrer noopener\">students from underrepresented backgrounds prefer to be hired for their skills and expertise<\/a>, not their ethnic or racial status. Your messages need to reflect that. When you tell a URM student that you’re messaging them because they’re a minority, you risk offending or tokenizing them.<\/p>\n\n\n\n<h6><strong>Tip:<\/strong> Avoid phrases like, “Looking for black students for our STEM internship” or “Latinx women are invited to apply.” Many Handshake employers go with a standard subject line like, “You received a message from [employer] on Handshake,” which typically gets a 65% average open rate.<\/h6>\n\n\n\n<h4>3. Consider your candidates<\/h4>\n\n\n\n<p>Before you reach out to students, you should first consider who they are, where they come from, and their motivations. For example, some employers still set GPA cutoffs to source qualified candidates when it’s been proven to be an inaccurate indicator of job performance. It might not seem like a big deal until you consider that <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/3-hiring-practices-that-disadvantage-black-students\/\" target=\"_blank\" rel=\"noreferrer noopener\">60% of Black student applications<\/a> and <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/want-more-latinx-candidates-try-these-3-hiring-strategies\/\" target=\"_blank\" rel=\"noreferrer noopener\">56 percent of Latinx student applications<\/a> have a GPA below 3.5. Keep in mind that these students may have had unequal access to resources, skilled teachers, or may be working multiple jobs to support their families. Any of these could impact their GPA.<\/p>\n\n\n\n<h6><strong>Tip:<\/strong> Nix the GPA requirements. When Handshake Premium partner Whirlpool Corporation did this, their <a href=\"https:\/\/www.toolbox.com\/hr\/employer-marketing\/interviews\/tim-streeter-whirlpool-student-recruitment\/\" target=\"_blank\" rel=\"noreferrer noopener\">percentage of URM hires increased from 30 to 40 percent YOY<\/a>.<\/h6>\n\n\n\n<p>URM students are more likely to work part-time throughout school and therefore don’t have the time to perfect their applications or track down the supplemental documents (e.g., transcripts, recommendation letters) needed to apply. Some are so busy that they can’t meet strict recruiting deadlines. Encourage applications by recruiting year-round and giving busy candidates time to put together a quality application instead of rushing to just send something in.<\/p>\n\n\n\n<h4>4. Be proactive and be relevant<\/h4>\n\n\n\n<p>We all want to be wanted, and students are no different. Instead of waiting until you meet a student at a career fair or see that someone attended your virtual event, send messages proactively. The key is to engage with students who you’re interested in, but that will also find your messages relevant. Sending a woman interested in marketing a message about your STEM internship will likely get ignored because it’s not relevant to her.<\/p>\n\n\n\n<h6><strong>Tip:<\/strong> Check out students’ profiles before messaging them. Nothing’s worse than sending an irrelevant message to a candidate who tells other students about you spamming them (even if you didn’t intend to spam them).<\/h6>\n\n\n\n<h4>5. Review students’ profiles <em>before<\/em> messaging them<\/h4>\n\n\n\n<p>Students work hard to create their online brand—a digital representation of who they are. Handshake student profiles give valuable insights into a candidate, such as what kind of work they’re looking for, which locations they want to work in, the specific roles they’re interested in, any organizations they’re part of, and more. Take this opportunity to get to know the candidate and leverage what’s on their profile to <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/\" target=\"_blank\" rel=\"noreferrer noopener\">personalize your outreach<\/a>.<\/p>\n\n\n\n<h4>6. Be authentic<\/h4>\n\n\n\n<p>You expect candidates to be upfront and transparent with you, so candidates should expect the same from you. Students can quickly determine whether your message is an impersonal message that hundreds of other students received or if you put some thought into crafting your message. Connect with each student through personalized outreach and show them they can trust you.<\/p>\n\n\n\n<h4>7. Make your outreach personal<\/h4>\n\n\n\n<p>Show candidates that you want to get to know them and that you did a little research by personalizing your messages. You can use Handshake to customize messages by using a student’s first name, their major, school, and more.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/Campaign-message.png?resize=614%2C768&#038;ssl=1\" alt=\"\" class=\"wp-image-4824\" width=\"614\" height=\"768\" srcset=\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/Campaign-message.png?resize=819%2C1024&amp;ssl=1 819w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/Campaign-message.png?resize=240%2C300&amp;ssl=1 240w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/Campaign-message.png?resize=768%2C961&amp;ssl=1 768w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/Campaign-message.png?resize=640%2C801&amp;ssl=1 640w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/Campaign-message.png?resize=1024%2C1281&amp;ssl=1 1024w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/Campaign-message.png?w=1100&amp;ssl=1 1100w\" sizes=\"(max-width: 614px) 100vw, 614px\" data-recalc-dims=\"1\" \/><\/figure><\/div>\n\n\n\n<p>You can also tailor your messaging to URMs by showing that you support them through ERGs, mentors, or a representative leadership team. Be sure to highlight your employer brand and the value your organization puts on diversity and inclusion. Remember, students don’t want to be labeled as diversity hires, so it’s important employers don’t make them feel that way.<br><br><strong>Tip:<\/strong> Share with candidates how URMs are strengthening your workforce with innovation, talk about the different employee resource groups (ERGs) you offer, or share an article or video from your women-led engineering team. Candidates want to see that you value their unique experiences and that they’ll be fully supported with pathways for progression.<br><br>A less obvious but equally important way to personalize your outreach is to consider who is engaging with your candidates. We all want to see people who look like us or come from similar backgrounds at the company we’re considering for an internship or full-time employment. <a href=\"https:\/\/go.joinhandshake.com\/rs\/390-ZTF-353\/images\/Handshake_Ambassadors_Datasheet.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Virtual Ambassadors<\/a> can help bridge this gap. Invite your alumni ambassadors or former interns to connect with prospective URM students. They can speak about their experiences with your organization and give candidates a look into how you value diversity.<\/p>\n\n\n\n<h6><strong>Tip:<\/strong> Ambassadors on Handshake are typically alumni, department heads, former interns, or recent hires. Connect your ambassadors through messages to candidates, where they can share their excitement about your organization, answer questions, and discuss your ERGs or resources for URMs.<\/h6>\n\n\n\n<h4>8. Check your language<\/h4>\n\n\n\n<p>When you’re sending messages, it’s important to <a href=\"https:\/\/writer.com\/inclusion-glossary\/\" target=\"_blank\" rel=\"noreferrer noopener\">double-check the words you’re using<\/a>. You don’t want to unintentionally offend a student because you used inappropriate lingo or you chose masculine language over gender-neutral. The best way to check yourself is to ask: Would I feel like I belonged at this company if I got this message?<\/p>\n\n\n\n<h6><strong>Tip:<\/strong> Use inclusive language. Our Women in STEM report revealed <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/3-trends-impacting-women-in-stem-in-2020\/\" target=\"_blank\" rel=\"noreferrer noopener\">that words that suggest inclusivity and collaboration increase the number of women applicants, while words with more intense connotations typically decrease these applications<\/a>. Use inclusive, collaborate words in your job descriptions to attract more women to your STEM roles.<\/h6>\n\n\n\n<h2>Why employers should message URMs on Handshake<\/h2>\n\n\n\n<p><em>Where<\/em> you message students is just as important as what you say. The 7M+ active students on Handshake come from all backgrounds, experiences and schools, including minority-serving institutions, which is why many employers start their outreach here.&nbsp;<\/p>\n\n\n\n<p>While any employer on Handshake can message early talent, Handshake Premium partners can better personalize<a href=\"https:\/\/joinhandshake.com\/employers\/solutions\/engage\/\" target=\"_blank\" rel=\"noreferrer noopener\"> their Campaigns using Segments<\/a>, which allow them to create groups of students based on certain criteria and message them at scale. For example, employers looking to diversify their recruiting efforts can source qualified members of varying student organizations (e.g., Society of Women Engineers), institutions (e.g., HBCUs, MSIs), student interests, and more. <\/p>\n\n\n\n<p>As a result of smart segmentation and personalized, scalable outreach, Handshake Premium employers typically see the following compared to employers on Handshake Core:<\/p>\n\n\n\n<ul><li>7-9x increase in applications from Black, Latinx, and women candidates<\/li><li><strong>2x+ more clicks<\/strong> to job postings, message links, or their website<\/li><li>Begin receiving applications to open jobs <strong>32 days sooner<\/strong><\/li><\/ul>\n\n\n\n<h2>Ready to start messaging students from underrepresented backgrounds?<\/h2>\n\n\n\n<p>How you communicate with students from underrepresented backgrounds is important. They want to feel valued and appreciated for the unique experiences and skills they bring to the table, not feel like a diversity hire. Now that you’ve got some best practices under your belt and actionable next steps for personalizing your outreach on Handshake, you can start building authentic, meaningful relationships with URMs and recruiting the right candidates for your open jobs or internships. <\/p>\n\n\n\n<p>Ready to get started? <a href=\"https:\/\/joinhandshake.com\/employers\/request-more-info\/\" target=\"_blank\" rel=\"noreferrer noopener\">We’ll show you how.<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Take the time to tailor your outreach to students from underrepresented backgrounds.<\/p>\n","protected":false},"author":167034975,"featured_media":4825,"menu_order":0,"template":"","employers_category":[1412],"employers_tag":[1459,1450],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>8 Dos and Don’ts of Messaging Underrepresented Students<\/title>\n<meta name=\"description\" content=\"Take the time to tailor your messages to students from underrepresented backgrounds—95% of students we surveyed prefer personalized outreach.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"8 Dos and Don’ts of Messaging Underrepresented Students\" \/>\n<meta property=\"og:description\" content=\"Take the time to tailor your messages to students from underrepresented backgrounds—95% of students we surveyed prefer personalized outreach.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2020-10-22T18:57:28+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_8DosAndDonts_BlogImage.jpg?fit=1440%2C960&#038;ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1440\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_8DosAndDonts_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_8DosAndDonts_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"width\":1440,\"height\":960},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/\",\"name\":\"8 Dos and Don\\u2019ts of Messaging Underrepresented Students\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#primaryimage\"},\"datePublished\":\"2020-10-22T18:57:27+00:00\",\"dateModified\":\"2020-10-22T18:57:28+00:00\",\"description\":\"Take the time to tailor your messages to students from underrepresented backgrounds\\u201495% of students we surveyed prefer personalized outreach.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"8 Dos and Don\\u2019ts of Messaging Underrepresented Students\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"8 Dos and Don’ts of Messaging Underrepresented Students","description":"Take the time to tailor your messages to students from underrepresented backgrounds—95% of students we surveyed prefer personalized outreach.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/","og_locale":"en_US","og_type":"article","og_title":"8 Dos and Don’ts of Messaging Underrepresented Students","og_description":"Take the time to tailor your messages to students from underrepresented backgrounds—95% of students we surveyed prefer personalized outreach.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2020-10-22T18:57:28+00:00","og_image":[{"width":1440,"height":960,"url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_8DosAndDonts_BlogImage.jpg?fit=1440%2C960&ssl=1","path":"\/srv\/htdocs\/wp-content\/uploads\/2020\/10\/HS_8DosAndDonts_BlogImage.jpg","size":"full","id":4825,"alt":"","pixels":1382400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_8DosAndDonts_BlogImage.jpg?fit=1440%2C960&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/10\/HS_8DosAndDonts_BlogImage.jpg?fit=1440%2C960&ssl=1","width":1440,"height":960},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/","name":"8 Dos and Don’ts of Messaging Underrepresented Students","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#primaryimage"},"datePublished":"2020-10-22T18:57:27+00:00","dateModified":"2020-10-22T18:57:28+00:00","description":"Take the time to tailor your messages to students from underrepresented backgrounds—95% of students we surveyed prefer personalized outreach.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/8-dos-and-donts-of-messaging-underrepresented-students\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"8 Dos and Don’ts of Messaging Underrepresented Students"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/4815"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/4825"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=4815"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=4815"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=4815"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}