{"id":696,"date":"2019-07-24T08:00:44","date_gmt":"2019-07-24T15:00:44","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=696"},"modified":"2020-06-21T10:11:51","modified_gmt":"2020-06-21T17:11:51","slug":"4-ways-to-prepare-for-on-campus-recruiting-this-fall","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/","title":{"rendered":"4 Ways to Prepare for On-Campus Recruiting this Fall"},"content":{"rendered":"\n<p><em>Editor&#8217;s note: This blog covers in-person and on-campus recruitment tips. To better prepare for a virtual or hybrid 2020 fall recruiting season, read our latest post <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/will-campuses-reopen-your-covid-19-proof-fall-recruiting-playbook\/\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>.<\/em><\/p>\n\n\n\n<p>It&#8217;s all too familiar: you’ve been successful recruiting at your core schools in the past, so you prepare to return to those schools this fall with the same on-brand tablecloth and turnkey swag.<br><br>You spend the afternoon waiting for candidates to stop by your table and chat, and while you’ve managed to get a few resumes in hand, you feel like there could have been better ways to pass the time. To make matters more complicated, your leaders decide to join for the ride, and s\/he’s beginning to notice the lack of interview slots you’ve filled.<\/p>\n\n\n\n<p>Heading on campus without a strategy not only results in lower quality hires, but can also be destructive to your brand. Keep in mind that one bad impression from a single student can affect how many students see you.<br><br>It doesn’t have to be this way. There are effective and proven ways to maximize your on campus return-on-investment (ROI), boost your employer brand, and fill your job openings with quality early career talent who are eager to help you succeed in your mission.<br><br>That’s what this blog will address. Read on for tips to incorporate into your on campus recruitment strategy this fall and beyond.<\/p>\n\n\n\n<h1>What to Expect On Campus this Fall<\/h1>\n\n\n\n<p>Before we dive in, let’s take a moment to understand just how competitive the on-campus recruiting landscape is. For brevity, we’ll focus on career fairs—a tried, true, and mainstream way of recruiting today’s college grads.<br><br>To help students prepare for jobs and internships, schools host career fairs to provide soon-to-be grads with opportunities to meet face-to-face with employers–including those they may not know. For employers, it’s a critical opportunity to build their employer brand and early career talent pipeline.<br><br>Between September 1 and November 21, 2018, nearly&nbsp;<strong>50,000 employers attend 890 campus career fairs<\/strong>&nbsp;on Handshake. With so many possibilities, how do you save time away from the office while reaching the schools you need and hitting your hiring targets? Let’s get started by answering this question.<\/p>\n\n\n\n<h1>4 Ways to Prepare for Fall On-Campus Recruiting<\/h1>\n\n\n\n<h4>1. Identify your goals and talent pipeline needs<\/h4>\n\n\n\n<p>Maybe your goal this fall is to hire a few good entry-level salespeople? Or perhaps you’re finding it challenging to fill 12 open roles with engineers from underserved populations like historically black colleges and universities (HBCUs)?<br><br>What if you receive more requests for early career candidates throughout the year? How do you start building your qualified talent pool&nbsp;<em>today?<br><br><\/em>Whatever your goals might be, take a moment to assess your talent needs and note them as your guiding mission statement for on-campus recruitment. By now, you should have talent personas of your ideal hires by defining the competencies, skills, and behavior needed to navigate and succeed in your open roles.<br><br>Once you’ve defined these unique characteristics, use those attributes to fuel your ideal talent persona profile. If you’re looking to fill multiple entry-level roles, you might define a persona for each opening.<br><br>With concrete goals and talent personas in mind,&nbsp;<a href=\"https:\/\/joinhandshake.com\/blog\/employers\/gearing-up-for-a-data-driven-fall-recruiting-season\/\">connect with schools on Handshake<\/a>&nbsp;that meet your talent profile then learn about any upcoming on-campus events or career fairs they’re hosting and register to attend.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Tip: talent personas are designed to help you find the right candidates. Look out for and address unconscious bias that might creep into those descriptions by ensuring the language and tone in your&nbsp;<a href=\"https:\/\/joinhandshake.com\/blog\/employers\/putting-interns-first-at-handshake-4-tips-for-writing-inclusive-internship-job-descriptions\/\">job roles and talent personas are neutral<\/a>.<\/p><\/blockquote>\n\n\n\n<h4>2. Ramp up your qualified candidate pipeline<\/h4>\n\n\n\n<p>Now comes the most critical step in your career fair and on-campus event planning process (as a marketer, I happen to consider this the most fun step, too). Remember that scenario earlier of our university recruiter securing the occasional resume in hand? How do you ensure your presence stands out?<\/p>\n\n\n\n<p>The answer is pretty simple–leverage technology to help you promote and scale your efforts&nbsp;<em>before<\/em>&nbsp;stepping foot on campus.<\/p>\n\n\n\n<p>Even though students will be able to see who will be visiting their campus, a powerful step that will be pivotal to your on-campus success is shifting from a reactive to a more proactive approach. Tell the students you want to meet with that you’re coming!<\/p>\n\n\n\n<p>After all, 95% of students told us that they engage with employers that send personalized, proactive outreach,&nbsp;according to Handshake network data. So how do you do that?<br><br>Through segmentation, you can define and save your hiring criteria, then tap into the most engaged student audience to drive interest in your funnel and engagement while you’re on campus. By doing this, you can plan ahead and send your campaign emails before attending career fairs and schedule automated reminders without added work.<br><br>By utilizing Handshake’s student location preferences and reaching out to students ahead of campus visits,&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/hs.joinhandshake.com\/employers\/premium\" target=\"_blank\">Handshake Premium<\/a>&nbsp;partner,&nbsp;<a href=\"https:\/\/joinhandshake.com\/blog\/employers\/mt-bank-optimizes-on-campus-visits-with-proactive-outreach-on-handshake\/\">M&amp;T Bank<\/a>, was able to establish relationships early and focus in on interested candidates. Their strategy produced a talent pipeline of students that were both qualified and interested and led to a&nbsp;<strong>161% increase in applications and 20 qualified hires<\/strong>&nbsp;in one recruiting season!<\/p>\n\n\n\n<h4>3. Opportunities to boost employer brand<\/h4>\n\n\n\n<p>How do prospects currently see your organization? Are candidates aware of the different types of roles your employer offers? And do they know about your values and impact?<\/p>\n\n\n\n<p>The New York Times, for example, is increasingly considered a technology company. Historically, they’ve been a popular media organization for journalism and creative writing majors to apply, but not top-of-mind for engineers.<\/p>\n\n\n\n<p>On-campus career fairs are a great way to demonstrate the unique propositions your organization brings to the table. Shed insight into the diverse and inclusive practices that make your company stand out from the talent competition by highlighting the employee resource groups (ERGs), corporate volunteering activities, or nonprofit partners you work with at your table.<\/p>\n\n\n\n<p>You can also leverage career fairs as an opportunity to provide real-world examples of the practices your business leads. If you’re at the forefront of breakthrough industry research or working towards sustainability goals, bring copies of those reports to the table with you. Consider providing tablets, too, for students to read or watch stories about the diverse populations you serve.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Tip: don’t wait until you’re on campus to provide insight. Now is the perfect time to invite your current hires or interns to <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/leverage-student-reviews-on-handshake-to-augment-your-employer-brand\/\">review their&nbsp;experience during interviews and at the company on Handshake<\/a>. Tap into real stories of what it’s like to work at your organization and be sure to document anything that sets you apart from your talent competitors.<\/p><\/blockquote>\n\n\n\n<p>Technology solutions provider,&nbsp;<a href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-cdw-became-a-proactive-recruiting-engine-with-handshake-premium\/\">CDW<\/a>, was looking for help increasing awareness with early talent. After becoming a Handshake Premium partner, their team leveraged powerful segmentation to narrow their talent audience and find students and alumni with skills that would allow them to succeed in their roles. They coupled this with location filtering to tap into the talent that wants to work in the cities where they conduct business.<br><br>CDW&#8217;s strategy resulted in their ability to reach 3 million more students than in the past across more than 500 schools, compared to about 50 schools before. In addition, they saw a 5X increase in employer brand awareness, 160% more applications than talent competitors, and 23X growth in their sales intern program.<\/p>\n\n\n\n<h4>4. Bringing it all together and measuring on-campus ROI<\/h4>\n\n\n\n<p>Let’s revisit our earlier scenario for a moment: after exhausting your budget on travel, lodging, swag, and entertainment, you’re struggling to quantify results to your VP and articulate what worked and what did not.<\/p>\n\n\n\n<p>Before Handshake Premium, assessing on-campus ROI was incomplete and ineffective. If you follow the strategies in this post today, then by the end of fall, you will have connected with a new, more diverse student population, proactively nurtured students, and engaged them with stories on what it’s like to work with your employer.<\/p>\n\n\n\n<p>Let’s bring it all together and demonstrate how these renewed efforts helped you save time securing more qualified applicants and hires.<\/p>\n\n\n\n<p>Start by tabulating your on-campus conversion rate. To do this, collect the number of contacts you messaged before going on campus and compare that against the number of students who RSVPed to your event. The student applications and hires that result from your efforts now allow you to report on ROI directly.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Tip: Ditch the paper trail and consolidate multiple tools into one. With Handshake Premium, view reports across all your on-campus efforts and through multiple candidate touch points.<\/p><\/blockquote>\n\n\n\n<p><br>Don’t miss unique insight into how you can improve on future career fairs. Follow up with students who attend your event with a sincere thank you and short survey. Consider including questions around how their perceptions changed after stopping by, if they&#8217;re likelier to apply, and whether they have any feedback they’d be open to sharing with you.<br><br>You can also leverage follow-up surveys as an opportunity to invite students to remain connected to your organization by signing up for your newsletter. Keep students engaged long after campus events are over by sending them updates about your work and promoting new job openings they may be qualified for.<br><br>When global automotive components manufacturer, DENSO, first approached Handshake, they were looking to move away from ineffective workflows, like posting jobs to individual schools and paper-based resume processing.<br><br>By inviting priority student segments to on-campus events, recording who they met, engaging with candidates after events through automated campaigns, and tracking applicants, DENSO collected&nbsp;<strong>3X the quality resumes and saw a 53% increase in qualified applicants<\/strong>&nbsp;compared to the season before.<\/p>\n\n\n\n<p>Now that you made it to the end of this post, hopefully you got a better sense of how to proactively build your ideal talent pipeline, engage with candidates, and evaluate ROI before going on campus this fall. Congratulations–you’re now ready to stand out from your talent competitors!<\/p>\n\n\n\n<p>We realize there&#8217;s a lot of information covered in this blog, so to help you put takeaways into action, we put together a handy checklist to guide your strategy, planning, engagement, event execution, and follow up.<\/p>\n\n\n\n<p><a href=\"https:\/\/go.joinhandshake.com\/Fall2019OnCampusRecruitmentChecklist.html\" rel=\"noreferrer noopener\" target=\"_blank\">Download the checklist here<\/a>, and get in touch with one of our in-house experts for more personalized strategies on how to make the most of your on-campus recruiting efforts this fall and beyond.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tips to help you save time and sanity recruiting on campus.<\/p>\n","protected":false},"author":167034976,"featured_media":729,"menu_order":0,"template":"","employers_category":[1414],"employers_tag":[1449,1442],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>4 Ways to Prepare for On-Campus Recruiting this Fall | Handshake<\/title>\n<meta name=\"description\" content=\"Tips to help you save time and sanity recruiting on campus.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"4 Ways to Prepare for On-Campus Recruiting this Fall | Handshake\" \/>\n<meta property=\"og:description\" content=\"Tips to help you save time and sanity recruiting on campus.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-21T17:11:51+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Canva-University-in-Maryland-1024x611.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"611\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Canva-University-in-Maryland.jpg?fit=2200%2C1313&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Canva-University-in-Maryland.jpg?fit=2200%2C1313&ssl=1\",\"width\":2200,\"height\":1313,\"caption\":\"4 Ways to Prepare for On-Campus Recruiting this Fall\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/\",\"name\":\"4 Ways to Prepare for On-Campus Recruiting this Fall | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#primaryimage\"},\"datePublished\":\"2019-07-24T15:00:44+00:00\",\"dateModified\":\"2020-06-21T17:11:51+00:00\",\"description\":\"Tips to help you save time and sanity recruiting on campus.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"4 Ways to Prepare for On-Campus Recruiting this Fall\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"4 Ways to Prepare for On-Campus Recruiting this Fall | Handshake","description":"Tips to help you save time and sanity recruiting on campus.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/","og_locale":"en_US","og_type":"article","og_title":"4 Ways to Prepare for On-Campus Recruiting this Fall | Handshake","og_description":"Tips to help you save time and sanity recruiting on campus.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2020-06-21T17:11:51+00:00","og_image":[{"width":1024,"height":611,"path":"2019\/09\/Canva-University-in-Maryland-1024x611.jpg","url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Canva-University-in-Maryland-1024x611.jpg","size":"large","id":729,"alt":"4 Ways to Prepare for On-Campus Recruiting this Fall","pixels":625664,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Canva-University-in-Maryland.jpg?fit=2200%2C1313&ssl=1","contentUrl":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Canva-University-in-Maryland.jpg?fit=2200%2C1313&ssl=1","width":2200,"height":1313,"caption":"4 Ways to Prepare for On-Campus Recruiting this Fall"},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/","name":"4 Ways to Prepare for On-Campus Recruiting this Fall | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#primaryimage"},"datePublished":"2019-07-24T15:00:44+00:00","dateModified":"2020-06-21T17:11:51+00:00","description":"Tips to help you save time and sanity recruiting on campus.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"4 Ways to Prepare for On-Campus Recruiting this Fall"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/696"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034976"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/729"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=696"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=696"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=696"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}