{"id":846,"date":"2019-09-25T08:00:45","date_gmt":"2019-09-25T15:00:45","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=846"},"modified":"2019-10-08T14:15:59","modified_gmt":"2019-10-08T21:15:59","slug":"will-early-talent-want-to-work-for-your-company","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/","title":{"rendered":"Will Early Talent Want to Work for Your Company? Ask These 7 Questions"},"content":{"rendered":"\n<p>Even if your company has a program in place for recruiting early talent—interns, co-ops, and entry-level roles—it may be time to revisit your strategy. That’s because Gen Z and those graduating alongside them represent the first generation of true digital natives.<\/p>\n\n\n\n<p><a href=\"https:\/\/joinhandshake.com\/blog\/employers\/handshakes-2019-campus-to-career-report\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Handshake’s 2019 Campus to Career report<\/a> illustrates how this generation is uniquely equipped with the most in-demand skills of the growing innovation economy: organization, leadership, problem-solving, communication, data analysis, and engineering.<\/p>\n\n\n\n<p>Is your organization ready to embrace this generation’s strengths? Ask yourself these seven questions below to determine:<\/p>\n\n\n\n<ul><li>How to set up your company&#8217;s internal early talent recruiting team<\/li><li>Whether you need recruiters to focus, exclusively, on recent grads<\/li><li>How to best invest efforts in digital resources<\/li><\/ul>\n\n\n\n<p>We realize that some of these steps can feel cumbersome. There&#8217;s no need to address them all at once—tackle one area at a time until you feel comfortable moving onto the next.<br><\/p>\n\n\n\n<h2><strong>1. What are our company&#8217;s long-term goals for workforce planning?<\/strong><\/h2>\n\n\n\n<p>When it comes to job hunting, students and young talent are all about keeping an open mind. In fact, 60% of Handshake student survey respondents say they are open to finding jobs outside of their major.<\/p>\n\n\n\n<p>With today’s grads being so open to new career tracks, employers need to be thoughtful about the exact functions for which they are hiring and why. This planning requires a thorough understanding of how, exactly, early talent can fulfill your organization’s strategic priorities.<\/p>\n\n\n\n<p>It also requires being agile enough to recruit early talent at-the-ready by having a pool of qualified, engaged candidates in place year-round. Here are a few steps you can take to align early talent-hiring with your organization’s goals:<\/p>\n\n\n\n<ul><li>Gain an understanding of the roles early talent naturally seeks out by learning about <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/where-are-college-students-going-after-they-graduate\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">the most popular roles for students and grads<\/a>.<\/li><li>Survey managers and leaders to identify teams that would benefit from the fresh perspectives entry level talent brings.<\/li><li>Host a senior leadership meetings to map out the roles they anticipate needing over the next 3-5 years, then plan on building your early talent pipeline <em>now<\/em> so it&#8217;s easy to fill these roles later.<\/li><\/ul>\n\n\n\n<p>With a clear overview of how early talent fits into your organization, you&#8217;ll empower teams for success—and hires with a smooth transition.<\/p>\n\n\n\n<h2>2. What career paths can early talent expect to take at our company?<\/h2>\n\n\n\n<p>Recent grads care about advancing rapidly:&nbsp;<a href=\"https:\/\/www.businessinsider.com\/gen-z-workers-expect-quick-promotions-and-better-office-perks-2019-4\" rel=\"noreferrer noopener\" target=\"_blank\">75% believe they should be promoted within a year<\/a>. But there’s a corollary to this story, according to a recent Handshake study—early talent wants to move&nbsp;<em>up<\/em>&nbsp;not&nbsp;<em>out<\/em>.<\/p>\n\n\n\n<p>While new grads may not stay at your company for decades, as was and is typical with the baby boomer generation, they do intend to stick around—and it’s up to employers to harness their talents.<\/p>\n\n\n\n<p>Follow these steps to communicate career pathways to potential hires:<\/p>\n\n\n\n<ul><li>In addition to posting job descriptions, share stories of tenured individuals. Show early talent what it takes, especially for newcomers, to advance.<br><br>Take a look at&nbsp;<a href=\"https:\/\/www.paypal.com\/stories\/us\/meet-jonah-otis-of-paypal-opportunitys-bay-area-chapter\" rel=\"noreferrer noopener\" target=\"_blank\">this employee story<\/a>&nbsp;from PayPal as an example.<\/li><li>Once you&#8217;ve collected stories and testimonials, share them on your Handshake Premium employer profile. Free Handshake employers can ask interns and hires to write reviews and answer Q&amp;As.<\/li><li>Ask recent hires (1-2 years) to write and share their perspectives on how they envision developing professionally at your company.<\/li><\/ul>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Tip: create user-generated content by collecting reviews from interns during their off-boarding at the end of each summer or term.<\/p><\/blockquote>\n\n\n\n<h2>3. What education, training, and support can our company offer early talent?<\/h2>\n\n\n\n<p>Nearly 30% of students on Handshake say that they are looking for training programs with a clear growth trajectory, and that they would only work for an employer who explicitly cares about their professional growth. With their needs met, early talent is likely to stick around to further develop their careers.<\/p>\n\n\n\n<p>Does your company offer an education stipend? Can you provide benefits such as formal mentorship, access to on-site workshops, and paid training? Be vocal and clear about these opportunities.<br><br>Learn how your company can build a learning and development culture from the ground up:<\/p>\n\n\n\n<ul><li>Perform an audit of existing learning, development, and training materials. You might also want to conduct a pulse survey to understand which programs are gaining in popularity.<\/li><li>Encourage teams to leverage internal tools to document company knowledge, host webinars, and create incentives for lunch n&#8217; learns, plus you can aggregate this content into learning materials later.<\/li><li>Share stories of individuals whose careers your organization helped advance—such as&nbsp;<a href=\"https:\/\/money.usnews.com\/careers\/salaries-and-benefits\/articles\/companies-lure-workers-with-nearly-free-college-tuition\" rel=\"noreferrer noopener\" target=\"_blank\">this story about Starbucks<\/a>&nbsp;subsidizing the tuition of a barista who dropped out of high school.<\/li><\/ul>\n\n\n\n<p>If you don&#8217;t have one already, consider creating a management or rotational program that gives early talent exposure to various departments within your organization.<\/p>\n\n\n\n<p>Intuit, for example, runs a mentorship-focused rotational program for recent graduates. Their goal is to facilitate a smooth transition from campus to career, which in turn <a rel=\"noreferrer noopener\" href=\"https:\/\/careers.intuit.com\/students\" target=\"_blank\">paves the way to higher retention rates<\/a>. IBM also<a href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-ibm-is-democratizing-information-for-students-across-the-country\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\"> offers an apprenticeship program<\/a> for career seekers across demographic groups, providing training, mentorship, and learning opportunities on the job.<br><br>Beyond building up programs, ensure your learning and professional development value propositions are clear and visible components of your hiring narrative.<\/p>\n\n\n\n<h2>4. Are you communicating the right value propositions in your employer brand?<\/h2>\n\n\n\n<p>Early talent cares about transparency and is doing their due diligence by researching employer brands before applying.<\/p>\n\n\n\n<p>Handshake found that 85% of Gen Z talent—and those graduating alongside them—research an employer’s website, employee reviews, and social media to understand an employer’s people, culture, and mission. Early talent wants to be sure that they can trust their future workplaces.<\/p>\n\n\n\n<p>As part of your company’s employer branding and storytelling efforts, make sure that your values are visible and clear:<\/p>\n\n\n\n<ul><li>Audit your careers page to ensure that your values are explicitly referenced and reflect your larger brand story. This resource from&nbsp;<a href=\"https:\/\/qz.com\/work\/1436421\/how-to-tell-if-your-companys-values-actually-matter\/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Quartz at Work<\/em><\/a>&nbsp;can help. Then take a look at&nbsp;<a href=\"https:\/\/www.aspiration.com\/who-we-are\/\" rel=\"noreferrer noopener\" target=\"_blank\">this values page<\/a>&nbsp;from Aspiration—a fintech company basing its growth on giving back.<\/li><li>Survey employees to learn how these values influence their work.<\/li><li>Personalize your employer brand assets to each segment. You can seamlessly do this with your Handshake employer profile. If a user&nbsp; identifies as a software engineer, for example, they&#8217;ll be able to see reviews &amp; testimonials from other software engineers on your page.<\/li><\/ul>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img loading=\"lazy\" width=\"619\" height=\"740\" src=\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Screen-Shot-2019-09-27-at-1.18.41-PM.png?resize=619%2C740&#038;ssl=1\" alt=\"\" class=\"wp-image-848\" srcset=\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Screen-Shot-2019-09-27-at-1.18.41-PM.png?w=619&amp;ssl=1 619w, https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Screen-Shot-2019-09-27-at-1.18.41-PM.png?resize=251%2C300&amp;ssl=1 251w\" sizes=\"(max-width: 619px) 100vw, 619px\" data-recalc-dims=\"1\" \/><\/figure><\/div>\n\n\n\n<p>Your goal, ultimately, is to create an experience that communicates your company’s mission and values in a bold, meaningful, and personalized way.&nbsp;<a href=\"https:\/\/about.nike.com\/\" rel=\"noreferrer noopener\" target=\"_blank\">Take a look at Nike&#8217;s company story<\/a>, and how they explain their commitment to everyone they serve.<\/p>\n\n\n\n<p>By being clear about your company’s values, you’ll attract stronger culture fits for your organization.<\/p>\n\n\n\n<h1>5. Are we reaching early talent&nbsp;<em>early<\/em>&nbsp;enough?<\/h1>\n\n\n\n<p>It’s important to reach early talent as early as possible.<\/p>\n\n\n\n<p>That’s because undergraduate college students start career-planning as early as their freshman or sophomore year. These groups are also open to internships, which are valuable pools through which your company can hire full-time.<\/p>\n\n\n\n<p>It pays off to build long-term relationships with candidates to support your long-term hiring needs. Here are a few steps that your business can take to reach prospective hires in advance of their graduation dates:<\/p>\n\n\n\n<ul><li>Start identifying profiles of your ideal early talent hires along with what they might be doing earlier on in their college careers.<\/li><li>Create educational materials tailored to students who still have time to go before graduation to help inform their career paths.<\/li><li>Consider attending <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/4-ways-to-prepare-for-on-campus-recruiting-this-fall\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">on-campus career fairs<\/a> or <a rel=\"noreferrer noopener\" href=\"https:\/\/democratizeopportunity.com\/leveraging-virtual-events-to-recruit-all-students-e060c59edabc\" target=\"_blank\">hosting a virtual event<\/a> on Handshake for students who are seeking internships.<\/li><\/ul>\n\n\n\n<p>Many companies already have early talent identification programs, internships, and fellowships in place.<br><br>In addition to helping you find future employees, internships and fellowships give early talent an opportunity to close the skills gap, foster a sense of leadership in current employees, increase organizational productivity, and more.<\/p>\n\n\n\n<p>For inspiration, take a look at <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-box-redesigned-their-hiring-process-to-build-a-more-diverse-and-inclusive-workforce\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Box’s Business Fellowship program<\/a>.<\/p>\n\n\n\n<p>This week-long program gives students exposure to different functional roles in tech, including sales, customer success, and recruiting. During this program, Box offers daily workshops to teach business essentials. Students also receive on-site mentorship, guidance from the company’s co-founders and executives, and insight into career opportunities.<\/p>\n\n\n\n<p>Another example comes from Facebook. The social media giant maintains<a href=\"https:\/\/www.facebook.com\/careers\/students-and-grads\/students\" rel=\"noreferrer noopener\" target=\"_blank\">&nbsp;a university career portal<\/a>&nbsp;that engages students from underrepresented communities in a hands-on, immersive program. Facebook also encourages interns to share their experiences, so early talent can gain trusted first-hand accounts&nbsp;<a href=\"https:\/\/www.businessinsider.com\/what-is-it-like-to-intern-at-facebook-2016-8\" rel=\"noreferrer noopener\" target=\"_blank\">behind the scenes<\/a>.<\/p>\n\n\n\n<h2>6. Are we reaching talent in a way that&#8217;s personally meaningful to them?<\/h2>\n\n\n\n<p>In Handshake’s student survey, 95% told us that they engage with employers that send personalized, proactive outreach. Take a look, for instance, at how SAS <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/sas-on-campus-hiring-top-university-talent-with-handshake\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">created a proactive recruiting engine<\/a>. <\/p>\n\n\n\n<p>A team of seven SAS university recruiters found that personalized messaging and targeted outreach reduces time to hire, improves SAS’s footprint on campuses where it has little-to-no presence, and creates virtual employer brand engagement.<\/p>\n\n\n\n<p>Meaningful, tailored outreach has the potential to make recruiting more effective. Get started by building the right messaging foundations:<\/p>\n\n\n\n<ul><li>Consider sharing behind-the-scenes content of your company.<\/li><li>Share content with consistency on your Handshake employer page to provide a sneak-peek into life at your company. Determine what gets the most engagement, understand who is most responsive, and analyze why certain content performs better than others.<\/li><li>Based on the data you collect about job seekers, build segments. This strategic planning enables recruiting teams to personalize programs at scale, which is especially important if your company finds itself with a need to staff roles quickly.<\/li><\/ul>\n\n\n\n<p>Keep in mind that as the “always-connected” generation, early talent is doing years of research when seeking professional opportunities.<\/p>\n\n\n\n<h2>7. Are we impacting core diversity and inclusion (D&amp;I) goals?<\/h2>\n\n\n\n<p>Research shows that D&amp;I programs help companies perform better.&nbsp;<a href=\"https:\/\/www.bcg.com\/en-us\/publications\/2018\/how-diverse-leadership-teams-boost-innovation.aspx\" rel=\"noreferrer noopener\" target=\"_blank\">A Boston Consulting Group study<\/a>&nbsp;found that companies with more diverse management teams have 19% higher revenues due to innovation.<\/p>\n\n\n\n<p>In addition to being good for business, D&amp;I programs have the potential to make a company’s early talent recruiting strategy more effective. Sixty-seven percent of students &amp; grads on Handshake agree that they would only work for an employer that&#8217;s built an inclusive company culture and provides a sense of belonging to all employees.<\/p>\n\n\n\n<ul><li>Ensure your recruiting materials and channels—including your website, social, job posts, and creatives—are inclusive.<\/li><li>Identify unconscious bias creep in your interview &amp; hiring process.&nbsp;<\/li><li>Feature the impact your employee resource groups (ERGs) or communities are making on your employer page, in recruiting materials, and on job and social media posts.<\/li><\/ul>\n\n\n\n<p>It doesn’t stop at first impressions—ensure your recruiting process is inclusive by incorporating inclusive language in your job descriptions, scraping names\/schools from application reviews, using consistent interview questions and rubrics, having representation in your interview process, and effectively communicating the hiring process, who you’re looking for, and why to prospective candidates.<\/p>\n\n\n\n<p>Committed to building equitable, balanced teams with a sense of belonging, take a look at how Atlassian—one of the most innovative and fastest-growing companies out there—approaches diversity&nbsp;<a href=\"https:\/\/www.atlassian.com\/belonging\" rel=\"noreferrer noopener\" target=\"_blank\">on this landing page<\/a>&nbsp;and in&nbsp;<a href=\"https:\/\/www.wired.com\/2017\/04\/tech-firms-striving-diversity-fixate-wrong-metric\/\" rel=\"noreferrer noopener\" target=\"_blank\">this WIRED article<\/a>.&nbsp;<\/p>\n\n\n\n<p>Atlassian also publishes an annual State of Diversity and Inclusion in U.S. Tech.&nbsp;<a href=\"https:\/\/www.atlassian.com\/diversity\/survey\/2018\" rel=\"noreferrer noopener\" target=\"_blank\">Access the latest edition<\/a>&nbsp;to inform your own employer branding and recruiting efforts.<\/p>\n\n\n\n<p>Early talent understands that diversity in the workforce isn’t a “nice to have,” it’s essential for a company’s core strategy and longevity.<\/p>\n\n\n\n<h2><strong>Final thoughts<\/strong><\/h2>\n\n\n\n<p>Your early talent recruiting strategy has the potential to transform your company. A new wave of talent—61 million people to be exact—is about to enter the workforce over the next several years and make a direct impact on the future economy.&nbsp;<\/p>\n\n\n\n<p>Entities of all types—and people responsible for hiring decisions—need to offer a thoughtful approach to early talent hiring. These questions will help your company build a proactive talent sourcing strategy and provide guidance for how to set up operations in the years to come.<br><br>Remember, Rome wasn’t built in a day—and neither should your program. Tackle each question until you feel comfortable moving onto the next, and keep in mind: your new hires have the potential to chart your organization into the future. Plan ahead to help them get there.<\/p>\n\n\n\n<p>Enjoyed this blog? For easy reference,&nbsp;<a href=\"https:\/\/go.joinhandshake.com\/Is-Your-Company-Ready-to-Hire-Early-Talent-Ask-These-7-Questions.html\" rel=\"noreferrer noopener\" target=\"_blank\">download a snapshot<\/a>&nbsp;of the 7 questions you need to ask to get your recruiting team early talent-ready.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Leverage these questions to guide your early talent recruiting strategy.<\/p>\n","protected":false},"author":167034976,"featured_media":847,"menu_order":0,"template":"","employers_category":[1416],"employers_tag":[1459],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Will Early Talent Want to Work for Your Company? Ask These 7 Questions<\/title>\n<meta name=\"description\" content=\"Leverage these questions to guide your early talent recruiting strategy.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Will Early Talent Want to Work for Your Company? Ask These 7 Questions\" \/>\n<meta property=\"og:description\" content=\"Leverage these questions to guide your early talent recruiting strategy.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2019-10-08T21:15:59+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Will-Early-Talent-Want-to-Work-for-Your-Company_-Ask-These-7-Questions-1024x683.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"683\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Will-Early-Talent-Want-to-Work-for-Your-Company_-Ask-These-7-Questions.jpeg?fit=6582%2C4388&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Will-Early-Talent-Want-to-Work-for-Your-Company_-Ask-These-7-Questions.jpeg?fit=6582%2C4388&ssl=1\",\"width\":6582,\"height\":4388},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/\",\"name\":\"Will Early Talent Want to Work for Your Company? Ask These 7 Questions\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#primaryimage\"},\"datePublished\":\"2019-09-25T15:00:45+00:00\",\"dateModified\":\"2019-10-08T21:15:59+00:00\",\"description\":\"Leverage these questions to guide your early talent recruiting strategy.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Will Early Talent Want to Work for Your Company? Ask These 7 Questions\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Will Early Talent Want to Work for Your Company? Ask These 7 Questions","description":"Leverage these questions to guide your early talent recruiting strategy.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/","og_locale":"en_US","og_type":"article","og_title":"Will Early Talent Want to Work for Your Company? Ask These 7 Questions","og_description":"Leverage these questions to guide your early talent recruiting strategy.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2019-10-08T21:15:59+00:00","og_image":[{"width":1024,"height":683,"path":"2019\/09\/Will-Early-Talent-Want-to-Work-for-Your-Company_-Ask-These-7-Questions-1024x683.jpeg","url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Will-Early-Talent-Want-to-Work-for-Your-Company_-Ask-These-7-Questions-1024x683.jpeg","size":"large","id":847,"alt":"","pixels":699392,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Will-Early-Talent-Want-to-Work-for-Your-Company_-Ask-These-7-Questions.jpeg?fit=6582%2C4388&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/09\/Will-Early-Talent-Want-to-Work-for-Your-Company_-Ask-These-7-Questions.jpeg?fit=6582%2C4388&ssl=1","width":6582,"height":4388},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/","name":"Will Early Talent Want to Work for Your Company? Ask These 7 Questions","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#primaryimage"},"datePublished":"2019-09-25T15:00:45+00:00","dateModified":"2019-10-08T21:15:59+00:00","description":"Leverage these questions to guide your early talent recruiting strategy.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/will-early-talent-want-to-work-for-your-company\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Will Early Talent Want to Work for Your Company? Ask These 7 Questions"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/846"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034976"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/847"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=846"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=846"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=846"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}