{"id":9493,"date":"2021-06-08T16:00:21","date_gmt":"2021-06-08T23:00:21","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=employers&#038;p=9493"},"modified":"2021-07-20T09:26:17","modified_gmt":"2021-07-20T16:26:17","slug":"how-to-incorporate-community-colleges-into-your-recruiting-program","status":"publish","type":"employers","link":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/","title":{"rendered":"How to Incorporate Community Colleges Into Your Recruiting Program"},"content":{"rendered":"\n<p>A cost-effective entry point into higher education, <a href=\"https:\/\/www.aacc.nche.edu\/wp-content\/uploads\/2021\/03\/AACC_2021_FastFacts.pdf\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>community colleges serve around 41% of all students in the US today<\/strong><\/a>. With a growing number of community colleges on Handshake, recruiting early talent from this pool will connect you with students who represent a mosaic of backgrounds, skills, and languages spoken.&nbsp;<\/p>\n\n\n\n<p>In this blog, we’ll address some of the many benefits of recruiting early talent from community colleges as an essential component of your equitable hiring strategy, along with tips for maximizing your impact.<\/p>\n\n\n\n<h2>Recruiting from community colleges is a critical component of any sustainable DEI strategy<\/h2>\n\n\n\n<p><a href=\"https:\/\/opportunityamericaonline.org\/wp-content\/uploads\/2020\/06\/Indispensable_Inst_FullReport.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">According to Opportunity America<\/a>, a think tank focused on economic mobility, around <strong>one in three community college students are first generation college students<\/strong>. <a href=\"https:\/\/www.ccdaily.com\/2020\/10\/why-are-community-colleges-doubling-down-on-language-learning\/\" target=\"_blank\" rel=\"noreferrer noopener\">English language learners are more likely to attend community college than a 4-year institution<\/a>, along with students who are low-income, veterans, and other underrepresented groups. Demographics of 2-year colleges are approximately 50% white and 50% Black or African American, Hispanic or Latinx, Asian American, and Native American.&nbsp;<\/p>\n\n\n\n<p>Recruiting community college students on Handshake is a meaningful action your company can take to bring critical skills and diversity to your workforce.&nbsp;<\/p>\n\n\n\n<p><strong>Be conscious of the “confidence gap”.<\/strong> Every school is full of students with skills and capabilities and community colleges are no exception, offering quality, affordable, and accessible education to students of all types of backgrounds. However, community college <a href=\"https:\/\/joinhandshake.com\/network-trends\/gender-equity\/\" target=\"_blank\" rel=\"noreferrer noopener\">students have concerns about being perceived as less qualified by employers<\/a>.&nbsp;<\/p>\n\n\n\n<p><strong>Students who attend a virtual 1:1 and receive a message from an employer are 1.5x more likely to apply<\/strong>, <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/handshakes-2020-campus-to-career-report\/\" target=\"_blank\" rel=\"noreferrer noopener\">so be proactive about reaching out<\/a>! Investing time in promising candidates no matter which institution they are enrolled in is critical to the success of your diversity, equity, and inclusion (DEI) recruitment strategies.&nbsp;<\/p>\n\n\n\n<p><strong>Create pipelines with upward mobility within your company.<\/strong> Save on recruitment costs by promoting interns to full-time roles and making return offers to high performers–<strong>early talent is where workforce diversification starts<\/strong>.&nbsp;<\/p>\n\n\n\n<h2>Community colleges and trade schools are at the forefront of in-demand, STEM, and “new collar” skills training<\/h2>\n\n\n\n<p>A common misperception is that community colleges don’t offer the same recruiting advantages as 4-year universities. <\/p>\n\n\n\n<p><strong>The top 3 industries that receive the most community college student applicants on Handshake are higher education, technology, and healthcare.<\/strong> With bootcamps and trade schools joining Handshake alongside a growing number of community colleges, students from these institutions are frequently training in specialized skills that can be <em>exactly<\/em> what you are looking for.<\/p>\n\n\n\n<p><strong>Look to technical colleges for jobs where specialized hard skills are needed.<\/strong> If you are hiring for positions like technicians, welders, dental assistants, or IT helpdesk associates, community and technical colleges have curricula dedicated to these and so many more career tracks.&nbsp;<\/p>\n\n\n\n<h6>Handshake Premium partner, <a href=\"https:\/\/www.up.com\/index.htm\" target=\"_blank\" rel=\"noreferrer noopener\">Union Pacific<\/a>, taps into Handshake’s growing network of community college partners to source for highly technical roles like “diesel mechanic.”<\/h6>\n\n\n\n<p><strong>Focus on skills gained through coursework.<\/strong> If a student is upskilling through relevant coursework and can receive additional training on the job, go ahead and reach out to them <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-recruiting-message-to-students-plus-examples\/\" target=\"_blank\" rel=\"noreferrer noopener\">with a personalized message<\/a>!&nbsp;<\/p>\n\n\n\n<p><strong>Sponsor equipment or trade workshops.<\/strong> Run an industry-specific class project that community college students can put on their resume, like a “<a href=\"https:\/\/joinhandshake.com\/blog\/employers\/rescinding-offers-3-reasons-to-support-early-talent-through-meaningful-project-based-work\/\" target=\"_blank\" rel=\"noreferrer noopener\">micro-internship<\/a>”. These skill-building opportunities can endear a student to your company’s brand and mission, and help them stand out once they’re ready to apply.&nbsp;<\/p>\n\n\n\n<h2>Early talent who attend community colleges can offer work experience<\/h2>\n\n\n\n<p>Students who are pursuing non-credit courses, are upskilling at bootcamps, or are enrolled in an associate’s program commonly work part- or full-time throughout their studies. The Center for Community College Engagement’s report on <a href=\"https:\/\/cccse.org\/sites\/default\/files\/WorkingLearner.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">The Intersection of Work and Learning<\/a> found that <strong>69% of students entering community college also work.&nbsp;<\/strong><\/p>\n\n\n\n<p>With the economy shapeshifting as a result of the pandemic, <a href=\"https:\/\/www.fastcompany.com\/90626709\/7-soft-skills-recruiters-value-during-uncertain-and-difficult-hiring-times\" target=\"_blank\" rel=\"noreferrer noopener\">soft skills are rising to the top of search criteria<\/a>. Community college students’ work experience gives them a leg up on time management, communication, and other soft skills that you’re looking for.&nbsp;<\/p>\n\n\n\n<p><strong>Revisit job qualifications.<\/strong> <a href=\"https:\/\/opportunityamericaonline.org\/wp-content\/uploads\/2020\/06\/Indispensable_Inst_FullReport.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Opportunity America<\/a> recommends experimenting with opening roles up to students enrolled in non-credit course work that are well aligned with career paths within your company. These job opportunities can be life changing, for example, for women returning to work after taking time out to raise kids, veterans who are reskilling, and other underrepresented groups across the age, experience, skills, and demographic spectrum.&nbsp;<\/p>\n\n\n\n<p><strong>Write inclusive job descriptions.<\/strong> Use language like “Associates degrees welcome,” etc. Avoid language like “those working toward a Bachelor’s degree” or mention of “juniors and seniors”, which speaks to a 4-year university student audience and can exclude community college students. Utilize Handshake Premium’s Segments, including the <a href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/360062099334\" target=\"_blank\" rel=\"noreferrer noopener\">ability to select “school years” when posting a job or internship<\/a>, to augment your inclusivity. Refer to our article, <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-write-a-clear-and-effective-job-description-for-students-in-2021\/\" target=\"_blank\" rel=\"noreferrer noopener\">How to Write a Clear and Effective Job Description for Students in 2021<\/a>, for more information.<\/p>\n\n\n\n<p><strong>Provide insights on potential career paths within an industry.<\/strong> Many students aren’t sure where to start in their job search, which is why Handshake is so popular! But for those who are the first in their families to attend college and\/or conduct a professional job search in the US, you can help expose them to career paths they might not have considered.&nbsp;<\/p>\n\n\n\n<p>For instance, when students think of banking, they may think they need to be good at math when there are so many other types of career paths that can be taken in banking, such as marketing, operations, analytics, etc. <strong>Leveraging alumni Ambassadors from your company<\/strong> is a great way to expose opportunities and engage students in your brand.&nbsp;<\/p>\n\n\n\n<h2>For harder to fill roles, consider partnering with your local community college<\/h2>\n\n\n\n<p>It can be challenging for companies located in suburban or rural areas to attract early talent to their location. Partnering with local community colleges is one way to stay competitive and democratize access to your job opportunities.&nbsp;<\/p>\n\n\n\n<p>This is particularly relevant for more technical roles that require specialized schooling or experience. Community colleges are eager to hear from and partner with employers, and use broader industry insights from your region to create demand-driven curricula.&nbsp;<\/p>\n\n\n\n<p><strong>Perform inclusive candidate searches.<\/strong> Include community colleges and technical schools in your student searches. Use Handshake Premium to <a href=\"https:\/\/support.joinhandshake.com\/hc\/en-us\/articles\/360019970434\" target=\"_blank\" rel=\"noreferrer noopener\">select major groups<\/a>, which have been recently updated to include community college trades like manufacturing, technicians, etc.&nbsp;<\/p>\n\n\n\n<p><strong>Offer paid internships through dedicated funding.<\/strong> Unpaid internships are a privilege that many students can’t afford. Paid internships create a more equitable environment across the board and show your workplace&#8217;s commitment to the wellbeing of your entry-level workers, no matter their background.<\/p>\n\n\n\n<p><strong>Participate in workforce planning with community colleges.<\/strong> They are eager to hear from employers to align programs with industry standards. This is a win-win-win for community colleges, students, and employers.&nbsp;Working with community colleges on demand-driven programming creates a strong regional feedback loop to supply local economies with the talent they need to thrive.&nbsp;<\/p>\n\n\n\n<h2>How Handshake’s 3-sided marketplace can help<\/h2>\n\n\n\n<p>Students from underrepresented groups are less likely to benefit from established professional networks, and, despite having some work experience, this is even more so the case for underrepresented groups who are community college students.&nbsp;That’s why Handshake partners with over 500k employers to give these students access to opportunities—<strong>no experience, connections, or luck required.<\/strong> You can, too, by:<\/p>\n\n\n\n<ol><li><strong>Developing new school partnerships.<\/strong> Use Handshake to <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/why-strong-msi-partnerships-lead-to-a-more-diverse-workforce\/\" target=\"_blank\" rel=\"noreferrer noopener\">build relationships<\/a> with community colleges as one way to diversify your qualified talent pool.<\/li><li><strong>Leaning into digital recruitment.<\/strong> Students can more flexibly attend events, coffee chats, and interviews that are virtual. Maintaining a virtual presence with community college students–and all students in the Handshake network–is helpful for building your brand awareness.<\/li><li><strong>Proactively asking if students have technical accommodations.<\/strong> The COVID-19 pandemic has exposed a digital divide and equity gap that affects underrepresented groups the most.<br><br>Some community college students face WiFi barriers or lack webcams. If they are unable to do virtual interviews from home, give them latitude if there is background noise from doing the interview in a public space.<br><br>Set students up for success; consider partnering with schools on virtual interview prep 1:1s or dedicate a group event to build awareness of what typical pitfalls might be. And <a href=\"https:\/\/joinhandshake.com\/blog\/employers\/6-employer-strategies-for-addressing-the-digital-divide\/\" target=\"_blank\" rel=\"noreferrer noopener\">leverage individual student messaging<\/a>–as Christine Cruzvergara, Handshake’s Chief Education Strategy Officer, said, “Even if students don’t have a great [internet] connection, and they’re not able to participate in a full event or have their video on, they can still answer a message.”<\/li><li><strong>Offering virtual events, fairs, and 1:1 meetings.<\/strong> Some community college students have dependent care responsibilities. Students in more rural areas might live a long drive away from campus. Virtual relationship-building can level the playing field by giving community college students a way to fit their internship and job searches into their demanding schedules.&nbsp;<\/li><li><strong>Pursuing skills-based hiring.<\/strong> Consider weighting skills and aptitudes more heavily than credentials. Skills-based hiring tactics include eliminating GPA and school from your candidate searches, and using skills to filter for talent instead.<\/li><\/ol>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;Even if students don&#8217;t have a great [internet] connection, and they&#8217;re not able to participate in a full event or have their video on, they can still answer a message.&#8221;<\/p><cite>Christine Cruzvergara, Chief Education Strategy Officer, Handshake<\/cite><\/blockquote>\n\n\n\n<h2>Closing thoughts<\/h2>\n\n\n\n<p><a href=\"https:\/\/www.forbes.com\/sites\/gradsoflife\/2021\/05\/27\/companies-hiring-from-community-colleges-have-a-leg-up-heres-why\/?sh=78bdcde23354\" target=\"_blank\" rel=\"noreferrer noopener\">The federal government has highlighted the need for more investment to reskill America by partnering with community colleges<\/a>. As we move toward post-pandemic economic recovery, community colleges can be one of the strongest levers to fill employers’ talent pipelines.&nbsp;Using Handshake to engage with community college students nationwide and create diverse and talented pipelines is a crucial action toward closing the opportunity gap. You can be the bridge to prosperity.&nbsp;<\/p>\n\n\n\n<p><strong>Get in touch! <\/strong><a href=\"https:\/\/joinhandshake.com\/employers\/request-more-info\/\" target=\"_blank\" rel=\"noreferrer noopener\">Let us know<\/a> if you’re already working with community colleges, technical schools, or boot camps–or if you need help connecting with any of these institutions. We’d like to help!<\/p>\n\n\n\n<p><a href=\"https:\/\/joinhandshake.com\/employers\/products\/premium\/\" target=\"_blank\" rel=\"noreferrer noopener\">Learn more about how Handshake Premium<\/a> can seamlessly support your addition of community colleges and technical schools to your early talent recruitment strategy.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Read on for tips to engage skilled, experienced talent from nearly 150 community and technical colleges on Handshake.<\/p>\n","protected":false},"author":167034991,"featured_media":9506,"menu_order":0,"template":"","employers_category":[1416],"employers_tag":[1459,1438,1450],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Incorporate Community Colleges Into Your Recruiting Program<\/title>\n<meta name=\"description\" content=\"Community and technical colleges are a growing population in Handshake’s network–and a crucial talent supply pipeline in today’s economy.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Incorporate Community Colleges Into Your Recruiting Program\" \/>\n<meta property=\"og:description\" content=\"Community and technical colleges are a growing population in Handshake’s network–and a crucial talent supply pipeline in today’s economy.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:modified_time\" content=\"2021-07-20T16:26:17+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2021\/06\/HS_BenefitsOfRecruitingFromCCs_BlogImage.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1440\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/06\/HS_BenefitsOfRecruitingFromCCs_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/06\/HS_BenefitsOfRecruitingFromCCs_BlogImage.jpg?fit=1440%2C960&ssl=1\",\"width\":1440,\"height\":960,\"caption\":\"How to Incorporate Community Colleges Into Your Recruiting Program\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/\",\"name\":\"How to Incorporate Community Colleges Into Your Recruiting Program\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#primaryimage\"},\"datePublished\":\"2021-06-08T23:00:21+00:00\",\"dateModified\":\"2021-07-20T16:26:17+00:00\",\"description\":\"Community and technical colleges are a growing population in Handshake\\u2019s network\\u2013and a crucial talent supply pipeline in today\\u2019s economy.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to Incorporate Community Colleges Into Your Recruiting Program\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Incorporate Community Colleges Into Your Recruiting Program","description":"Community and technical colleges are a growing population in Handshake’s network–and a crucial talent supply pipeline in today’s economy.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/","og_locale":"en_US","og_type":"article","og_title":"How to Incorporate Community Colleges Into Your Recruiting Program","og_description":"Community and technical colleges are a growing population in Handshake’s network–and a crucial talent supply pipeline in today’s economy.","og_url":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_modified_time":"2021-07-20T16:26:17+00:00","og_image":[{"width":1440,"height":960,"url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2021\/06\/HS_BenefitsOfRecruitingFromCCs_BlogImage.jpg","path":"\/srv\/htdocs\/wp-content\/uploads\/2021\/06\/HS_BenefitsOfRecruitingFromCCs_BlogImage.jpg","size":"full","id":9506,"alt":"How to Incorporate Community Colleges Into Your Recruiting Program","pixels":1382400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/06\/HS_BenefitsOfRecruitingFromCCs_BlogImage.jpg?fit=1440%2C960&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2021\/06\/HS_BenefitsOfRecruitingFromCCs_BlogImage.jpg?fit=1440%2C960&ssl=1","width":1440,"height":960,"caption":"How to Incorporate Community Colleges Into Your Recruiting Program"},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/","name":"How to Incorporate Community Colleges Into Your Recruiting Program","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#primaryimage"},"datePublished":"2021-06-08T23:00:21+00:00","dateModified":"2021-07-20T16:26:17+00:00","description":"Community and technical colleges are a growing population in Handshake’s network–and a crucial talent supply pipeline in today’s economy.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/employers\/how-to-incorporate-community-colleges-into-your-recruiting-program\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"How to Incorporate Community Colleges Into Your Recruiting Program"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers\/9493"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/employers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034991"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/9506"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=9493"}],"wp:term":[{"taxonomy":"employers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_category?post=9493"},{"taxonomy":"employers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/employers_tag?post=9493"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}