{"id":2563,"date":"2020-05-18T13:27:33","date_gmt":"2020-05-18T20:27:33","guid":{"rendered":"https:\/\/joinhandshake.com\/?p=2563"},"modified":"2020-05-19T12:32:40","modified_gmt":"2020-05-19T19:32:40","slug":"internships-in-new-york-city","status":"publish","type":"post","link":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/","title":{"rendered":"Your Guide to Internships in New York City"},"content":{"rendered":"\n<p>Besides fulfilling your childhood dreams of living in an exciting city, interning in New York City is a great launchpad for your career. New York is known for finance, media, and fashion internships and has a rich and vibrant theater, art, and intern scene.<\/p>\n\n\n\n<p>Summer internships provide you with many valuable experiences, giving a real taste of what it’ll be like to work in your preferred industry down the line. You’ll connect with potential mentors, learn trade secrets, and build relationships with coworkers with a range of expertise. Internships beef up resumes, provide valuable avenues to <a rel=\"noreferrer noopener\" href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-secure-a-letter-of-recommendation-from-your-internship\/\" target=\"_blank\">letters of recommendation<\/a>, and can even <a rel=\"noreferrer noopener\" href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-turn-your-internship-into-full-time\/\" target=\"_blank\">turn into full-time jobs<\/a>. If you consider all of these perks of interning and add the benefit of exploring a diverse city that’s full of opportunities, you have a very compelling list of reasons to intern in New York City.<\/p>\n\n\n\n<h4>Tips for your resume and profiles<\/h4>\n\n\n\n<p>Before you get started on sending out applications, make sure that you have your resume up to date and have fully filled out all <a href=\"http:\/\/joinhandshake.com\" target=\"_blank\" rel=\"noreferrer noopener\">your Handshake profile<\/a> details. With a complete profile, an impressive New York City internship is more attainable than ever. Recruiters are much more likely to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-wow-recruiters-that-message-you\/\" target=\"_blank\" rel=\"noreferrer noopener\">message a student<\/a> with a complete profile that says you want to work in NYC than an unfinished one.<\/p>\n\n\n\n<h4>Tips for your internship interview<\/h4>\n\n\n\n<p>When you do land your first interview, be it a <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-make-a-good-impression-in-a-virtual-job-interview\/\">virtual interview<\/a> or in person, make sure to come prepared and dressed to impress. Review your resume and cover letter to make sure you have specific examples of your experience to share, from clubs or coursework. You can even schedule a mock interview with your university’s career center or, if you’re tight on time, ask a trusted friend to grill you on <a href=\"https:\/\/joinhandshake.com\/blog\/students\/the-4-most-common-internship-interview-questions\/\" target=\"_blank\" rel=\"noreferrer noopener\">some common interview questions<\/a>.<\/p>\n\n\n\n<h4>Tips for networking at your internship<\/h4>\n\n\n\n<p>Once you’ve landed an internship in New York and settled into the flow of day-to-day life at the office, start chatting with your coworkers. Whether they’re industry professionals or fellow interns, it’s important to treat them with equal respect. You never know what insights they could lend, or who could be a valuable connection down the line, five or ten years from now. Don’t be afraid to ask your new colleagues out for quick coffee chats, or request 15-minute informational interviews about their career trajectory.<\/p>\n\n\n\n<h4>Want more tips for getting the most out of your internship?<\/h4>\n\n\n\n<p>Looking for specific advice before your internship begins? Or are you hungry for further information even after your internship is over? A good way to delve even deeper into your career path growth is to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-impress-employers-at-virtual-events\/\" target=\"_blank\" rel=\"noreferrer noopener\">attend a virtual event<\/a> or two. Not only will you be learning more about your own career, but there will also be chances to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-impress-employers-at-virtual-events\/\" target=\"_blank\" rel=\"noreferrer noopener\">network with employers<\/a>, industry specialists, and other students sharing different perspectives.<\/p>\n\n\n\n<h1>Where can I find an internship in NYC?<\/h1>\n\n\n\n<p>Here is a list of employers looking for interns in NYC, including some of the best finance internships in NYC:<\/p>\n\n\n\n<h4><a rel=\"noreferrer noopener\" href=\"https:\/\/app.joinhandshake.com\/employers\/9226\" target=\"_blank\">EY LLP<\/a><\/h4>\n\n\n\n<p>EY (also known as Ernst &amp; Young) is a multinational professional services firm–dealing with assurance, tax, consulting, and advisory.&nbsp;<\/p>\n\n\n\n<ul><li>Industry: Accounting<\/li><li>Types of roles: Accountants, Loan Interviews and Clerks, IT Analysts, and Consultants<\/li><li>Recommended applicants: You should consider applying at EY if you’ve taken courses in accounting and finance or want to gain experience in the accounting field.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/amazon-22003\" target=\"_blank\" rel=\"noreferrer noopener\">Amazon<\/a><\/h4>\n\n\n\n<p>Amazon is the largest digital marketplace with branches in streaming, AI, and cloud computing.<\/p>\n\n\n\n<ul><li>Industry: Internet &amp; Software<\/li><li>Types of roles: Software Developers and Engineers, Administrative Services Managers, Business Analysts, and Management Consultants<\/li><li>Recommended applicants: An Amazon internship could be a good fit if you’re interested in a workplace with a wide variety of job opportunities, and believe your major and skillset to be a match to your specific desired role.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/14072\" target=\"_blank\" rel=\"noreferrer noopener\">Goldman Sachs<\/a><\/h4>\n\n\n\n<p>Goldman Sachs is a global investment banking and financial services company that offers services in investment management, assets, brokerage, and securities underwriting.<\/p>\n\n\n\n<ul><li>Industry: Investment Banking<\/li><li>Types of roles: Accountants, Business Analysts and Management Consultants, Investment Banking Analysts<\/li><li>Recommended applicants: Consider applying for a Goldman Sachs internship if you’re majoring in business or accounting, or have taken applicable courses in management or accounting.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/8530\" target=\"_blank\" rel=\"noreferrer noopener\">KPMG LLP<\/a><\/h4>\n\n\n\n<p>KPMG LLP is a global network of professional firms providing audit, tax, and advisory services.<\/p>\n\n\n\n<ul><li>Industry: Accounting<\/li><li>Types of roles: Accountants, Auditors, Marketing Managers, and Specialists<\/li><li>Recommended applicants: Look into KPMG internships if you’re majoring in accounting or finance, or if you’ve taken applicable courses in accounting, marketing, or finance.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/22502\" target=\"_blank\" rel=\"noreferrer noopener\">Citi<\/a><\/h4>\n\n\n\n<p>Citi is a leading global bank focused on safeguarding assets, lending money, making payments, and accessing capital markets for clients.<\/p>\n\n\n\n<ul><li>Industry: Investment Banking<\/li><li>Types of roles: Commercial and Corporate Bankers, Data Analysts, Software Developers, and Engineers<\/li><li>Recommended applicants: Citi could be a great place to intern if you’re majoring in business, or have taken applicable courses in finance or economics.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/15688\" target=\"_blank\" rel=\"noreferrer noopener\">Bloomberg<\/a><\/h4>\n\n\n\n<p>Bloomberg is a financial and news company that provides business and market news, insight, data, and analysis.&nbsp;<\/p>\n\n\n\n<ul><li>Industry: Business &amp; News<\/li><li>Types of roles: Data Analysts, Journalists, Reporters<\/li><li>Recommended applicants: Consider internships at Bloomberg if you’re majoring in business or journalism, or have taken courses in business analytics, journalism, or communications.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/31817\" target=\"_blank\" rel=\"noreferrer noopener\">The New York Times<\/a><\/h4>\n\n\n\n<p><em>The New York Times<\/em> is a newspaper and global media organization that reports and delivers world news.&nbsp;&nbsp;<\/p>\n\n\n\n<ul><li>Industry: Media &amp; Publishing<\/li><li>Types of roles: Journalists, Reporters, Sales Agents<\/li><li>Recommended applicants: Apply for a <em>NYT<\/em> internship if you’re majoring in journalism, English, or media studies, or if you’ve taken journalism classes and are interested in pursuing a career in the publishing field.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/39292\" target=\"_blank\" rel=\"noreferrer noopener\">Jefferies, LLC<\/a><\/h4>\n\n\n\n<p>Blurb: Jefferies, LLC is a multinational investment banking firm offering services in investment, sales, trading, research and strategy.<\/p>\n\n\n\n<ul><li>Industry: Investment &amp; Portfolio Management<\/li><li>Types of roles: Investment Banking Analysts<\/li><li>Recommended applicants: You should consider applying to Jefferies if you’re majoring business or math, or have taken a few finance or economics courses and are interested in following a career in investment banking.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/18323\" target=\"_blank\" rel=\"noreferrer noopener\">United Nations<\/a><\/h4>\n\n\n\n<p>The United Nations is an intergovernmental organization with a goal of maintaining international peace and developing friendly relations with other nations.<\/p>\n\n\n\n<ul><li>Industry: International Affairs<\/li><li>Types of roles: Administrative Services Managers, Public Policy and Government Affairs, Data Analysts<\/li><li>Recommended applicants: Look into UN internships if you’re majoring in international business, political science, or have taken courses in international business and are interested in pursuing a career in international affairs.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/15978\" target=\"_blank\" rel=\"noreferrer noopener\">Credit Suisse<\/a><\/h4>\n\n\n\n<p>Credit Suisse is a leading investment bank and financial services company.<\/p>\n\n\n\n<ul><li>Industry: Investment &amp; Portfolio Management<\/li><li>Types of roles: Auditors, Business Analysts and Management Consultants, Investment Banking Analysts<\/li><li>Recommended applicants: Apply for a Credit Suisse internship if you’re majoring in business or entrepreneurship, or have taken applicable courses in economics or finance.<\/li><\/ul>\n\n\n\n<h1>Tips and tricks to surviving your NYC internship<\/h1>\n\n\n\n<p>If you’re a transplant or even if you’ve called New York City home forever, it never hurts to review advice for living in the city during your internship.<\/p>\n\n\n\n<p><strong>Buy a MetroCard<\/strong><\/p>\n\n\n\n<p>No matter where your apartment is located or where you’re commuting to, you’re almost always going to need public transportation to get there. Your destination is always $2.75 away. Purchasing a <a href=\"http:\/\/web.mta.info\/metrocard\/mcgtreng.htm\" target=\"_blank\" rel=\"noreferrer noopener\">MetroCard<\/a> is highly recommended to make reloading funds a breeze.<\/p>\n\n\n\n<p>If you’re frequently commuting and feeling savvy, go for the 30-day pass! For $127 you’ll be able to mindlessly ride the subway during busy commute hours and have swipes for extra errands on the weekends.&nbsp;<\/p>\n\n\n\n<p><strong>Don’t get (too) lost, download Citymapper<\/strong><\/p>\n\n\n\n<p>This transit <a href=\"https:\/\/citymapper.com\/?lang=en\" target=\"_blank\" rel=\"noreferrer noopener\">app<\/a> will help get you oriented to the city and find the right connections to wherever you’re going.<\/p>\n\n\n\n<p><strong>4 essential NYC restaurants to try during your internship&nbsp;<\/strong><\/p>\n\n\n\n<ol><li>Carbone<\/li><li>Blue Hill Farm<\/li><li>Scarrs<\/li><li>Los Tacos No. 1<\/li><\/ol>\n\n\n\n<p><strong>Things to experience during your time in NYC<\/strong><\/p>\n\n\n\n<ol><li>Whitney Museum of American Art<\/li><li>The Metropolitan Museum of Art<\/li><li>Central Park<\/li><li>Brooklyn Bridge<\/li><li>Empire State Building<\/li><\/ol>\n\n\n\n<p><strong>3 neighborhoods to considering living in during your internship<\/strong><\/p>\n\n\n\n<ol><li>Bushwick<\/li><li>Bed-Stuy<\/li><li>Ridgewood<\/li><\/ol>\n\n\n\n<h4>How do I find an apartment in NYC?<\/h4>\n\n\n\n<p>Consider these resources to help your NYC apartment search:<\/p>\n\n\n\n<ol><li><a href=\"https:\/\/streeteasy.com\/rentals\" target=\"_blank\" rel=\"noreferrer noopener\">StreetEasy<\/a><\/li><li><a href=\"https:\/\/www.zillow.com\/new-york-ny\/apartments\/\" target=\"_blank\" rel=\"noreferrer noopener\">Zillow<\/a><\/li><li><a href=\"https:\/\/interns.nyc\/\" target=\"_blank\" rel=\"noreferrer noopener\">Intern Housing NYC<\/a><\/li><li><a href=\"https:\/\/roomiapp.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Roomi<\/a><\/li><li>Join a New York City Housing, Rooms, Apartments, and Sublets group on Facebook<\/li><\/ol>\n\n\n\n<h4>Where to order food from in NYC?<\/h4>\n\n\n\n<ol><li><a href=\"https:\/\/www.grubhub.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">GrubHub<\/a><\/li><li><a href=\"https:\/\/postmates.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Postmates<\/a><\/li><li><a href=\"https:\/\/www.seamless.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Seamless<\/a><\/li><li><a href=\"https:\/\/www.trycaviar.com\/marketplaces\/new-york-city-ny\" target=\"_blank\" rel=\"noreferrer noopener\">Caviar<\/a><\/li><li>Check out your neighborhood’s local delivery restaurants<\/li><\/ol>\n\n\n\n<h1>Finding an internship in New York City<\/h1>\n\n\n\n<h4>How do I find <a href=\"https:\/\/joinhandshake.com\/blog\/students\/considering-a-paid-internship-read-this-first\/\" target=\"_blank\" rel=\"noreferrer noopener\">paid internships<\/a> in NYC?<\/h4>\n\n\n\n<p>When searching for a paid internship in New York City, it’s key to use <a href=\"https:\/\/joinhandshake.com\/blog\/students\/find-a-job-using-handshakes-filter-functions\/\" target=\"_blank\" rel=\"noreferrer noopener\">the location filters provided on Handshake<\/a>. You’ll be able to pinpoint internships exactly where you want to intern just by selecting the city you want in the search bar.<\/p>\n\n\n\n<p>You can also research top companies in New York City by visiting <a href=\"https:\/\/app.joinhandshake.com\/employers\" target=\"_blank\" rel=\"noreferrer noopener\">our list of Handshake employers<\/a> and typing New York City into the “Location” search bar. This way you’ll be able to see employers in your desired location. Once on the company’s page, you can read <a href=\"https:\/\/app.joinhandshake.com\/employers\/20430#reviews\" target=\"_blank\" rel=\"noreferrer noopener\">reviews<\/a> from students who have interned there or study up on some <a href=\"https:\/\/app.joinhandshake.com\/employers\/20430#interviews\" target=\"_blank\" rel=\"noreferrer noopener\">interview questions<\/a>.<\/p>\n\n\n\n<h4>Where do interns live in NYC?<\/h4>\n\n\n\n<p>To find rentals, many interns use resources like StreetEasy, Roomi, and other sites specifically for apartment hunting. If you have any connections in the city, it’s also always good to consider those first.<\/p>\n\n\n\n<p>To start your hunt, try searching in popular neighborhoods like Bushwick, Bed-Stuy, or Ridgewood.<\/p>\n\n\n\n<h4>How can an intern live in NYC?<\/h4>\n\n\n\n<p>Moving to a new city is equal parts exciting and nerve wracking–make sure you have all your details squared away for your internship before you pack your bags.&nbsp;<\/p>\n\n\n\n<p>Here are a few things to consider:<\/p>\n\n\n\n<ul><li>Have you checked out <a href=\"https:\/\/joinhandshake.com\/blog\/students\/5-ways-college-students-are-landing-internships-right-now\/\" target=\"_blank\" rel=\"noreferrer noopener\">tips on how to land an internship<\/a>?<\/li><li>Do you need your internship to provide compensation?<\/li><li>Are you renting in an affordable neighborhood?<\/li><li>Are you comfortable using the subway frequently?<\/li><li>Will the food options available work for you?<\/li><\/ul>\n\n\n\n<h4>How can I get an internship without experience in NYC?<\/h4>\n\n\n\n<p>If you don’t have previous experience and want to kickstart your first internship in NYC, don’t fret! There are definitely ways to land that role you’ve had your eyes on.<\/p>\n\n\n\n<p>Start by reviewing your resume! Read it over a couple of times and then consider the types of internships you’re going to be applying for. Think back to courses you’ve taken at university, as well as any extracurriculars, volunteer work, or even organizations (clubs or greek life for example) that you’ve participated in. Organize the skills that you’ve gained from those experiences and add them to your resume and Handshake profile. Even though you might not have held an internship or job before, there are still ways to prove your worth through other skills and experiences.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Looking for paid summer internships in New York City? Start with this comprehensive guide.<\/p>\n","protected":false},"author":167034980,"featured_media":2568,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_anchor_podcast":"","jetpack_anchor_episode":"","jetpack_anchor_spotify_show":""},"categories":[1494],"tags":[1368,1514],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Your Guide to Internships in New York City | Handshake<\/title>\n<meta name=\"description\" content=\"Learn how to find a paid summer internship in New York City, where to intern in NYC, and read tips for surviving internships in New York.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Your Guide to Internships in New York City | Handshake\" \/>\n<meta property=\"og:description\" content=\"Learn how to find a paid summer internship in New York City, where to intern in NYC, and read tips for surviving internships in New York.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:published_time\" content=\"2020-05-18T20:27:33+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-19T19:32:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/people-standing-on-brown-bridge-2260784-1024x683.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"683\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"handshakejulie\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/people-standing-on-brown-bridge-2260784.jpg?fit=5404%2C3603&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/people-standing-on-brown-bridge-2260784.jpg?fit=5404%2C3603&ssl=1\",\"width\":5404,\"height\":3603},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/\",\"name\":\"Your Guide to Internships in New York City | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#primaryimage\"},\"datePublished\":\"2020-05-18T20:27:33+00:00\",\"dateModified\":\"2020-05-19T19:32:40+00:00\",\"description\":\"Learn how to find a paid summer internship in New York City, where to intern in NYC, and read tips for surviving internships in New York.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Your Guide to Internships in New York City\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#webpage\"},\"author\":{\"@id\":\"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16\"},\"headline\":\"Your Guide to Internships in New York City\",\"datePublished\":\"2020-05-18T20:27:33+00:00\",\"dateModified\":\"2020-05-19T19:32:40+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#webpage\"},\"wordCount\":1769,\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/people-standing-on-brown-bridge-2260784.jpg?fit=5404%2C3603&ssl=1\",\"keywords\":[\"internships for college students\",\"new york city\"],\"articleSection\":[\"Research career paths\"],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16\",\"name\":\"handshakejulie\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g\",\"caption\":\"handshakejulie\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Your Guide to Internships in New York City | Handshake","description":"Learn how to find a paid summer internship in New York City, where to intern in NYC, and read tips for surviving internships in New York.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/","og_locale":"en_US","og_type":"article","og_title":"Your Guide to Internships in New York City | Handshake","og_description":"Learn how to find a paid summer internship in New York City, where to intern in NYC, and read tips for surviving internships in New York.","og_url":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_published_time":"2020-05-18T20:27:33+00:00","article_modified_time":"2020-05-19T19:32:40+00:00","og_image":[{"width":1024,"height":683,"path":"2020\/05\/people-standing-on-brown-bridge-2260784-1024x683.jpg","url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/people-standing-on-brown-bridge-2260784-1024x683.jpg","size":"large","id":2568,"alt":"","pixels":699392,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@joinhandshake","twitter_site":"@joinhandshake","twitter_misc":{"Written by":"handshakejulie","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/people-standing-on-brown-bridge-2260784.jpg?fit=5404%2C3603&ssl=1","contentUrl":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/people-standing-on-brown-bridge-2260784.jpg?fit=5404%2C3603&ssl=1","width":5404,"height":3603},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/","name":"Your Guide to Internships in New York City | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#primaryimage"},"datePublished":"2020-05-18T20:27:33+00:00","dateModified":"2020-05-19T19:32:40+00:00","description":"Learn how to find a paid summer internship in New York City, where to intern in NYC, and read tips for surviving internships in New York.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Your Guide to Internships in New York City"}]},{"@type":"Article","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#article","isPartOf":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#webpage"},"author":{"@id":"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16"},"headline":"Your Guide to Internships in New York City","datePublished":"2020-05-18T20:27:33+00:00","dateModified":"2020-05-19T19:32:40+00:00","mainEntityOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#webpage"},"wordCount":1769,"publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"image":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-new-york-city\/#primaryimage"},"thumbnailUrl":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/people-standing-on-brown-bridge-2260784.jpg?fit=5404%2C3603&ssl=1","keywords":["internships for college students","new york city"],"articleSection":["Research career paths"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16","name":"handshakejulie","image":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g","caption":"handshakejulie"}}]}},"jetpack_featured_media_url":"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/people-standing-on-brown-bridge-2260784.jpg?fit=5404%2C3603&ssl=1","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts\/2563"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034980"}],"replies":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/comments?post=2563"}],"version-history":[{"count":7,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts\/2563\/revisions"}],"predecessor-version":[{"id":2596,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts\/2563\/revisions\/2596"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/2568"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=2563"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/categories?post=2563"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/tags?post=2563"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}