{"id":2587,"date":"2020-05-19T12:00:42","date_gmt":"2020-05-19T19:00:42","guid":{"rendered":"https:\/\/joinhandshake.com\/?p=2587"},"modified":"2020-05-19T12:00:43","modified_gmt":"2020-05-19T19:00:43","slug":"internships-in-chicago","status":"publish","type":"post","link":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/","title":{"rendered":"Your Guide to Internships in Chicago"},"content":{"rendered":"\n<p>Besides fulfilling your childhood dreams of living in a bustling city, interning in Chicago is a great launchpad for your career. Chicago is known for its finance, engineering, medical, and publishing internships, and has a thriving sports, culinary, and intern scene. <\/p>\n\n\n\n<p>Summer internships provide you with many valuable experiences, giving a real taste of what it’ll be like to work in your preferred industry down the line. You’ll connect with potential mentors, learn trade secrets, and build relationships with coworkers with a range of expertise. Internships beef up resumes, provide valuable avenues to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-secure-a-letter-of-recommendation-from-your-internship\/\" target=\"_blank\" rel=\"noreferrer noopener\">letters of recommendation<\/a>, and can even <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-turn-your-internship-into-full-time\/\" target=\"_blank\" rel=\"noreferrer noopener\">turn into full-time jobs<\/a>. If you consider all of these perks of interning and add the benefit of exploring a diverse city that’s full of opportunities, you have a very compelling list of reasons to intern in Chicago. Continue reading along for tips on how to find the best paid summer or spring internships in Chicago.<\/p>\n\n\n\n<h4>Tips for your resume and profiles<\/h4>\n\n\n\n<p>Before you get started on sending out applications, make sure that you have your resume up to date and have fully filled out all <a href=\"http:\/\/joinhandshake.com\" target=\"_blank\" rel=\"noreferrer noopener\">your Handshake profile<\/a> details. With a complete profile, an impressive Chicago internship is more attainable than ever. Recruiters are much more likely to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-wow-recruiters-that-message-you\/\" target=\"_blank\" rel=\"noreferrer noopener\">message a student<\/a> with a complete profile that says you want to work in Chicago than an unfinished one.<\/p>\n\n\n\n<h4>Tips for your internship interview<\/h4>\n\n\n\n<p>When you do land your first interview, be it a <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-make-a-good-impression-in-a-virtual-job-interview\/\" target=\"_blank\" rel=\"noreferrer noopener\">virtual interview<\/a> or in person, make sure to come prepared and dressed to impress. Review your resume and cover letter to make sure you have specific examples of your experience to share, from clubs or coursework. You can even schedule a mock interview with your university’s career center or, if you’re tight on time, ask a trusted friend to grill you on <a href=\"https:\/\/joinhandshake.com\/blog\/students\/the-4-most-common-internship-interview-questions\/\" target=\"_blank\" rel=\"noreferrer noopener\">some common interview questions<\/a>.<\/p>\n\n\n\n<h4>Tips for networking at your college internship<\/h4>\n\n\n\n<p>Once you’ve landed an internship in Chicago and settled into the flow of day-to-day life at the office, start chatting with your coworkers. Whether they’re industry professionals or fellow interns, it’s important to treat them with equal respect. You never know what insights they could lend, or who could be a valuable connection down the line, five or ten years from now. Don’t be afraid to ask your new colleagues out for quick coffee chats, or request 15-minute informational interviews about their career trajectory.<\/p>\n\n\n\n<h4>Want more tips for getting the most out of your internship?<\/h4>\n\n\n\n<p>Looking for specific advice before your internship begins? Or are you hungry for further information even after your internship is over? A good way to delve even deeper into your career path growth is to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-impress-employers-at-virtual-events\/\" target=\"_blank\" rel=\"noreferrer noopener\">attend a virtual event<\/a> or two. Not only will you be learning more about your own career, but there will also be chances to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-impress-employers-at-virtual-events\/\" target=\"_blank\" rel=\"noreferrer noopener\">network with employers<\/a>, industry specialists, and other students sharing different perspectives.<\/p>\n\n\n\n<h1>Where can I find an internship in Chicago?<\/h1>\n\n\n\n<p>Here is a list of employers looking for interns in Chicago, including some of the best summer internships in Chicago:<\/p>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/14072\" target=\"_blank\" rel=\"noreferrer noopener\">Goldman Sachs<\/a><\/h4>\n\n\n\n<p>Goldman Sachs is a global investment banking and financial services company that offers services in investment management, assets, brokerage, and securities underwriting.<\/p>\n\n\n\n<ul><li>Industry: Investment Banking<\/li><li>Types of roles: Accountants, Business Analysts and Management Consultants, Investment Banking Analysts<\/li><li>Recommended applicants: Apply for a Goldman Sachs internship if you’re majoring in business or accounting, or have taken applicable courses in management or accounting.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/15978\" target=\"_blank\" rel=\"noreferrer noopener\">Credit Suisse<\/a><\/h4>\n\n\n\n<p>Credit Suisse is a leading investment bank and financial services company.<\/p>\n\n\n\n<ul><li>Industry: Investment &amp; Portfolio Management<\/li><li>Types of roles: Auditors, Business Analysts and Management Consultants, Investment Banking Analysts<\/li><li>Recommended applicants: Apply for a Credit Suisse internship if you’re majoring in business or entrepreneurship, or have taken applicable courses in economics or finance.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/388710\" target=\"_blank\" rel=\"noreferrer noopener\">Ignite Mental Health<\/a><\/h4>\n\n\n\n<p>Ignite Mental Health is non-profit that focuses on mobilizing, supporting, and uniting world-class mental health entrepreneurs and organizations.<\/p>\n\n\n\n<ul><li>Industry: Non-Profit<\/li><li>Types of roles: Advertising and Promotions Managers, Human Resources Managers and Specialists, Public Relations Managers and Specialists<\/li><li>Recommended applicants: Apply for an Ignite Mental Health internship if you’re majoring in business or advertisements, or have taken applicable courses in business administration or marketing.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/39712\" target=\"_blank\" rel=\"noreferrer noopener\">Cowen<\/a><\/h4>\n\n\n\n<p>Cowen is a diversified financial services firm offering investment banking, equity and credit research, sales, brokerage and other services to their clients.<\/p>\n\n\n\n<ul><li>Industry: Investment Banking<\/li><li>Types of roles: Investment Banking Analysts<\/li><li>Recommended applicants: Apply for an internship at Cowen if you’re majoring in finance or math, or have taken applicable courses in either of these fields.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/13431\" target=\"_blank\" rel=\"noreferrer noopener\">LaSalle Network<\/a><\/h4>\n\n\n\n<p>LaSalle Network is a staging, recruiting, and culture firm.<\/p>\n\n\n\n<ul><li>Industry: Human Resources<\/li><li>Types of roles: Customer Service Representatives, Marketing Managers and Specialists, Public Relations Managers and Specialists<\/li><li>Recommended applicants: Apply for an internship at LaSalle Network if you’re majoring in public relations or marketing, or have taken applicable courses in marketing or business administration.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/29595\" target=\"_blank\" rel=\"noreferrer noopener\">Moelis &amp; Company<\/a><\/h4>\n\n\n\n<p>Moelis &amp; Company is a leading global independent investment bank that provides strategic advice and solutions to diverse clients.<\/p>\n\n\n\n<ul><li>Industry: Investment Banking<\/li><li>Types of roles: Investment Banking Analysts<\/li><li>Recommended applicants: Apply for an internship at Moelis &amp; Company if you’re majoring in finance or business, or have taken applicable courses in either of these fields.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/17318\" target=\"_blank\" rel=\"noreferrer noopener\">Zurich North America<\/a><\/h4>\n\n\n\n<p>Zurich North America is a leading multi-line insurance provider with a global network of subsidiaries and offices.<\/p>\n\n\n\n<ul><li>Industry: Insurance<\/li><li>Types of roles: Business Analysts and Management Consultants, Data Analysts, Insurance Underwriters<\/li><li>Recommended applicants: Apply for an internship at Zurich North America if you’re majoring in business or computer science, or have taken any applicable courses in either of these fields.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/10792\" target=\"_blank\" rel=\"noreferrer noopener\">Milliman<\/a><\/h4>\n\n\n\n<p>Milliman is a global actuary and consulting firm.<\/p>\n\n\n\n<ul><li>Industry: Management Consulting<\/li><li>Types of roles: Business Analysts and Management Consultants, Credit and Financial Risk Managers, IT Analysts&nbsp;<\/li><li>Recommended applicants: Apply for an internship at Milliman if you’re majoring in business or&nbsp; finance, or have taken applicable courses in either of these fields.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/14991\" target=\"_blank\" rel=\"noreferrer noopener\">Perfect Search Media<\/a><\/h4>\n\n\n\n<p>Perfect Search Media is a digital marketing agency.<\/p>\n\n\n\n<ul><li>Industry: Advertising, PR &amp; Marketing<\/li><li>Types of roles: Advertising and Promotions Managers, Marketing Managers and Specialists, Writers and Authors<\/li><li>Recommended applicants: Apply for an internship at Perfect Search Media if you’re majoring in marketing or advertising, or have taken applicable courses in either of these fields.<\/li><\/ul>\n\n\n\n<p>For the best summer internships in Chicago, consider the list above and apply!<\/p>\n\n\n\n<h1>Tips and tricks to surviving your Chicago internship<\/h1>\n\n\n\n<p>If you’re a transplant or even if you’ve called Chicago City home forever, it never hurts to review advice for living in the city during your internship. After you’ve figured out how to get an internship in Chicago, think about the other parts of your internship journey.<\/p>\n\n\n\n<h4>Buy a Ventra Card<\/h4>\n\n\n\n<p>No matter where your apartment is located or where you’re commuting to, you’re almost always going to need a vehicle or public transportation to get there. If you’re not driving to your internship, a <a href=\"https:\/\/www.ventrachicago.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Ventra Card<\/a> is highly recommended to make reloading funds a breeze.<\/p>\n\n\n\n<p>If you’re frequently commuting and feeling savvy, go for the 30-day pass! For $105 you’ll be able to mindlessly ride transit during busy commute hours and have swipes for extra errands on the weekends.&nbsp;<\/p>\n\n\n\n<h4>Don’t get (too) lost, download Citymapper<\/h4>\n\n\n\n<p>This transit <a href=\"https:\/\/citymapper.com\/?lang=en\" target=\"_blank\" rel=\"noreferrer noopener\">app<\/a> will help get you oriented to the city and find the right connections to wherever you’re going.<\/p>\n\n\n\n<h4>4 essential Chicago restaurants to try during your internship&nbsp;<\/h4>\n\n\n\n<ol><li>Orioli<\/li><li>Superdawg Drive-In<\/li><li>Vito &amp; Nick’s Pizzeria&nbsp;<\/li><li>Pequod’s<\/li><\/ol>\n\n\n\n<h4>Things to experience during your time in Chicago<\/h4>\n\n\n\n<ol><li>The Art Institute of Chicago<\/li><li>Cloud Gate<\/li><li>360 Chicago Observation Deck<\/li><li>Grant Park<\/li><\/ol>\n\n\n\n<h4>4 neighborhoods to considering living in during your internship<\/h4>\n\n\n\n<ol><li>Lakeview<\/li><li>Lincoln Park<\/li><li>Edgewater<\/li><li>Old Town<\/li><\/ol>\n\n\n\n<h4>How do I find an apartment in Chicago?<\/h4>\n\n\n\n<p>Consider these resources to help your Chicago apartment search:<\/p>\n\n\n\n<ol><li><a href=\"https:\/\/www.domu.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Domu<\/a><\/li><li><a href=\"https:\/\/www.zillow.com\/chicago-il\/apartments\/\" target=\"_blank\" rel=\"noreferrer noopener\">Zillow<\/a><\/li><li><a href=\"https:\/\/hotpads.com\/chicago-il\/apartments-for-rent\" target=\"_blank\" rel=\"noreferrer noopener\">Hotpads<\/a><\/li><li><a href=\"https:\/\/www.chicagosummerhousing.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Chicago Summer Housing<\/a><\/li><li>Join a Chicago Housing, Rooms, Apartments, and Sublets group on Facebook<\/li><\/ol>\n\n\n\n<h4>Where to order food from in Chicago?<\/h4>\n\n\n\n<ol><li><a href=\"https:\/\/www.grubhub.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">GrubHub<\/a><\/li><li><a href=\"https:\/\/postmates.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Postmates<\/a><\/li><li><a href=\"https:\/\/www.doordash.com\/en-US\" target=\"_blank\" rel=\"noreferrer noopener\">DoorDash<\/a><\/li><li><a href=\"https:\/\/www.trycaviar.com\/chicago\" target=\"_blank\" rel=\"noreferrer noopener\">Caviar<\/a><\/li><li>Check out your neighborhood’s local delivery restaurants<\/li><\/ol>\n\n\n\n<h1>Finding an internship in Chicago<\/h1>\n\n\n\n<h4>How do I find <a href=\"https:\/\/joinhandshake.com\/blog\/students\/considering-a-paid-internship-read-this-first\/\" target=\"_blank\" rel=\"noreferrer noopener\">paid internships<\/a> in Chicago?<\/h4>\n\n\n\n<p>When searching for a paid internship in Chicago, it’s key to use <a href=\"https:\/\/joinhandshake.com\/blog\/students\/find-a-job-using-handshakes-filter-functions\/\" target=\"_blank\" rel=\"noreferrer noopener\">the location filters provided on Handshake<\/a>. You’ll be able to pinpoint internships exactly where you want to intern just by selecting the city you want in the search bar. Easy internships in Chicago are just a search away.<\/p>\n\n\n\n<p>You can also research top companies in Chicago by visiting <a href=\"https:\/\/app.joinhandshake.com\/employers\" target=\"_blank\" rel=\"noreferrer noopener\">our list of Handshake employers<\/a> and typing Chicago into the “Location” search bar. This way you’ll be able to see employers in your desired location. Once on the company’s page, you can read <a href=\"https:\/\/app.joinhandshake.com\/employers\/14826#reviews\" target=\"_blank\" rel=\"noreferrer noopener\">reviews<\/a> from students who have interned there or study up on some <a href=\"https:\/\/app.joinhandshake.com\/employers\/14826#interviews\" target=\"_blank\" rel=\"noreferrer noopener\">interview questions<\/a>.<\/p>\n\n\n\n<h4>Where do interns live in Chicago?<\/h4>\n\n\n\n<p>To find rentals, many interns use resources like Domu, Zillow, and other sites specifically for apartment hunting. If you have any connections in the city, it’s also always good to consider those first.<\/p>\n\n\n\n<p>To start your hunt, try searching in popular neighborhoods like Lakeview, Lincoln Park, or Edgewater.<\/p>\n\n\n\n<h4>How can an intern live in Chicago?<\/h4>\n\n\n\n<p>Moving to a new city is equal parts exciting and nerve wracking–make sure you have all your details squared away for your internship before you pack your bags.&nbsp;<\/p>\n\n\n\n<p>Here are a few things to consider:<\/p>\n\n\n\n<ul><li>Have you checked out <a href=\"https:\/\/joinhandshake.com\/blog\/students\/5-ways-college-students-are-landing-internships-right-now\/\" target=\"_blank\" rel=\"noreferrer noopener\">tips on how to land an internship<\/a>?<\/li><li>Do you need your internship to provide compensation?<\/li><li>Are you renting in an affordable neighborhood?<\/li><li>Do you have a vehicle? If not, are you comfortable using public transportation frequently?<\/li><li>Will the food options available work for you?<\/li><\/ul>\n\n\n\n<h4>How can I get an internship without experience in Chicago?<\/h4>\n\n\n\n<p>If you don’t have previous experience and want to kickstart your first internship in Chicago, don’t fret! There are definitely ways to land that role you’ve had your eyes on. Chicago internships want you!<\/p>\n\n\n\n<p>Start by reviewing your resume! Read it over a couple of times and then consider the types of internships you’re going to be applying for. Think back to courses you’ve taken at university, as well as any extracurriculars, volunteer work, or even organizations (clubs or greek life for example) that you’ve participated in. Organize the skills that you’ve gained from those experiences and add them to your resume and Handshake profile. Even though you might not have held an internship or job before, there are still ways to prove your worth through other skills and experiences.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Looking for paid summer internships in Chicago? Start with this comprehensive guide.<\/p>\n","protected":false},"author":167034980,"featured_media":2588,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_anchor_podcast":"","jetpack_anchor_episode":"","jetpack_anchor_spotify_show":""},"categories":[1494],"tags":[1515,1368],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Your Guide to Internships in Chicago | Handshake<\/title>\n<meta name=\"description\" content=\"Learn how to find a paid summer internship in Chicago, where to intern in Illinois, and read tips for surviving internships in Chicago.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Your Guide to Internships in Chicago | Handshake\" \/>\n<meta property=\"og:description\" content=\"Learn how to find a paid summer internship in Chicago, where to intern in Illinois, and read tips for surviving internships in Chicago.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:published_time\" content=\"2020-05-19T19:00:42+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-19T19:00:43+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/photo-of-buildings-1823681-1024x576.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"576\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"handshakejulie\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/photo-of-buildings-1823681.jpg?fit=5981%2C3365&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/photo-of-buildings-1823681.jpg?fit=5981%2C3365&ssl=1\",\"width\":5981,\"height\":3365},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/\",\"name\":\"Your Guide to Internships in Chicago | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#primaryimage\"},\"datePublished\":\"2020-05-19T19:00:42+00:00\",\"dateModified\":\"2020-05-19T19:00:43+00:00\",\"description\":\"Learn how to find a paid summer internship in Chicago, where to intern in Illinois, and read tips for surviving internships in Chicago.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Your Guide to Internships in Chicago\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#webpage\"},\"author\":{\"@id\":\"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16\"},\"headline\":\"Your Guide to Internships in Chicago\",\"datePublished\":\"2020-05-19T19:00:42+00:00\",\"dateModified\":\"2020-05-19T19:00:43+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#webpage\"},\"wordCount\":1740,\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/photo-of-buildings-1823681.jpg?fit=5981%2C3365&ssl=1\",\"keywords\":[\"Chicago\",\"internships for college students\"],\"articleSection\":[\"Research career paths\"],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16\",\"name\":\"handshakejulie\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g\",\"caption\":\"handshakejulie\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Your Guide to Internships in Chicago | Handshake","description":"Learn how to find a paid summer internship in Chicago, where to intern in Illinois, and read tips for surviving internships in Chicago.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/","og_locale":"en_US","og_type":"article","og_title":"Your Guide to Internships in Chicago | Handshake","og_description":"Learn how to find a paid summer internship in Chicago, where to intern in Illinois, and read tips for surviving internships in Chicago.","og_url":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_published_time":"2020-05-19T19:00:42+00:00","article_modified_time":"2020-05-19T19:00:43+00:00","og_image":[{"width":1024,"height":576,"path":"2020\/05\/photo-of-buildings-1823681-1024x576.jpg","url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/photo-of-buildings-1823681-1024x576.jpg","size":"large","id":2588,"alt":"","pixels":589824,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@joinhandshake","twitter_site":"@joinhandshake","twitter_misc":{"Written by":"handshakejulie","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/photo-of-buildings-1823681.jpg?fit=5981%2C3365&ssl=1","contentUrl":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/photo-of-buildings-1823681.jpg?fit=5981%2C3365&ssl=1","width":5981,"height":3365},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/","name":"Your Guide to Internships in Chicago | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#primaryimage"},"datePublished":"2020-05-19T19:00:42+00:00","dateModified":"2020-05-19T19:00:43+00:00","description":"Learn how to find a paid summer internship in Chicago, where to intern in Illinois, and read tips for surviving internships in Chicago.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Your Guide to Internships in Chicago"}]},{"@type":"Article","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#article","isPartOf":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#webpage"},"author":{"@id":"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16"},"headline":"Your Guide to Internships in Chicago","datePublished":"2020-05-19T19:00:42+00:00","dateModified":"2020-05-19T19:00:43+00:00","mainEntityOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#webpage"},"wordCount":1740,"publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"image":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-chicago\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/photo-of-buildings-1823681.jpg?fit=5981%2C3365&ssl=1","keywords":["Chicago","internships for college students"],"articleSection":["Research career paths"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16","name":"handshakejulie","image":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g","caption":"handshakejulie"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/05\/photo-of-buildings-1823681.jpg?fit=5981%2C3365&ssl=1","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts\/2587"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034980"}],"replies":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/comments?post=2587"}],"version-history":[{"count":3,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts\/2587\/revisions"}],"predecessor-version":[{"id":2592,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts\/2587\/revisions\/2592"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/2588"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=2587"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/categories?post=2587"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/tags?post=2587"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}