{"id":2728,"date":"2020-06-03T15:36:37","date_gmt":"2020-06-03T22:36:37","guid":{"rendered":"https:\/\/joinhandshake.com\/?p=2728"},"modified":"2020-12-15T19:34:45","modified_gmt":"2020-12-16T03:34:45","slug":"internships-in-san-diego","status":"publish","type":"post","link":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/","title":{"rendered":"Your Guide to Internships in San Diego"},"content":{"rendered":"\n<p>Besides fulfilling your childhood dreams of living in an exciting city, interning in San Diego is a great launchpad for your career. San Diego is known for entertainment, arts, and business internships and has a rich and vibrant arts, media, and intern scene.<\/p>\n\n\n\n<p>Summer internships provide you with many valuable experiences, giving a real taste of what it’ll be like to work in your preferred industry down the line. You’ll connect with potential mentors, learn trade secrets, and build relationships with coworkers with a range of expertise. Internships beef up resumes, provide valuable avenues to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-secure-a-letter-of-recommendation-from-your-internship\/\" target=\"_blank\" rel=\"noreferrer noopener\">letters of recommendation<\/a>, and can even <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-turn-your-internship-into-full-time\/\" target=\"_blank\" rel=\"noreferrer noopener\">turn into full-time jobs<\/a>. If you consider all of these perks of interning and add the benefit of exploring a diverse city that’s full of opportunities, you have a very compelling list of reasons to intern in San Diego. Continue reading along for tips on how to find the best paid summer 2021 or fall internships in San Diego. <\/p>\n\n\n\n<h4>Tips for your resume and profiles<\/h4>\n\n\n\n<p>Before you get started on sending out applications, make sure that you have your resume up to date and have fully filled out all <a href=\"https:\/\/joinhandshake.com\/blog\/students\/the-3-must-haves-on-your-handshake-profile\/\" target=\"_blank\" rel=\"noreferrer noopener\">your Handshake profile<\/a> details. With a complete profile, an impressive San Diego internship is more attainable than ever. Recruiters are much more likely to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/3-ways-other-students-on-handshake-can-help-you\/\" target=\"_blank\" rel=\"noreferrer noopener\">message a student<\/a> with a complete profile that says you want to work in San Diego than an unfinished one.<\/p>\n\n\n\n<h4>Tips for your internship interview<\/h4>\n\n\n\n<p>When you do land your first interview, be it a <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-make-a-good-impression-in-a-virtual-job-interview\/\" target=\"_blank\" rel=\"noreferrer noopener\">virtual interview<\/a> or in person, make sure to come prepared and dressed to impress. Review your resume and cover letter to make sure you have specific examples of your experience to share, from clubs or coursework. You can even schedule a mock interview with your university’s career center or, if you’re tight on time, ask a trusted friend to grill you on <a href=\"https:\/\/joinhandshake.com\/blog\/students\/the-4-most-common-internship-interview-questions\/\" target=\"_blank\" rel=\"noreferrer noopener\">some common interview questions<\/a>.<\/p>\n\n\n\n<h4>Tips for networking at college internships in San Diego<\/h4>\n\n\n\n<p>Once you’ve landed an internship in San Diego and settled into the flow of day-to-day life at the office, start chatting with your coworkers. Whether they’re industry professionals or fellow interns, it’s important to treat them with equal respect. You never know what insights they could lend, or who could be a valuable connection down the line, five or ten years from now. Don’t be afraid to ask your new colleagues out for quick coffee chats, or request 15-minute informational interviews about their career trajectory.<\/p>\n\n\n\n<h4>Want more tips for getting the most out of your internship?<\/h4>\n\n\n\n<p>Looking for specific advice before your internship begins? Or are you hungry for further information even after your internship is over? A good way to delve even deeper into your career path growth is to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-make-a-good-impression-in-a-virtual-job-interview\/\" target=\"_blank\" rel=\"noreferrer noopener\">attend a virtual event<\/a> or two. Not only will you be learning more about your own career, but there will also be chances to <a href=\"https:\/\/joinhandshake.com\/blog\/students\/how-to-impress-employers-at-virtual-events\/\" target=\"_blank\" rel=\"noreferrer noopener\">network with employers<\/a>, industry specialists, and other students sharing different perspectives.<\/p>\n\n\n\n<h1>Where can I find an internship in San Diego?<\/h1>\n\n\n\n<p>Here is a list of employers looking for interns in San Diego, including some of the best companies to intern for in San Diego:<\/p>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/9639\" target=\"_blank\" rel=\"noreferrer noopener\">Insight Global<\/a><\/h4>\n\n\n\n<p>Insight Global is a national staffing and services company specializing in sourcing information for accounting, tech, and others.<\/p>\n\n\n\n<ul><li>Industry: Human Resources<\/li><li>Types of roles: Advertising and PR Managers, Human Resources, Sales Agents<\/li><li>Recommended applicants: Consider applying for an internship at Insight Global if you’re majoring in accounting, PR, or computer science, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/398269\" target=\"_blank\" rel=\"noreferrer noopener\">Nzyme<\/a><\/h4>\n\n\n\n<p>Nyzme is an IT consulting service.<\/p>\n\n\n\n<ul><li>Industry: Internet &amp; Software<\/li><li>Types of roles: Computer and Information Research Scientists<\/li><li>Recommended applicants: Consider applying for an internship at Nzyme if you’re majoring in computer science, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/8501\" target=\"_blank\" rel=\"noreferrer noopener\">Aerotek<\/a><\/h4>\n\n\n\n<p>Aerotek is a recruitment and staffing agency.<\/p>\n\n\n\n<ul><li>Industry: Human Resources<\/li><li>Types of roles: Advertising Managers, Sales Agents, Financial Sales<\/li><li>Recommended applicants: Consider applying for an internship at Aerotek if you’re majoring in advertising or business, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/12354\" target=\"_blank\" rel=\"noreferrer noopener\">ScribeAmerica<\/a><\/h4>\n\n\n\n<p>ScribeAmerica is an international medical scribe company.<\/p>\n\n\n\n<ul><li>Industry: Healthcare<\/li><li>Types of roles: Biochemists, Social Workers, Veterinarians&nbsp;<\/li><li>Recommended applicants: Consider applying for an internship at ScribeAmerica if you’re majoring in medical studies, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/17297\" target=\"_blank\" rel=\"noreferrer noopener\">CohnReznick LLP<\/a><\/h4>\n\n\n\n<p>CohnReznick LLP is an accounting, tax, and advisory firm.<\/p>\n\n\n\n<ul><li>Industry: Accounting<\/li><li>Types of roles: Accountants, Auditors, Bookkeepers<\/li><li>Recommended applicants: Consider applying for an internship at CohnReznick LLP if you’re majoring in accounting or finance, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/15107\" target=\"_blank\" rel=\"noreferrer noopener\">Thermo Fisher Scientific<\/a><\/h4>\n\n\n\n<p>Thermo Fisher Scientific is a provisioner of scientific implementation.<\/p>\n\n\n\n<ul><li>Industry: Healthcare<\/li><li>Types of roles: Data Scientists, Product Managers, Machinists<\/li><li>Recommended applicants: Consider applying for an internship at Thermo Fisher if you’re majoring in computer science or engineering, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/28713\" target=\"_blank\" rel=\"noreferrer noopener\">International Rescue Committee<\/a><\/h4>\n\n\n\n<p>International Rescue Committee is a global humanitarian organization.<\/p>\n\n\n\n<ul><li>Industry: Social Assistance<\/li><li>Types of roles: Adult Educators, Journalists, Legal Assistants, Marketing Managers<\/li><li>Recommended applicants: Consider applying for an internship at International Rescue Committee if you’re majoring in education or journalism, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/42043\" target=\"_blank\" rel=\"noreferrer noopener\">Octapharma Plasma, Inc.<\/a><\/h4>\n\n\n\n<p>Octapharma Plasma, Inc. is a company that collects plasma to help create life saving medicines.<\/p>\n\n\n\n<ul><li>Industry: Healthcare<\/li><li>Types of roles: Accountants, Environmental Scientists, Medical Assistants<\/li><li>Recommended applicants: Consider applying for an internship at Octapharma Plasma if you’re majoring in health sciences, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/24036\" target=\"_blank\" rel=\"noreferrer noopener\">Teach for America<\/a><\/h4>\n\n\n\n<p>Teach for America is a non-profit focused on developing future leaders.<\/p>\n\n\n\n<ul><li>Industry: Non-Profit<\/li><li>Types of roles: Teachers, Marketing Managers, Data Analysts<\/li><li>Recommended applicants: Consider applying for an internship at Teach for America if you’re majoring in education or marketing, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/29505\" target=\"_blank\" rel=\"noreferrer noopener\">Metron<\/a><\/h4>\n\n\n\n<p>Metron is a scientific consulting company.<\/p>\n\n\n\n<ul><li>Industry: Defense<\/li><li>Types of roles: Data Analysts, Software Developers, Product Designers<\/li><li>Recommended applicants: Consider applying for an internship at Metron if you’re majoring in computer science, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h4><a href=\"https:\/\/app.joinhandshake.com\/employers\/348138\" target=\"_blank\" rel=\"noreferrer noopener\">LPL Financial<\/a><\/h4>\n\n\n\n<p>LPL Financial is a retail finance advice company.<\/p>\n\n\n\n<ul><li>Industry: Investment Banking<\/li><li>Types of roles: Credit and Financial Risk Managers, Customer Success and Account Managers, Trading Agents&nbsp;<\/li><li>Recommended applicants: Consider applying for an internship at LPL Financial if you’re majoring in finance or business, or if you’ve taken courses in applicable areas.<\/li><\/ul>\n\n\n\n<h1>Tips and tricks to surviving your San Diego internship<\/h1>\n\n\n\n<p>If you’re a transplant or even if you’ve called SD home forever, it never hurts to review advice for living in the city during your internship. After you’ve figured out how to get an internship in San Diego, think about the other parts of your internship journey.<\/p>\n\n\n\n<h4>Use your car… or buy a Compass Card<\/h4>\n\n\n\n<p>No matter where your apartment is or where you’re commuting to in the city, if it’s not within walking distance it’s going to take a while to get there–even with a car. If you aren’t bringing your car, you’re going to need public transportation to your destination. Purchasing a <a href=\"https:\/\/www.sdmts.com\/fares-passes\/compass-card\" target=\"_blank\" rel=\"noreferrer noopener\">Compass Card<\/a> is highly recommended to make reloading funds a breeze.<\/p>\n\n\n\n<p>If you’re frequently commuting and feeling savvy, go for the monthly <a href=\"https:\/\/www.sdmts.com\/rider-info\/transit-store\" target=\"_blank\" rel=\"noreferrer noopener\">pass<\/a>! You’ll be able to mindlessly ride the metro during your commute hours and won’t have to think about counting out your cash every time you board.&nbsp;<\/p>\n\n\n\n<h4>Don’t get (too) lost, download Compass Cloud<\/h4>\n\n\n\n<p>This <a href=\"https:\/\/apps.apple.com\/us\/app\/compass-cloud-sdmts-nctd\/id1212568295\" target=\"_blank\" rel=\"noreferrer noopener\">app<\/a> will help get you oriented to the city and find the right connections to wherever you’re going.<\/p>\n\n\n\n<h4>5 essential San Diego restaurants to try during your internship&nbsp;<\/h4>\n\n\n\n<ol><li>Mien Truong<\/li><li>Cotixan<\/li><li>Lolita’s<\/li><li>A-Chau<\/li><li>Min Sok Chon<\/li><\/ol>\n\n\n\n<h4>Things to experience during your time in San Diego<\/h4>\n\n\n\n<ol><li>San Diego Zoo<\/li><li>Balboa Park<\/li><li>Potato Chip Rock<\/li><li>Ocean Beach Pier<\/li><\/ol>\n\n\n\n<h4>3 neighborhoods to consider living in during your San Diego internship<\/h4>\n\n\n\n<ol><li>College Area<\/li><li>Pacific Beach<\/li><li>North Park<\/li><\/ol>\n\n\n\n<h4>How do I find an apartment in San Diego?<\/h4>\n\n\n\n<p>Consider these resources to help your San Diego apartment search:<\/p>\n\n\n\n<ol><li><a href=\"http:\/\/apartments.com\" target=\"_blank\" rel=\"noreferrer noopener\">Apartments.com<\/a><\/li><li><a href=\"https:\/\/www.zillow.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Zillow<\/a><\/li><li><a href=\"https:\/\/www.forrent.com\/find\/CA\/metro-San+Diego\/San+Diego\" target=\"_blank\" rel=\"noreferrer noopener\">ForRent<\/a><\/li><li><a href=\"https:\/\/losangeles.craigslist.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">Craigslist<\/a><\/li><li>Join a San Diego Housing, Rooms, Apartments, and Sublets group on Facebook<\/li><\/ol>\n\n\n\n<h4>Where to order food from in San Diego<\/h4>\n\n\n\n<ol><li><a href=\"http:\/\/doordash.com\" target=\"_blank\" rel=\"noreferrer noopener\">DoorDash<\/a><\/li><li><a href=\"https:\/\/www.grubhub.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">GrubHub<\/a><\/li><li><a href=\"http:\/\/postmates.com\" target=\"_blank\" rel=\"noreferrer noopener\">Postmates<\/a><\/li><li><a href=\"https:\/\/www.ubereats.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">UberEats<\/a><\/li><li>Check out your neighborhood’s local delivery restaurants<\/li><\/ol>\n\n\n\n<h1>Finding an internship in San Diego<\/h1>\n\n\n\n<h4>How do I find the best <a href=\"https:\/\/joinhandshake.com\/blog\/students\/considering-a-paid-internship-read-this-first\/\" target=\"_blank\" rel=\"noreferrer noopener\">paid internships<\/a> in San Diego?<\/h4>\n\n\n\n<p>When searching for a paid internship in San Diego, it’s key to use <a href=\"https:\/\/joinhandshake.com\/blog\/students\/find-a-job-using-handshakes-filter-functions\/\" target=\"_blank\" rel=\"noreferrer noopener\">the location filters provided on Handshake<\/a>. You’ll be able to pinpoint internships exactly where you want to intern just by selecting the city you want in the search bar. Easy internships in San Diego are just a search away.&nbsp;<\/p>\n\n\n\n<p>You can also research top companies in San Diego by visiting <a href=\"https:\/\/app.joinhandshake.com\/employers\" target=\"_blank\" rel=\"noreferrer noopener\">our list of Handshake employers<\/a> and typing San Diego into the “Location” search bar. This way you’ll be able to see employers in your desired location. Once on the company’s page, you can read <a href=\"https:\/\/app.joinhandshake.com\/employers\/8967#reviews\" target=\"_blank\" rel=\"noreferrer noopener\">reviews<\/a> from students who have interned there or study up on some <a href=\"https:\/\/app.joinhandshake.com\/employers\/8967#interviews\" target=\"_blank\" rel=\"noreferrer noopener\">interview questions<\/a>.<\/p>\n\n\n\n<h4>Where do interns live in San Diego?<\/h4>\n\n\n\n<p>To find rentals, many interns use resources like Craigslist, Zillow, and other sites specifically for apartment hunting. If you have any connections in the city, it’s also always good to consider those first.<\/p>\n\n\n\n<p>To start your hunt, try searching in popular neighborhoods like Pacific Beach, College Area, or North Park.<\/p>\n\n\n\n<h4>How can an intern live in San Diego?<\/h4>\n\n\n\n<p>Moving to a new city is equal parts exciting and nerve wracking–make sure you have all your details squared away for your internship before you pack your bags.&nbsp;<\/p>\n\n\n\n<p>Here are a few things to consider:<\/p>\n\n\n\n<ul><li>Have you checked out <a href=\"https:\/\/joinhandshake.com\/blog\/students\/5-ways-college-students-are-landing-internships-right-now\/\" target=\"_blank\" rel=\"noreferrer noopener\">tips on how to land an internship<\/a>?<\/li><li>Do you need your internship to provide compensation?<\/li><li>Are you renting in an affordable and safe neighborhood?<\/li><li>Do you have a car\/bike or are you comfortable using the metro frequently?<\/li><li>Will the food options available work for you?<\/li><\/ul>\n\n\n\n<h4>How can I get an internship without experience in San Diego?<\/h4>\n\n\n\n<p>If you don’t have previous experience and want to kickstart your first internship in San Diego, don’t fret! There are definitely ways to land that role you’ve had your eyes on. San Diego internships want you!<\/p>\n\n\n\n<p>Start by reviewing your resume! Read it over a couple of times and then consider the types of internships you’re going to be applying for. Think back to courses you’ve taken at university, as well as any extracurriculars, volunteer work, or even organizations (clubs or greek life for example) that you’ve participated in. Organize the skills that you’ve gained from those experiences and add them to your resume and Handshake profile. Even though you might not have held an internship or job before, there are still ways to prove your worth through other skills and experiences.<\/p>\n\n\n\n<p><em>Photo by&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/www.pexels.com\/@lucasfonseca?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\" target=\"_blank\">Lucas Fonseca<\/a>&nbsp;from&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/www.pexels.com\/photo\/marina-during-golden-hour-2157685\/?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\" target=\"_blank\">Pexels<\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Looking for paid summer internships in San Diego? Start with this comprehensive guide.<\/p>\n","protected":false},"author":167034980,"featured_media":2729,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_anchor_podcast":"","jetpack_anchor_episode":"","jetpack_anchor_spotify_show":""},"categories":[1494],"tags":[1368,1525],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Your Guide to Internships in San Diego | Handshake<\/title>\n<meta name=\"description\" content=\"Learn how to find a paid summer internship in San Diego, where to intern in San Diego, and read tips for surviving internships in San Diego.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Your Guide to Internships in San Diego | Handshake\" \/>\n<meta property=\"og:description\" content=\"Learn how to find a paid summer internship in San Diego, where to intern in San Diego, and read tips for surviving internships in San Diego.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"article:published_time\" content=\"2020-06-03T22:36:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-12-16T03:34:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/06\/marina-during-golden-hour-2157685-1024x683.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"683\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"handshakejulie\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/06\/marina-during-golden-hour-2157685.jpg?fit=7952%2C5304&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/06\/marina-during-golden-hour-2157685.jpg?fit=7952%2C5304&ssl=1\",\"width\":7952,\"height\":5304},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/\",\"name\":\"Your Guide to Internships in San Diego | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#primaryimage\"},\"datePublished\":\"2020-06-03T22:36:37+00:00\",\"dateModified\":\"2020-12-16T03:34:45+00:00\",\"description\":\"Learn how to find a paid summer internship in San Diego, where to intern in San Diego, and read tips for surviving internships in San Diego.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Your Guide to Internships in San Diego\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#webpage\"},\"author\":{\"@id\":\"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16\"},\"headline\":\"Your Guide to Internships in San Diego\",\"datePublished\":\"2020-06-03T22:36:37+00:00\",\"dateModified\":\"2020-12-16T03:34:45+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#webpage\"},\"wordCount\":1809,\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/06\/marina-during-golden-hour-2157685.jpg?fit=7952%2C5304&ssl=1\",\"keywords\":[\"internships for college students\",\"san diego\"],\"articleSection\":[\"Research career paths\"],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16\",\"name\":\"handshakejulie\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g\",\"caption\":\"handshakejulie\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Your Guide to Internships in San Diego | Handshake","description":"Learn how to find a paid summer internship in San Diego, where to intern in San Diego, and read tips for surviving internships in San Diego.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/","og_locale":"en_US","og_type":"article","og_title":"Your Guide to Internships in San Diego | Handshake","og_description":"Learn how to find a paid summer internship in San Diego, where to intern in San Diego, and read tips for surviving internships in San Diego.","og_url":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","article_published_time":"2020-06-03T22:36:37+00:00","article_modified_time":"2020-12-16T03:34:45+00:00","og_image":[{"width":1024,"height":683,"path":"2020\/06\/marina-during-golden-hour-2157685-1024x683.jpg","url":"https:\/\/joinhandshake.com\/wp-content\/uploads\/2020\/06\/marina-during-golden-hour-2157685-1024x683.jpg","size":"large","id":2729,"alt":"","pixels":699392,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@joinhandshake","twitter_site":"@joinhandshake","twitter_misc":{"Written by":"handshakejulie","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/06\/marina-during-golden-hour-2157685.jpg?fit=7952%2C5304&ssl=1","contentUrl":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/06\/marina-during-golden-hour-2157685.jpg?fit=7952%2C5304&ssl=1","width":7952,"height":5304},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/","name":"Your Guide to Internships in San Diego | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#primaryimage"},"datePublished":"2020-06-03T22:36:37+00:00","dateModified":"2020-12-16T03:34:45+00:00","description":"Learn how to find a paid summer internship in San Diego, where to intern in San Diego, and read tips for surviving internships in San Diego.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Your Guide to Internships in San Diego"}]},{"@type":"Article","@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#article","isPartOf":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#webpage"},"author":{"@id":"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16"},"headline":"Your Guide to Internships in San Diego","datePublished":"2020-06-03T22:36:37+00:00","dateModified":"2020-12-16T03:34:45+00:00","mainEntityOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#webpage"},"wordCount":1809,"publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"image":{"@id":"https:\/\/joinhandshake.com\/blog\/students\/internships-in-san-diego\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/06\/marina-during-golden-hour-2157685.jpg?fit=7952%2C5304&ssl=1","keywords":["internships for college students","san diego"],"articleSection":["Research career paths"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/joinhandshake.com\/#\/schema\/person\/86e3d3f41bdd572af5aa56ae01121f16","name":"handshakejulie","image":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/97d434412ff563ef547debe799840528?s=96&d=identicon&r=g","caption":"handshakejulie"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/06\/marina-during-golden-hour-2157685.jpg?fit=7952%2C5304&ssl=1","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts\/2728"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034980"}],"replies":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/comments?post=2728"}],"version-history":[{"count":5,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts\/2728\/revisions"}],"predecessor-version":[{"id":5641,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/posts\/2728\/revisions\/5641"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/2729"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=2728"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/categories?post=2728"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/tags?post=2728"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}