{"id":1238,"date":"2020-01-17T10:43:19","date_gmt":"2020-01-17T18:43:19","guid":{"rendered":"https:\/\/joinhandshake.com\/?post_type=career-centers&#038;p=1238"},"modified":"2020-01-17T10:43:19","modified_gmt":"2020-01-17T18:43:19","slug":"personalization-at-scale-the-future-of-career-services","status":"publish","type":"career-centers","link":"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/","title":{"rendered":"Personalization at Scale: The Future of Career Services"},"content":{"rendered":"\n<p>Data is a prerequisite for creating a personalized experience. Machine learning algorithms that can deliver personalization at scale require enough data to predict what a diverse set of users may be interested in. Historically, leveraging this data in career services hasn’t been possible. With every university using a separate, bespoke system, there wasn’t enough data (even at the world’s largest universities) to power effective recommendation algorithms. <\/p>\n\n\n\n<p>Let’s take my story, for example. I went to Michigan Tech, a great university in a very remote part of the United States (it’s actually north of about 80% of the Canadian population). My ambitions were not traditional for a student at Michigan Tech. As a first-year student, I arrived dreaming of working in Silicon Valley — a mere 2900 miles away from Michigan Tech’s snowy campus. Even if Michigan Tech’s career management system at the time was using machine learning, it wouldn’t have worked for me for a few reasons:<\/p>\n\n\n\n<ul><li>Silicon Valley companies weren’t posting their jobs at Michigan Tech. Even if an algorithm knew what I wanted, it wouldn’t do any good if it had nothing to recommend. <\/li><li>There were perhaps ten students at Michigan Tech who shared my interests. Of those, maybe three had engaged with our online careers platform. Effective machine learning requires hundreds (ideally, thousands) of data points to capture the nuance of interests. The most our school’s system could have had was a handful.  <\/li><\/ul>\n\n\n\n<p>As a result, the online careers platform available when I was a student was unable to provide a personalized experience for me. This deficit, and Handshake’s work to reimagine the career services systems as a network, is an example of a more significant trend that has been progressing across the digital landscape.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"2278\" height=\"682\" src=\"https:\/\/i0.wp.com\/joinhandshake.com\/\/srv\/htdocs\/wp-content\/uploads\/2020\/01\/houghton.png?fit=1024%2C307&amp;ssl=1\" alt=\"\" class=\"wp-image-1241\" srcset=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/houghton.png?w=2278&amp;ssl=1 2278w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/houghton.png?resize=300%2C90&amp;ssl=1 300w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/houghton.png?resize=1024%2C307&amp;ssl=1 1024w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/houghton.png?resize=768%2C230&amp;ssl=1 768w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/houghton.png?resize=1536%2C460&amp;ssl=1 1536w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/houghton.png?resize=2048%2C613&amp;ssl=1 2048w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/houghton.png?resize=640%2C192&amp;ssl=1 640w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/houghton.png?resize=1200%2C359&amp;ssl=1 1200w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/houghton.png?resize=1920%2C575&amp;ssl=1 1920w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><figcaption><em>Left:<\/em> A photo of a road sign outside of Houghton, Michigan as a joke for parents venturing to Houghton for the first time. <br><em>Right:<\/em> A photo of Lake Superior just a few miles from Michigan Tech’s campus.<\/figcaption><\/figure>\n\n\n\n<h4>Web 2.0: From databases to networks<\/h4>\n\n\n\n<p>The first generation of web systems (Web 1.0) focused on copying real-world process and digitizing it. The architecture of these systems was not conducive to machine learning as they simply couldn’t provide the data machine learning formulas needed to work. The result is that networks are replacing today’s legacy systems at an incredible rate. Here are a few examples: <\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1578\" height=\"865\" src=\"https:\/\/i0.wp.com\/joinhandshake.com\/\/srv\/htdocs\/wp-content\/uploads\/2020\/01\/5e218fe34c48fe435e09dd9c_Screenshot-2020-01-17-10.43.40.png?fit=1024%2C561&amp;ssl=1\" alt=\"\" class=\"wp-image-1242\" srcset=\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218fe34c48fe435e09dd9c_Screenshot-2020-01-17-10.43.40.png?w=1578&amp;ssl=1 1578w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218fe34c48fe435e09dd9c_Screenshot-2020-01-17-10.43.40.png?resize=300%2C164&amp;ssl=1 300w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218fe34c48fe435e09dd9c_Screenshot-2020-01-17-10.43.40.png?resize=1024%2C561&amp;ssl=1 1024w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218fe34c48fe435e09dd9c_Screenshot-2020-01-17-10.43.40.png?resize=768%2C421&amp;ssl=1 768w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218fe34c48fe435e09dd9c_Screenshot-2020-01-17-10.43.40.png?resize=1536%2C842&amp;ssl=1 1536w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218fe34c48fe435e09dd9c_Screenshot-2020-01-17-10.43.40.png?resize=640%2C351&amp;ssl=1 640w, https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218fe34c48fe435e09dd9c_Screenshot-2020-01-17-10.43.40.png?resize=1200%2C658&amp;ssl=1 1200w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/figure>\n\n\n\n<p>By connecting people at a massive scale, networks unlock value for every user involved. This has become so widely accepted that the term &#8220;network effect&#8221; is now used to describe a system where every existing user on the platform benefits in some way when any other joins.<\/p>\n\n\n\n<h4>Network effects in Handshake<\/h4>\n\n\n\n<p>Handshake was intentionally built as a network from day one. We connect over 17 million students and alumni, 400,000 employers, and over 900 universities. Every time a university, employer, or student joins the Handshake network, it becomes more valuable for every other user. Let&#8217;s look at a few examples:<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1790\" height=\"902\" src=\"https:\/\/i1.wp.com\/learn.joinhandshake.com\/\/srv\/htdocs\/wp-content\/uploads\/2020\/01\/5e218ee1ea5729365ce1edae_Screenshot-2020-01-17-10.39.18.png?fit=1024%2C516&amp;ssl=1\" alt=\"\" class=\"wp-image-1243\" srcset=\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218ee1ea5729365ce1edae_Screenshot-2020-01-17-10.39.18.png?w=1790&amp;ssl=1 1790w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218ee1ea5729365ce1edae_Screenshot-2020-01-17-10.39.18.png?resize=300%2C151&amp;ssl=1 300w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218ee1ea5729365ce1edae_Screenshot-2020-01-17-10.39.18.png?resize=1024%2C516&amp;ssl=1 1024w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218ee1ea5729365ce1edae_Screenshot-2020-01-17-10.39.18.png?resize=768%2C387&amp;ssl=1 768w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218ee1ea5729365ce1edae_Screenshot-2020-01-17-10.39.18.png?resize=1536%2C774&amp;ssl=1 1536w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218ee1ea5729365ce1edae_Screenshot-2020-01-17-10.39.18.png?resize=640%2C323&amp;ssl=1 640w, https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e218ee1ea5729365ce1edae_Screenshot-2020-01-17-10.39.18.png?resize=1200%2C605&amp;ssl=1 1200w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/figure>\n\n\n\n<h4>Data is Improving the World.<\/h4>\n\n\n\n<p>Despite what you may have seen or heard on the news, data is not inherently bad or scary. When responsibly used, data has the capability to solve some of the hardest problems we face as a society. Here are just a few examples:&nbsp;<\/p>\n\n\n\n<ul><li>The use of data and machine learning is helping scientists&nbsp;<a target=\"_blank\" href=\"https:\/\/www.nationalgeographic.co.uk\/science-and-technology\/2019\/07\/how-artificial-intelligence-can-tackle-climate-change\" rel=\"noreferrer noopener\">predict the impacts of global warming<\/a>.&nbsp;<\/li><li>It’s being used by philanthropies like the Bill and Melinda Gates’ Foundation to&nbsp;<a target=\"_blank\" href=\"https:\/\/medium.com\/@taposhdr\/reinforcement-learning-to-eradicate-malaria-with-ai-49e9e4016665\" rel=\"noreferrer noopener\">eradicate some of the world’s worst diseases<\/a>.&nbsp;<\/li><li>Genetic data is helping connect&nbsp;<a target=\"_blank\" href=\"https:\/\/www.23andme.com\/en-gb\/stories\/\" rel=\"noreferrer noopener\">long-lost family members while identifying risk factors<\/a>&nbsp;decades before symptoms show up.&nbsp;<\/li><\/ul>\n\n\n\n<p>Data is being used to make us safer, healthier, happier, and more efficient every single day. <\/p>\n\n\n\n<p>Like all things, how a company is incentivized to use data matters a lot. In most cases, this is driven by the company’s business model. So to understand Handshake’s approach to data, I think it’s important to understand our business model.<\/p>\n\n\n\n<h2>Handshake’s Model and the Business of Big Data<\/h2>\n\n\n\n<p>In 2017, The Ec<em>onomist<\/em> proclaimed that data had surpassed oil as the most valuable commodity. It’s easy to hear this and imagine companies buying and selling data in the same way they would crude oil. While this imagery helps us visualize an abstract concept, it’s also generally not representative of how data works and promotes misinformation.<\/p>\n\n\n\n<p>It’s worth being clear upfront: Handshake does not, and never will, sell data. This would not only be a major violation of our users’ trust, but it would also be illegal — a violation of our terms of service (the contract we have with our users), contracts we have with our universities, and the federal regulations that protect student data. Selling the data in Handshake would eliminate the need for Handshake, and thus would make for a poor business strategy. <\/p>\n\n\n\n<p> Handshake makes money in two ways: <\/p>\n\n\n\n<ul><li>Career Management suite of tools (University Revenue)<\/li><li>Premium services for employers (Employer Revenue)<\/li><\/ul>\n\n\n\n<p>Universities use Handshake to power their back-office operations. From career fair management to appointment scheduling, Handshake makes managing centers more efficient.&nbsp;<a target=\"_blank\" href=\"https:\/\/www.joinhandshake.co.uk\/\" rel=\"noreferrer noopener\">You can learn more about that here<\/a>.<\/p>\n\n\n\n<p>Engineering and development teams are expensive (just look at the software engineering job role above) and university careers services budgets alone couldn’t support these types of services. Historically, legacy platforms have charged for services like posting jobs to multiple universities to supplement the revenue from universities and to try and build a healthy business. This opportunity tax on the flow of positions added no real value to employers but was required for sustainable business. <\/p>\n\n\n\n<p>We offer Handshake to all employers for free and give away more value to employers than any other network. Every company can post positions to as many universities as they’d like for free. Event management, career fair registration, application tracking, sourcing, and much more are all included for every company — free of charge. <\/p>\n\n\n\n<p>For companies with more demanding recruiting needs, Handshake also offers services that are uniquely possible because of the network architecture. These premium services are designed to help employers get a more contextual experience from their data:<\/p>\n\n\n\n<ul><li>How can I more proactively engage students so I see a higher return on investment (ROI) when I visit a university?&nbsp;<\/li><li>How is my brand performing among students in a demographic I care about? What ways can I better tell my story across these groups?&nbsp;<\/li><li>What universities should I be visiting \/ targeting that maybe I’ve previously overlooked?&nbsp;<\/li><li>How can I more effectively and intelligently follow up with students who visit my team at a career fair?<\/li><li>How do I most effectively tell my company’s story and build my brand with students?&nbsp;<\/li><\/ul>\n\n\n\n<p>The tools we’ve built are uniquely possible as a direct result of the activity on the Handshake platform. Take the School Explorer feature (shown in more depth below), for example. <\/p>\n\n\n\n<p>School Explorer leverages Handshake’s university partnerships to help employers discover universities they may not have thought to recruit at based on the roles they’re looking to fill. Looking to hire software developers in the Midwest? You should be recruiting at Michigan Tech, MSOE, Rose-Hulman, and dozens of other universities you may not have thought about. <\/p>\n\n\n\n<p>Students at universities around the US (and soon the UK) benefit from access to high-quality opportunities that they never would have had before the Handshake network. Tools like School Explorer help amplify that and are uniquely possible because of the relationships we have with students, employers, and universities. <\/p>\n\n\n\n<h2>Handshake uses data to improve the experience of all users.<\/h2>\n\n\n\n<p>Handshake, and the data that moves through it, unlocks immense value for all three sides of our network. In this section, I’ll explore how. <\/p>\n\n\n\n<h3>Career Services<\/h3>\n\n\n\n<p>As the heart of the network, colleges and universities use Handshake to power their most sophisticated workflows, to engage with their students, and to manage employer relationships. Today, Handshake supports over 900 colleges and universities in the US and is expanding globally. <\/p>\n\n\n\n<h3>Trusted Employers<\/h3>\n\n\n\n<p>Historically, fraud has been a major issue for career services teams to deal with. Fraudulent users would create fake vacancies, post them to universities, and prey on unsuspecting students. In the disparate legacy systems, fraudsters could run this playbook at every university without being stopped. Even if one university identified them, they could just move on to the next. It’s a despicable practice that resulted in every service running manual checks on every single employer and posting. Email lists sprang up where universities would try to warn each other of a scam before it spread. <\/p>\n\n\n\n<p>Because Handshake is a network, we leverage an employer’s data across the entire network to predict if they may be a fraudulent company. We surface this to universities to inform their approvals — drastically cutting down on the number of fraudulent employers across the network. <\/p>\n\n\n\n<p>You can learn more about <a rel=\"noreferrer noopener\" target=\"_blank\" href=\"https:\/\/joinhandshake.com\/blog\/career-centers\/trust-and-safety-on-handshake\/\">trust and safety on the Handshake Network here<\/a>.<\/p>\n\n\n\n<h3>Better Data and Benchmarking<\/h3>\n\n\n\n<p>For decades, universities have united to share best practices and compare notes. When it comes to data, bespoke systems made it hard to compare performance since every university had separate fields and reporting capabilities.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1600\" height=\"728\" src=\"https:\/\/i2.wp.com\/learn.joinhandshake.com\/\/srv\/htdocs\/wp-content\/uploads\/2020\/01\/5e207140cb65fa50a25b26c4_student-activations.png?fit=1024%2C466&amp;ssl=1\" alt=\"\" class=\"wp-image-1244\" srcset=\"https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e207140cb65fa50a25b26c4_student-activations.png?w=1600&amp;ssl=1 1600w, https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e207140cb65fa50a25b26c4_student-activations.png?resize=300%2C137&amp;ssl=1 300w, https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e207140cb65fa50a25b26c4_student-activations.png?resize=1024%2C466&amp;ssl=1 1024w, https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e207140cb65fa50a25b26c4_student-activations.png?resize=768%2C349&amp;ssl=1 768w, https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e207140cb65fa50a25b26c4_student-activations.png?resize=1536%2C699&amp;ssl=1 1536w, https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e207140cb65fa50a25b26c4_student-activations.png?resize=640%2C291&amp;ssl=1 640w, https:\/\/i2.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/5e207140cb65fa50a25b26c4_student-activations.png?resize=1200%2C546&amp;ssl=1 1200w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><figcaption><em>An example dashboard available to universities in Handshake showing peer benchmark data.<\/em><\/figcaption><\/figure>\n\n\n\n<p>Using Handshake’s networked approach, we can show universities data on how they compare to similar universities. This can be used in benchmarking conversations and to track the progress of different initiatives on campus. <\/p>\n\n\n\n<h3>More (and More Diverse) Opportunities<\/h3>\n\n\n\n<p>Traditionally, universities tried to achieve some degree of relevancy by manually curating jobs. Usually, this involved only approving postings that they thought would be of interest to their student population.<\/p>\n\n\n\n<p>This approach is inherently biased and loses the nuance in what students may be looking for based on their unique situation. By connecting universities to a network, Handshake increases the number of opportunities employers choose to post to that institution by 300% on average (based on our US data). This is important, as having lots of diverse opportunities is prerequisite for the personalization our students find so valuable.<\/p>\n\n\n\n<h3>The Future<\/h3>\n\n\n\n<p>We continue to invest in new features for universities. This year we’re exploring leveraging the data moving through Handshake to enable actionable insights. These tools will empower you to not just look at the data, but seamlessly take action on it. <\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/i2.wp.com\/assets.website-files.com\/5d6536715bb410da43b79c13\/5e20706c0c122473b265721d_david%20Screenshot%201.png?ssl=1\" alt=\"\" data-recalc-dims=\"1\"\/><\/figure>\n\n\n\n<p>We’re still finalizing what this could look like, but above you’ll see an idea of how this technology could be built into the &#8220;Manage Students&#8221; page in Handshake to proactively engage students.<\/p>\n\n\n\n<h3>Students<\/h3>\n\n\n\n<p>Students love Handshake and the data backs that up. The average university sees a 60% increase in student engagement when they switch to Handshake from a legacy provider. There are lots of ways Handshake uses data on the student side, but we’ll focus on one of the reasons students love Handshake — the personalized experience. <\/p>\n\n\n\n<h3>Personalization<\/h3>\n\n\n\n<p>Data shows that a digital experience is the only touchpoint the majority of students will have with their school’s career services team. Delivering a personalized experience for every student from their first login is of paramount importance. Failing to do so results in misconception about who career services really serve and drives students away. (Cue students saying: “the career center isn’t for students like me.&#8221;)<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/i2.wp.com\/assets.website-files.com\/5d6536715bb410da43b79c13\/5e21905cea57297b5ae1f45c_Screenshot%202020-01-17%2010.45.42.png?ssl=1\" alt=\"\" data-recalc-dims=\"1\"\/><figcaption>An example of Handshake&#8217;s student onboarding.<\/figcaption><\/figure>\n\n\n\n<p>‍When a student logs into Handshake they go through an on-boarding experience that asks them what they’re looking for. We combine this with the student’s academic data. This data set is then cross-referenced with tens of millions of data points in the Handshake ecosystem to determine what students like them might be interested in. The result? A personalized experience from day one that gets better and better as the student uses it. <\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/i2.wp.com\/assets.website-files.com\/5d6536715bb410da43b79c13\/5e2072c20c12242337658a8c_Handshake%20Welcome.png?ssl=1\" alt=\"\" data-recalc-dims=\"1\"\/><figcaption><em>The student dashboard in Handshake featuring personalized recommendations<\/em><\/figcaption><\/figure>\n\n\n\n<p>This relevancy work is a focus of our team of data scientists. Matching student interests with the messy data found in job postings is a difficult task and we’re always working on building a more refined process. For example, our team found dozens of different job titles that all more or less equated to “Software Developer.” Our classification systems are always improving as we get better at predicting the nuances of student interests.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/i0.wp.com\/assets.website-files.com\/5d6536715bb410da43b79c13\/5e2073003274e43a669e5cbf_nuances.png?ssl=1\" alt=\"\" data-recalc-dims=\"1\"\/><figcaption><em>Handshake Job Roles help students discover information about a career path and relevant opportunities, regardless of the job title.&nbsp;<\/em><\/figcaption><\/figure>\n\n\n\n<p>A note on serendipity: some of the most meaningful careers are non-linear and are often unrelated to what a student studies. We get a lot of questions about if our algorithms create echo chambers for students — showing opportunities of the same genre over and over in the name of relevance.<\/p>\n\n\n\n<p>It always surprises career teams to know that we’ve coded for serendipity. Our algorithms are tuned to be about 60% accurate. This means we expect that 60% of what we show a student will be relevant. We then intentionally introduce about 40% of new content to help students discover things they may never have thought to search for and to test our algorithms. <\/p>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/democratizeopportunity.com\/building-relevance-at-handshake-99de2dd41e84\" target=\"_blank\">You can read more about our recommendation system here.<\/a><\/p>\n\n\n\n<h3>Employers<\/h3>\n\n\n\n<p>Data adds value to all three sides of the ecosystem. On the employer side, we’ve been piloting a new feature with our premium employer partners that align with our mission as a company — democratizing opportunity. <\/p>\n\n\n\n<p>It’s called the School Explorer, and it uses data to help employers find universities that they may have overlooked, but where data suggest there are many students who would be a great fit for their company. As mentioned above, the data is presenting aggregated and de-identified student groups. <\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/i2.wp.com\/assets.website-files.com\/5d6536715bb410da43b79c13\/5e20732dc05d7aa4219e33a8_Deloitte.png?ssl=1\" alt=\"\" data-recalc-dims=\"1\"\/><figcaption><em>In this example, an employer can easily find universities where a large number of students are interested in working in Detroit.&nbsp;<\/em><\/figcaption><\/figure>\n\n\n\n<p>In this example, an employer can easily find universities where a large number of students are interested in working in Detroit. <\/p>\n\n\n\n<p>This is already having a massive impact on the access to opportunity students have. Take CDW as an example. Historically, CDW has struggled to compete for talent against flashier, consumer facing brands. Since adopting Handshake Premium they’ve <a rel=\"noreferrer noopener\" target=\"_blank\" href=\"https:\/\/joinhandshake.com\/blog\/employers\/how-cdw-became-a-proactive-recruiting-engine-with-handshake-premium\/\">rethought their entire university recruitment strategy<\/a> and increased the number of universities they engage with from 50 to 500. <\/p>\n\n\n\n<p>By leveraging Handshake’s data and our deep relationships with over 900 universities we can help increase opportunity for students around the globe. <\/p>\n\n\n\n<h3>Conclusion: Three Questions to Ask When Evaluating Technologies.<\/h3>\n\n\n\n<p>As universities seek to engage 100% of their students, the process of evaluating technologies will become more and more crucial. Buzzwords abound — we’ve used a lot of them in this post! We’ll conclude with a framework you can use when evaluating technologies to understand if they’re set up to deliver the level of personalization expected.<\/p>\n\n\n\n<h4>What data do you use to train your personalisation algorithms?&nbsp;<\/h4>\n\n\n\n<ul><li> A large data set: Algorithms are only as good as their training data. The smaller and less diverse the data set the less likely it is to be relevant to a diverse population of students. <\/li><li>You should not have to &#8220;seed&#8221; the data: If the career service is asked to provide the training data it’s likely you’ll create algorithmic bias. Usually, careers teams only have access to data from students who have used their service, meaning you’re training the algorithm to help the students that are already engaged. <\/li><\/ul>\n\n\n\n<h4>How do you ensure your use of data to protect user privacy?&nbsp;<\/h4>\n\n\n\n<ul><li> User control: Laws like GDPR, FERPA and California’s new privacy law dictate the user must be in full control of how their data is used. <\/li><\/ul>\n\n\n\n<h4>What’s your business model?&nbsp;<\/h4>\n\n\n\n<ul><li> Does their business model incentivize data protection? Do they have defined company values and policies that help inform decisions around data protection? <\/li><\/ul>\n\n\n\n<p>Data isn’t going away, but it is disrupting entire industries that have been hesitant to embrace the power of networks and data (Taxis → Ridesharing). As universities are asked to do more with fewer resources, systems that can use data to drive efficiencies will become essential.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Handshake UK&#8217;s David Shull discusses the prerequisite for personalization at scale and why that’s been a challenge for university career centers everywhere.<\/p>\n","protected":false},"author":167034972,"featured_media":1240,"menu_order":0,"template":"","career_centers_category":[1417],"career_centers_tag":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Personalization at Scale: The Future of Career Services | Handshake<\/title>\n<meta name=\"description\" content=\"Handshake UK&#039;s David Shull discusses the prerequisite for personalization at scale and why that’s been a challenge for university career centers everywhere.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Personalization at Scale: The Future of Career Services | Handshake\" \/>\n<meta property=\"og:description\" content=\"Handshake UK&#039;s David Shull discusses the prerequisite for personalization at scale and why that’s been a challenge for university career centers everywhere.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/\" \/>\n<meta property=\"og:site_name\" content=\"Handshake\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/joinhandshake\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/edeani_19-lafayette-handshake-proof-3016.jpg?fit=1024%2C683&#038;ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"683\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@joinhandshake\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/joinhandshake.com\/#organization\",\"name\":\"Handshake\",\"url\":\"https:\/\/joinhandshake.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/joinhandshake\",\"https:\/\/www.instagram.com\/joinhandshake\",\"https:\/\/www.linkedin.com\/company\/team-handshake\/\",\"https:\/\/twitter.com\/joinhandshake\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1\",\"width\":1200,\"height\":628,\"caption\":\"Handshake\"},\"image\":{\"@id\":\"https:\/\/joinhandshake.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/joinhandshake.com\/#website\",\"url\":\"https:\/\/joinhandshake.com\/\",\"name\":\"Handshake\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/joinhandshake.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/joinhandshake.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/edeani_19-lafayette-handshake-proof-3016.jpg?fit=1024%2C683&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/edeani_19-lafayette-handshake-proof-3016.jpg?fit=1024%2C683&ssl=1\",\"width\":1024,\"height\":683},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#webpage\",\"url\":\"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/\",\"name\":\"Personalization at Scale: The Future of Career Services | Handshake\",\"isPartOf\":{\"@id\":\"https:\/\/joinhandshake.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#primaryimage\"},\"datePublished\":\"2020-01-17T18:43:19+00:00\",\"dateModified\":\"2020-01-17T18:43:19+00:00\",\"description\":\"Handshake UK's David Shull discusses the prerequisite for personalization at scale and why that\\u2019s been a challenge for university career centers everywhere.\",\"breadcrumb\":{\"@id\":\"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/joinhandshake.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Personalization at Scale: The Future of Career Services\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Personalization at Scale: The Future of Career Services | Handshake","description":"Handshake UK's David Shull discusses the prerequisite for personalization at scale and why that’s been a challenge for university career centers everywhere.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/","og_locale":"en_US","og_type":"article","og_title":"Personalization at Scale: The Future of Career Services | Handshake","og_description":"Handshake UK's David Shull discusses the prerequisite for personalization at scale and why that’s been a challenge for university career centers everywhere.","og_url":"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/","og_site_name":"Handshake","article_publisher":"https:\/\/www.facebook.com\/joinhandshake","og_image":[{"width":1024,"height":683,"url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/edeani_19-lafayette-handshake-proof-3016.jpg?fit=1024%2C683&ssl=1","path":"\/srv\/htdocs\/wp-content\/uploads\/2020\/01\/edeani_19-lafayette-handshake-proof-3016.jpg","size":"full","id":1240,"alt":"","pixels":699392,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@joinhandshake","twitter_misc":{"Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/joinhandshake.com\/#organization","name":"Handshake","url":"https:\/\/joinhandshake.com\/","sameAs":["https:\/\/www.facebook.com\/joinhandshake","https:\/\/www.instagram.com\/joinhandshake","https:\/\/www.linkedin.com\/company\/team-handshake\/","https:\/\/twitter.com\/joinhandshake"],"logo":{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/#logo","inLanguage":"en-US","url":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","contentUrl":"https:\/\/i1.wp.com\/joinhandshake.com\/wp-content\/uploads\/2019\/11\/handshake-share.png?fit=1200%2C628&ssl=1","width":1200,"height":628,"caption":"Handshake"},"image":{"@id":"https:\/\/joinhandshake.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/joinhandshake.com\/#website","url":"https:\/\/joinhandshake.com\/","name":"Handshake","description":"","publisher":{"@id":"https:\/\/joinhandshake.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/joinhandshake.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#primaryimage","inLanguage":"en-US","url":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/edeani_19-lafayette-handshake-proof-3016.jpg?fit=1024%2C683&ssl=1","contentUrl":"https:\/\/i0.wp.com\/joinhandshake.com\/wp-content\/uploads\/2020\/01\/edeani_19-lafayette-handshake-proof-3016.jpg?fit=1024%2C683&ssl=1","width":1024,"height":683},{"@type":"WebPage","@id":"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#webpage","url":"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/","name":"Personalization at Scale: The Future of Career Services | Handshake","isPartOf":{"@id":"https:\/\/joinhandshake.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#primaryimage"},"datePublished":"2020-01-17T18:43:19+00:00","dateModified":"2020-01-17T18:43:19+00:00","description":"Handshake UK's David Shull discusses the prerequisite for personalization at scale and why that’s been a challenge for university career centers everywhere.","breadcrumb":{"@id":"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/joinhandshake.com\/blog\/career-centers\/personalization-at-scale-the-future-of-career-services\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/joinhandshake.com\/"},{"@type":"ListItem","position":2,"name":"Personalization at Scale: The Future of Career Services"}]}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/career-centers\/1238"}],"collection":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/career-centers"}],"about":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/types\/career-centers"}],"author":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/users\/167034972"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media\/1240"}],"wp:attachment":[{"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/media?parent=1238"}],"wp:term":[{"taxonomy":"career_centers_category","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/career_centers_category?post=1238"},{"taxonomy":"career_centers_tag","embeddable":true,"href":"https:\/\/joinhandshake.com\/wp-json\/wp\/v2\/career_centers_tag?post=1238"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}